tasks = {
    "Мат в 1 ход": [
        {
            "fen": "k1K5/8/2R5/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/K1R5/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5K2/8/8/3R4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/8/6K1/8/8/2R5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/1R6/4K3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6R1/8/5K1k/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5k2/5q2/7K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1q6/1k6/8/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "q7/8/8/8/8/8/7K/5k2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7q/8/8/8/8/3k4/8/2K5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/q1k5/8/1K6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/7K/5k2/6q1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/K7/8/8/8/8/Q7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/Q7/5K2/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2K2Q2/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/4QK2/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/4K3/8/4Q3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/8/2K5/8/8/7Q/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6q1/8/3k4/8/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7q/8/3k4/8/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/K1k5/2q5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/K1k5/4q3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3q4/8/8/7K/5k2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/3q4/8/7K/5k2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/5P2/K7/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5P2/6K1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/8/8/8/8/8/5K1k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k5/4P3/1K6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P7/k7/2K5/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/1P6/4K3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/r7/8/8/8/1R6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/8/6K1/8/8/8/8/5R1r w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6rk/6R1/7K/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7R/8/8/8/8/2K5/8/kr6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K1k/8/8/8/8/6R1/6r1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4R3/8/8/8/5K2/7r/6k1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/6k1/5r2/5B1K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4k3/B1r5/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/6k1/4B2r/5K2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4B3/6k1/4r3/6K1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r7/8/8/8/8/3k4/5B2/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/K1k5/8/8/8/8/8/Br6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2K5/8/8/8/8/8/q6R w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "q6k/5K2/R7/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/K7/7R/k6q w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k6/8/1K6/4q3/8/8/8/3R4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/R7/5K2/7k/6q1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/6q1/4K3/8/8/3R4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5K1n/8/8/8/8/8/6R1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "n6R/8/8/8/8/8/2K5/k7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2K5/2Rn4/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/6n1/6K1/8/8/8/8/5R2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/1Rn5/3K4/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/5K1k/8/6R1/7n w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/k7/P1r5/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/7P/r3k2K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7r/8/8/8/8/2k5/P7/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r7/8/8/8/8/3k4/1P6/2K5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1r6/8/8/8/KPk5/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r7/8/8/8/5k2/7K/6P1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b1K5/8/8/B7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Bbk/8/7K/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6B1/8/8/8/8/6K1/8/6bk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2B5/8/8/b7/k1K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b7/2K5/3B4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6bk/8/5K2/8/8/8/1B6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5B1k/5K1n/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "knB5/8/1K6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/B7/n1K5/k7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/6KB/8/6nk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/n1K5/B7/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/1K6/8/knB5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/5K1p/5B1k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5K1p/8/8/8/B7/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/p7/2K5/8/8/5B2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/p7/k1K1B3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K3B1/p7/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "B7/8/8/8/8/5K2/7p/7k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kr6/8/8/8/8/8/2K5/5Q2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6rk/8/Q7/8/8/8/2K5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k1r3/8/3K4/8/4Q3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/Q7/8/8/2r5/3k1K2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2K1k3/4r3/8/8/8/8/Q7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5K2/Q7/7k/7r/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/8/8/8/8/KRq5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5k2/8/q5RK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2q5/8/8/8/8/3k4/8/3KR3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "q7/2R5/8/8/8/3k4/8/3K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3q4/8/K5R1/2k5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3q4/6R1/K7/2k5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2K5/b7/8/8/1Q6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K1k/7b/8/8/8/7Q/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3Q4/2K5/b7/k7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/8/3K4/5b2/8/1Q6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4Q2b/7k/8/5K2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/8/4K3/1Q6/8/8/7b/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2K5/q7/8/8/8/8/1Q6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/2q5/6QK/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Q2/8/1q6/k7/2K5/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/5K2/4Q3/7k/7q/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Q2/8/8/8/K7/8/k7/1q6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7Q/8/8/8/1K6/8/3kq3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1q6/8/8/8/1k6/8/K6Q b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1Q6/8/8/8/8/3q4/5k1K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/7q/7k/8/4Q1K1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7k/q7/7K/6Q1/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3QK3/q7/4k3/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3K4/2Q5/4k3/8/8/q7/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/8/n7/8/8/1Q6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5K2/8/5n2/6Q1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5K2/6nk/8/4Q3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7Q/8/8/8/8/K7/8/nk6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3nk3/7Q/5K2/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/1Q6/8/4K3/3n4/4k3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/p1Q5/8/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/7p/8/8/8/Q7/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/Q7/p7/k3K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7Q/8/8/8/8/8/7p/5K1k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/7p/3QK2k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/1K2Q3/8/k7/p7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7K/k6P/3q4/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2q4k/8/8/8/8/8/P7/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4q3/8/KP6/8/2k5/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7q/7P/7K/8/6k1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2k5/8/K7/P7/4q3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4q3/8/1P6/K7/8/1k6/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kr6/8/K7/3N4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K1k/7r/8/8/7N/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/r2N4/k1K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4N3/7K/8/6rk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kb6/8/K7/8/N7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K1k/7b/8/6N1/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/N7/b7/k1K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4N3/7K/8/6bk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kn6/8/1K6/3N4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5K1n/8/8/5N2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/NK6/8/kn6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/6K1/8/3N2nk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7K/4nk1P/8/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "K1k5/P7/n7/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3n4/8/P7/K1k5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/6n1/8/7P/5k1K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7K/5k1P/8/8/5n2/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "K1k5/P7/4n3/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5P1r/8/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3K1k2/5r1P/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2K5/kP6/r7/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/1P1r4/5K2/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/6rk/8/7K/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7r/6P1/7k/5K2/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kb6/8/KP6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K1k/7b/6P1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/8/8/8/1K6/8/kb6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P7/8/8/8/8/7b/5K1k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kbK5/2P5/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5KPk/7b/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4k3/Q6p/5K2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4k3/p7/1Q1K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4k3/2Q2p2/3K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/7Q/5kpK/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5k2/1p6/2Q1K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4Q3/8/5k2/7K/7p/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/n1K5/1P6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Knk/5P2/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k6/2nP4/1K6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "n2k4/1P6/4K3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k1n3/5P2/1K6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1n6/P7/k7/2K5/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/p1P5/8/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5K1p/6P1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/8/8/8/8/p7/k1K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/1P1p4/5K2/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P7/8/8/8/1p6/k7/2K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K2/6Pk/7p/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/8/8/8/8/1R6/6RK w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/4R3/3R4/8/8/8/8/7K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/R7/7R/8/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6R1/8/7k/8/8/1R6/7K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "RK2k3/1R6/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/5R2/1k2K2R w K - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7r/8/8/7k/8/6r1/7K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k1K1/r7/8/8/8/8/8/8 b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/r5kr/3K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1k6/1r6/K7/1r6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4r3/8/8/2k5/8/3K4/4r3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4k3/6r1/4K3/r7/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kBK5/8/B7/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/8/6K1/8/8/BB6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/3B4/4K3/8/8/8/8/4B3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1K1B4/8/k7/7B/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7B/8/2B5/8/5K2/3k4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/B7/8/8/7k/8/4B2K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/8/8/8/2K5/7Q/5Q2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/Q7/8/6K1/8/8/6Q1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/8/1Q6/Q7/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/8/6Q1/8/8/7Q/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/Q2Q4/8/4k3/8/8/1K6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2Q5/8/8/4k3/8/3Q4/8/7K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/K7/3N4/k3N3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7N/8/8/5K2/5N1k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1N5/2KN4/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/8/5NKN/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2N5/8/N7/8/2k1K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/2K5/6N1/5N2/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2P5/1P6/8/8/8/8/3K4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/4P3/4KP2/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k5/2P5/1PK5/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/7k/5P2/5K2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/kPK5/8/1P6/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3P4/3k4/3P4/3K4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/3pk3/4p3/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/3k4/2p3p1/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/k7/3pp3/1K6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2k5/p7/K7/p7/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/6k1/8/5ppK/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/3pk3/p7/2K5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/K7/8/5B2/8/8/1R6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/5BR1/k1K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1R2K2k/8/8/8/4B3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6k1/8/4K3/8/8/2B5/7R/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "R1B1k3/8/3K4/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K2/7k/8/8/8/7B/8/7R w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/7R/8/8/8/8/8/1Q2K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7k/4Q1R1/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/8/4Q3/2R5/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k5/7R/8/8/8/8/1Q6/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/Q7/R3K1k1 w Q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5R2/4k3/8/2K5/3Q4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/8/8/8/8/7r/6q1/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/1r6/K2k1q2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2K1k2r/5q2/8/8/8/8/8/8 b k - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3k4/8/4K3/r7/8/q7/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/2K1k3/q7/1r6/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7r/3K4/1k3q2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/1R6/5N2/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/1R6/1K6/3N4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2R2K1k/8/8/6N1/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/4N3/3K4/8/8/8/2R5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6R1/7k/8/7K/4N3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1R6/8/8/k1N5/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6Pk/6R1/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/1RP5/8/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/8/8/8/8/7R/k1K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2P5/8/K7/R7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k5/2P5/2K5/8/8/1R6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1R6/2kP4/8/1K6/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/7Q/8/8/8/7B/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/8/8/8/8/8/2Q5/1B2K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/1B5k/5Q2/8/8/3K4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2K2Q2/8/2k5/8/8/4B3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/3k4/8/B4K2/8/1Q6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4B3/6Q1/4k3/8/5K2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/NK4B1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K1k/8/8/4N3/4B3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/B1N5/2K5/k7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/B7/8/7N/8/7K/8/7k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/4B3/4K3/8/6N1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/5N1k/B4K2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6k1/3b4/8/8/2p5/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2b5/8/8/5kp1/8/7K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6p1/8/8/5kbK/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4b3/8/8/8/8/2k5/3p4/3K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/2kpK3/6b1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4k3/4b3/4K3/4p3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5N1k/8/8/8/8/3Q4/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/7N/7Q/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5N2/8/8/2K1k3/6Q1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1N1k4/8/Q2K4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4N3/8/8/4k3/8/4K3/8/7Q w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4Q3/7N/8/5k2/3K4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2P5/8/8/3Q4/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/Q7/3P4/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3Pk3/8/3Q4/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2Q5/4kP2/8/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4K3/8/3k4/1Q6/3P4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2K5/4Q3/2k5/8/3P4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/2P5/8/1N6/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/8/5NPK/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/8/1P6/3N4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/4P3/N3K3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/7k/8/6KN/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2K5/3Pk3/8/6N1/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6RK/r6R/7k/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r6R/8/8/8/8/6k1/8/R6K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/3k4/RR1r4/1K6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/3k4/7r/2RKR3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4r3/5k2/2R4R/6K1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "R2r4/8/8/8/2k5/K7/1R6/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4n2k/6n1/6K1/8/8/8/8/5R2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2nkn3/R7/4K3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/pp6/8/8/8/8/4K3/6R1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/1K6/7R/kp6/1p6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k2K1R/1pp5/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6k1/4K1pp/8/8/8/8/8/5R2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1b6/k6r/2K5/7R w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/4rb2/2K5/8/8/8/1R6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6rk/8/5K2/8/8/R6q/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/R3rq2/2K5/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/7K/R7/6rk/6q1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/2qr4/5K2/8/8/8/8/7R w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/6nr/8/5R2/8/8/4K3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kr6/1n6/6R1/8/8/8/4K3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2rkn3/6R1/4K3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6nr/7k/8/6K1/8/5R2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6R1/8/8/8/7r/7k/5K1p/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/1p6/kr6/8/2K5/7R w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/B4r2/2k5/K4Q2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2r5/8/8/4B3/6k1/Q7/7K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5BrQ/5k2/7K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7r/5B2/8/8/8/2k5/K7/1Q6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4k3/2B3r1/3K2N1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r2B1/8/8/8/8/5k2/4N3/5K2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/p1K5/2b5/3R4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Kbk/6Rp/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/2K1pb2/8/8/8/8/8/3R4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k1K2R/1bp5/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6q1/7k/5Kn1/4R3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1q6/kn6/1R6/1K6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5K1p/8/8/4q1R1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "q6R/8/8/8/2K5/k7/1p6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6q1/6pk/8/5K2/R7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/2p2K2/1R5q/6k1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4R3/8/8/8/8/6K1/5n1p/6k1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/n7/k7/p1K5/8/1R6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1B6/8/8/8/8/5Kbb/7k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b7/2K5/8/4B3/8/4b3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6nk/6n1/6K1/8/8/2B5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1n5/n1K5/B7/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/B4K1p/7k/7p/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7B/8/p7/kp6/8/1K6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kb6/1r6/K1B5/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3rkb2/8/4K3/8/8/8/4B3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/B2r4/n1K5/k7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/6KB/8/5rnk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/B6p/5K1k/7r/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7B/8/r7/k1K5/p7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/b2Q4/8/k7/8/KB6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3b4/8/8/8/8/4k3/8/3QKB2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1b6/8/8/8/6k1/6B1/6NK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5b2/8/8/1Nk5/8/KB6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "KB3k2/P7/8/8/8/8/2b5/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7k/b7/6BK/7P/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/B3q3/n1K5/k7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2B5/8/8/6K1/6q1/6nk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7p/3B1K1k/7q/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7B/8/q7/k1K5/p7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/pnK5/k1B5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4B3/5K2/4n2p/7k w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4r3/3rk3/8/6K1/3Q4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4r3/2K1k3/4r3/8/3Q4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6b1/7k/Q6b/7K/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6kb/8/4K3/8/8/3b4/8/5Q2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/Q7/8/4K3/1n1n4/3k4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6n1/8/4n2k/5K2/3Q4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1K2k3/PP6/8/8/7q/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6PK/3k2P1/8/8/8/q7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7q/2B2k2/2RK4/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1Q6/2K1k3/1R6/8/8/3q4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3QR3/4K3/6q1/4k3/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kr6/1n6/8/8/4K3/8/8/5Q2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/5n1r/8/2Q5/8/3K4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6Q1/8/1rkp4/8/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3rp3/3k4/8/4K3/8/5Q2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1Q6/5q2/4k3/2K2b2/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5b2/5kq1/1Q6/3K4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6bk/4Q2n/6K1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b1K5/5n2/8/2Q5/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6pk/6b1/8/8/4K3/Q7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3b1p2/4k3/Q7/5K2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/q7/8/knQ5/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/3n1q2/3K4/8/2Q5/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/p7/8/3q1Q2/8/4K3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/3qp3/8/3Q4/8/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1Q6/8/8/6q1/6pk/8/8/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2p1q3/3k4/1Q6/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6n1/8/5Qpk/8/5K2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7Q/8/8/3K4/2np4/3k4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7r/5K1k/4N2r/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rkr5/8/1K6/4N3/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/N7/b7/k1K1b3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4N3/7K/4b3/6bk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3nk3/4n1K1/8/8/4N3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4N2n/6nk/8/6K1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P2n4/K1k5/P7/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7P/6PK/8/7k/4n3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4n3/8/5R2/4BK1k b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6nB/6RK/8/7k/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4Q3/8/3n4/k7/8/KR6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/5n2/8/4R3/2k1KQ2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2K1kn2/4r3/8/5N2/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7K/8/3N2rk/7n/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/p7/k1K5/r7/8/3N4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7r/5K1k/7p/8/4N3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1q6/N7/b7/k1K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3qN3/7K/8/6bk w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kn6/1b6/1K6/3N4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6K1/8/6nk/4N2b/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3N4/2K5/p7/kb6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1K6/8/kp6/bN6/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4kq2/2K1n3/8/8/4N3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4N3/6K1/8/6nk/7q/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/p7/8/3N4/4q3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4N2p/5K1k/7q/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/1K6/8/kp2N3/q7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4N3/8/7p/5K1k/7q/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/p2N4/kn6/8/1K6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4N3/6K1/8/6nk/7p/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1r5/r2P4/8/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/2P1rr2/8/8/8/8/3K4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6bk/6b1/5PK1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b1Kb4/1P6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/4nK1n/6P1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Knk/5P2/8/6n1/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/8/8/8/2p1PP2/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1p6/P7/K1k5/P7/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5p1k/6R1/6BK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1B2k3/KR6/p7/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4R2Q/5kpK/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5R2/4pKQ1/3k4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5n1k/4P2r/8/8/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P7/8/8/8/3n4/2K5/k2r4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/pr6/P7/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7r/5K1k/7p/6P1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1q1k4/P3b3/4K3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3bkPK1/4q3/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4n2k/5P2/7K/8/b7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6nk/6b1/6KP/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/p1b5/1P6/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7p/5K1k/7b/8/6P1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5n2/5KPk/7q/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2Knk3/2P2q2/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5q1k/4P2p/8/8/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P7/kp6/1q6/8/8/2K5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/2P1pq2/8/8/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/q7/k1K5/p7/1P6/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1n5/p2P4/8/8/8/8/3K4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Knk/7p/6P1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7R/kr6/7R/K7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "R7/8/7r/7k/8/7K/6R1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1b5k/8/8/8/6R1/3K4/6R1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k3K2/3RR3/8/2b5/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/R6R/8/8/4q3/8/3K4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/k7/8/1R6/1R6/8/2q5/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/5r2/8/3k4/2r5/3NK3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4k3/8/4K3/3N3r/2r5/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/5k2/8/8/1r2Pr2/3K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P7/K2k2r1/1r6/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4b3/k7/1R6/K1b5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3b4/8/b2R4/8/8/8/2k5/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6b1/7k/8/5K2/3BB3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6b1/6Bk/8/5K2/8/8/2B5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/kBK5/4q2B/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1q6/kBB5/2K5/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/3B4/1nK5/8/8/8/5B2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/3B4/1n2K3/8/8/8/5B2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/p7/8/8/8/6B1/K7/5B2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/p1B4B/k4K2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/4rNK1/8/8/4N3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/N7/r7/k3N3/8/1K6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/b7/k1K1N3/8/8/1N6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/2N1b3/2KN4/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5K1k/8/8/4N1N1/4q3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kq6/1N6/K7/3N4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2nk4/5K2/8/2N5/3N4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5N2/6n1/3N3k/8/6K1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4N2p/3N3k/8/6K1/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/7N/4NK2/3p4/4k3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/rP6/k1K5/8/1P6/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4P3/3rk3/6K1/2P5/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3bkPP1/8/3K4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4P3/4k3/3bP3/6K1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/K1kPP3/2q5/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3P4/3k1K2/1Pq5/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/1pp5/1Nk5/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5pk1/6Np/7K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/P7/Kpk5/1p6/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6p1/2k5/4KP2/4p3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/7p/8/5pKP/4k3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/3k4/1p6/3KP3/3p4/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kB6/1R6/8/8/8/8/5K2/1R6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/R7/8/8/8/8/1K6/4B1R1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/R7/3k4/R7/8/7K/4Q3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/5R2/4k3/3R4/Q7/6K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6R1/5N2/6R1/7k/8/3K4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3R4/8/5R2/4k3/8/3KN3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/R5RP/8/8/8/8/4K3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1R6/k1P5/1R6/8/8/8/8/5K2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5R2/4k3/8/8/8/2B1K2B w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/R7/7k/7B/5K2/8/3B4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3B4/8/3k4/7Q/8/8/K5B1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7B/8/4k3/8/B6K/3Q4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/k7/3N4/1K1BB3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7k/6N1/6K1/8/2BB4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/k7/8/K7/1P2BB2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5P1k/2B5/7K/8/2B5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/N3R3/3k4/8/3K4/4N3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3N1N2/6R1/3k4/8/3K4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5N1k/8/7N/8/8/K7/8/4B3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/B1NN4/8/8/6K1/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3N4/8/7Q/3k4/8/5N2/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4N3/8/2Q5/4k3/8/8/3N4/6K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2N5/3N4/k7/8/KP6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4NN2/6P1/7k/8/7K/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6p1/8/5kpK/6p1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/5k2/p1p3p1/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4k3/1p6/8/Kpp5/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4k3/2p3p1/4K3/4p3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/3k4/3p4/3Kp3/1r6/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4p3/3k4/3p4/3K4/6r1/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/8/1PP5/8/8/5B2/1K6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/7P/1B4P1/8/8/8/8/6K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5QP1/7k/8/7P/8/K7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1Q6/8/8/2Pk4/8/3P4/8/7K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6N1/5KPk/8/8/6P1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3kP3/1P1N4/4K3/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7R/4k3/2Q5/7B/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3R4/4k3/7Q/7B/8/2K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/N1Bk4/5K2/8/8/4R3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3B4/8/3k4/7R/2KN4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7R/k7/8/P7/4B3/8/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5P1k/6R1/8/8/8/1B6/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5R2/2N5/8/4k3/Q7/8/8/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Q3N3/8/8/4k3/1R6/8/7K/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/R5P1/7k/5Q2/8/8/8/3K4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3R4/4k3/6P1/8/5Q2/1K6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/2KPk3/8/6N1/5R2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5N2/2R5/5k2/8/5K2/6P1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/8/b7/8/1Kn5/7q b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1b5/5q2/8/8/8/3n2K1/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1q3kb1/3K1n2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4k3/7b/4K3/8/1n5q/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/q1k2pb1/8/3K4/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7b/8/4kp2/8/4K3/6q1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5K1N/6Bk/8/8/6P1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2N5/8/k7/8/1KP5/3B4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1N1k4/1Q6/3P4/5K2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1Q6/8/4k3/4P3/8/1K2N3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4Q3/8/3k2N1/1P6/8/6K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6N1/8/4k3/7Q/2P5/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2Q5/8/3b4/3k4/8/1K3N2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3Q4/5kq1/8/5K2/4P3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1P6/k1K5/qN6/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6K1/3Pk3/4p3/B7/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1Q1q4/4k1K1/2P5/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3N4/3r4/3k4/1Q6/5K2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7K/6P1/7k/6n1/5N2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4bK2/3k1P2/8/8/8/8/7B/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/3kr3/QP6/3K4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1B6/8/8/7Q/4k3/3q4/6K1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2Pr4/3k4/8/2Q2K2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6Q1/4k3/2K2b2/3P4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6qk/8/7K/8/8/8/1R6/B7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1N1K4/8/1R6/kr6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2nk4/5K2/1R6/B7/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3R3B/4kb2/8/5K2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2K5/k7/1q6/2R5/8/4B3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2R5/1K1k4/2N1r3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2b5/2Q5/3K4/4r3/3k4/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/1k6/2n5/1KP5/r7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4R3/4K1k1/3r4/5b2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/n1r5/3KB3/8/3k4/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/5Q2/3k1K2/2n3r1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2B1r3/3K4/2n5/3k4/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4Q3/8/8/K1n5/2k5/3R4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2R5/3kn3/8/4K3/2N5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2R5/3kb2B/8/3K4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3q1N2/4k1K1/3R4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4Q3/8/3q4/3k4/2R5/8/8/2K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4Q3/2p5/3k4/8/R3K3 w Q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3Q4/8/4k3/4r3/1K6/8/5R2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2R5/3kq3/7K/8/4Q3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2R5/3k4/4r3/8/8/2K3Q1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4Q3/6b1/5k2/8/4K2R w K - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/2n5/2k5/1R5K/3Q4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/R2Q4/1n6/2k5/8/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5q2/8/4P3/4K3/5r2/6k1/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3K4/4Q3/qk4b1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/b1k5/B2n4/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6n1/4b3/8/4k2P/6K1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5b2/8/8/R7/K3n3/8/2k5/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4b3/8/8/8/8/3k4/6n1/2QK4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5B2/8/p7/k7/3N4/K7/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1B6/8/8/6K1/8/3N3k/6b1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5B2/8/8/n7/k7/8/K7/1R6 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/B7/2N5/5K2/8/2nk4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/2qP4/4K3/4N3/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4B3/7b/5K1k/8/8/4N3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/4r3/2K5/8/7B/7Q/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4N3/8/8/3kq3/6Q1/1K6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2q5/3k4/5P2/2QK4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "B7/8/4q3/4k3/8/6K1/8/2Q5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5N2/8/8/5k2/3Q1n2/5K2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6N1/2Q5/4b3/3k4/8/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7r/6Pp/8/8/5k1K b - g3 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/pPk5/8/K7/2q5 b - b3 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/q7/pP6/K7/2k5/8 b - b3 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7r/8/8/8/6Pp/8/5k1K/8 b - g3 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/kPp5/8/K7/2q5 b - b3 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7q/8/6Pp/8/5k1K/8 b - g3 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp2p/8/5pp1/8/8/8/3QK3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp3/5ppp/8/8/8/8/1B2K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp2p/5p2/6p1/8/8/8/3BK3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/ppppnp1p/4p1p1/8/4N3/8/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/pp1pnppp/8/2p1pN2/8/8/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp3/6p1/5p1p/8/8/8/4K1Q1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/8/1P1P4/2Q5/PpP1PPPP/RNB1KBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2r1k3/8/8/5Q2/3P4/8/PP1PPPPP/RNB1KBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/7q/8/2QP4/8/PPP1PPPP/RNB1KBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k2r/8/8/3B4/4N1P1/6P1/PPPPPP2/RNBQK2R b KQk - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/5B2/3P4/1Q6/1P1P4/P1p1PPPP/RN2KBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/3Q4/3nP3/8/PPPPNPPP/R1BNKB1R b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/7Q/2B5/8/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/8/2B5/5Q2/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/3Q3B/8/8/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/4P1P1/8/8/8/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/6P1/8/8/5Q2/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/4P3/7B/8/8/8/4K3 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/2b5/3q4/8/PPPPPPPP/RNBQKBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/1q6/2b5/8/8/PPPPPPPP/RNBQKBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/8/6nq/8/PPPPPPPP/RNBQKBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/1q6/8/4n3/8/PPPPPPPP/RNBQKBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4kr2/8/8/8/7b/8/PPPPPPPP/RNBQKBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/8/2b5/6n1/8/PPPPPPPP/RNBQKBNR b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/rb6/k7/8/PPPPPPPP/RNBQKBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/r7/kb6/8/PPPPPPPP/RNBQKBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/r7/kr6/8/PPPPPPPP/RNBQKBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/7n/6nk/8/PPPPPPPP/RNBQKBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6rq/6pk/8/PPPPPPPP/RNBQKBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/5r2/4bkr1/8/PPPPPPPP/RNBQKBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/5BKQ/6R1/8/8/8 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/4BK2/4PPP1/8/8/8 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/5BB1/5QKN/5PPP/8/8 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/5BR1/5QKN/5PPP/8/8 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/BN6/QKB5/PPP5/8/8 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppppppp/8/PP2P3/QKB5/1RN5/8/8 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/8/4p1q1/7P/2N2P2/PPPPP1P1/R1BQKBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk1nr/pppp1ppp/3bp3/8/P6P/5P2/1PPPP1P1/RNBQKBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/8/4p3/4P2q/5N2/PPPPKPPP/RNBQ1B1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkbnr/pppppppp/8/2n5/2P5/4P3/PP1PNPPP/RNBQKB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pp1ppppp/1qp5/8/3P4/8/PPPKPPPP/RNB1QBNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/4p3/6q1/8/2QP4/PPP1PPPP/RNB1KBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp1p1/5p1p/8/8/2P5/PPQPPPPP/RNB1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp1p1/5p2/7p/4P1Q1/8/PPPP1PPP/RNB1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp2p/8/5pp1/8/4P3/PPPPBPPP/RNBQK1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp1p1/5p2/7p/8/3BP3/PPPP1PPP/RNBQK1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp2p/8/5Pp1/8/8/PPPP1PPP/RNBQKBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp2p/5p2/6p1/6Q1/4P3/PPPP1PPP/RNB1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/ppppqppp/4p3/8/8/2KP4/PPP1PPPP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/8/4p3/3P3q/3K4/PPP1PPPP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/5q2/4p3/8/3PK3/PPP1PPPP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppqpppp/3p4/8/8/4PK2/PPPP1PPP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/8/4p3/7q/4KP2/PPPPP1PP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/8/4p3/5P1q/5K2/PPPPP1PP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/ppp1pppp/7q/3p4/3P4/7Q/PPP1PPPP/RNB1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pp1ppppp/2Q5/2p5/2P5/2q5/PP1PPPPP/RNB1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1knr/ppp2ppp/8/1B2P3/1b2p3/8/PPP2PPP/RNBQ1KNR w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkb1r/pp1pnppp/8/1Np1p3/1nP1P3/8/PP1PNPPP/R1BQKB1R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/ppppp2p/5P2/4N3/4n3/5p2/PPPPP2P/RNBQKB1R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk2r/pppppp2/6p1/3n2P1/3N2p1/6P1/PPPPPP2/RNBQK2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/ppppkppp/8/4p2Q/4P3/8/PPPP1PPP/RNB1KBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkb1r/pppp1ppp/2n2n2/4p2Q/2B1P3/8/PPPP1PPP/RNB1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk1bnr/pppp1Q1p/2n3p1/4p3/2B1P2q/8/PPPP1PPP/RNB1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1b1r/ppp1kBpp/3p3n/4N2Q/3nP3/8/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1b1r/p1pp1Qpp/2n2n1k/4p3/1BB1P1PP/1P6/P1PP1P2/RN2K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq2nr/p1ppbQpp/2n4k/4p3/1BB1P1PP/1P6/P1PP1P2/RN2K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k1nr/pppp1ppp/8/2bNp2Q/4P3/8/PPPP1qPP/R1BK1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2qkb1r/ppp2ppp/5n2/3pp3/1n2P1b1/2N3QN/PPPP1PPP/R1B1KB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k2r/ppppqp1p/5b1Q/8/4n3/8/PPPP1PPP/RNBK1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k2r/ppppqp1p/5b2/8/6Q1/2n2N2/PPPPBPPP/RNB1K2R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqr1k1/pppp1ppp/8/8/1b1P4/3Q4/PPP2PPP/RNBK1BNR b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kb1r/pppp1ppp/7n/7Q/2Bn4/5N2/PPqP1PPP/RNB1K2R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkbnr/ppp2ppp/8/8/4Np2/5b2/PPPPQ1PP/R1B1KB1R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/pppp1Q1p/5p2/4k1p1/2B2p1P/8/PPPP2P1/RNB1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/pppp3p/1k3p2/3QP1p1/2B2p1P/8/PPPP2P1/RNB1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/ppp2kP1/7p/4Q3/4pP2/8/PPPP2PP/RNB1KBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbkn2r/ppppb2p/3N4/8/4P3/2N5/PPPP3P/R1B1KB1q w Q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2q1k1r/ppp1bB1p/2npb3/8/3PP2P/8/PPP5/RNB2RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k1nr/pppp1ppp/8/2b1P3/4P2q/8/PPPPK1PP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k1nr/ppp2ppp/8/3pP3/3bq3/4B3/PPP2KPP/RN1Q1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2k1nr/p4ppp/2p5/2b5/B3pPb1/2P2P2/PP1PN2P/RNBQRK2 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k2N/ppp1q1pp/5n2/2b5/5P2/2N5/PPPPBp1P/R1BQ1K1R b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2k2r/ppp2ppp/4B3/4N3/3Q1p1q/8/PPP1N1PP/R1B3KR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2k1nN/ppp4p/8/3B4/3bP3/5ppP/PPPP4/RNB1QK2 b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/ppppkppp/8/8/3QP3/8/PPP2PPP/RNB1KBNR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/ppp2ppp/8/4p1B1/4n3/8/PPPQPPPP/RN2KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1rk1/pppp1ppp/2n4B/b7/2B1n3/2P3Q1/PP3PPP/RN2K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kb1r/ppp2ppp/2n5/1Bq3B1/4n3/2N5/PPP2PPP/3RK1NR w Kkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb3rk/pp1p2pp/7N/2b5/2B4q/8/PPP2nPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1qrk1/pppp1p2/2n2Bp1/b7/2B1P3/2P5/PP3PP1/RN2K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2kbnr/ppp2ppp/4b1q1/4p1B1/2B5/2N2N2/PP3PPP/R2QK2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk2r/ppppbp1p/7p/3Q4/2B1P3/2p5/PP3PPP/RN2K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1rk1/ppp2ppp/2n5/3B4/1b1QP3/8/PB3PPP/R4KNR w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1rk1/pppp2pp/8/2bN1p2/2B3Q1/8/PB3PPP/R4RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbk3r/pppp1B1p/5p2/8/4P3/5N1q/PB3P1P/R3K1R1 w Q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1r2/ppppbpkp/5p2/8/7Q/3B4/PB3PPP/R4RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkbnr/pppp1ppp/8/4p3/2BnP3/5Q2/PPPP1PPP/RNB1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk1bnr/pppp1Qpp/2n5/4p1q1/2B1P3/8/PPPP1PPP/RNB1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1b1r/pp1pkBpp/2p5/4P3/8/8/PPP1N1PP/RNBn1RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbk1bnr/pppp1Bpp/5q2/8/8/8/PPPP1PPP/RNBQR1K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kbnr/pp1p2pp/2n2P2/2p3B1/2Bp4/5N2/PPP1qPPP/RN3RK1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2b1r/pppk1Bpp/1q1p4/6B1/1P6/2P5/P1P2PPP/R2QR1K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/ppppnp1p/6p1/3Np3/4P3/8/PPPP1PPP/R1BQKBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b2bkr/pppp2pp/2n5/4p1q1/8/5Q2/PPPP1PPP/R1B1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbk2nr/p1pp2pp/8/1N2p1p1/2BbP2q/5Q1N/PPP2PPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2q1knr/ppp3pp/1b1p2p1/1B6/3PPN2/2P5/PP4PP/R1Bb1RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1r1k/ppppN1p1/2n2npp/4p1N1/7P/1B1P4/PPP2PP1/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b3kr/ppp1np1p/1b1p1R1B/4p3/2BqP3/3P3N/PPP3PP/R2K4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k1nr/pppp1ppp/2n5/2b5/2B1P3/2N2N1K/PPPP1q1P/R1BQ3R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k2r/ppp2ppp/8/3p1P2/3nn2N/2NK3P/PPPP1bP1/R1BQ1B1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k2r/ppp2ppp/3p4/4n3/2B1P2q/2NP2P1/PPP1QR2/R1B2K2 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k4r/ppp2ppp/2n5/B3p3/1bb1N3/P2r1Q2/1P3PPP/R4KNR b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppp2ppp/3p4/3Bp3/4PP1q/3P1P1P/PPPQb3/R1B3KR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bBr1k1/ppp2ppp/8/8/1P2n3/P1PP1P2/4Bb1P/R2Q1K1R b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/pp1pk1pp/2p5/4p2Q/2B1P3/8/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2knQ/ppppq3/5pp1/2b5/2B1P3/8/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1q1bnr/pbp3p1/6kp/4Q3/4P2P/8/PPPP1PP1/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1b1r/pppp3p/5n1k/5Qp1/2BPP2P/8/PPP2PP1/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq2nr/ppppb1kp/8/5QP1/2BPP3/8/PPP2PP1/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/pppp1Q1p/7k/6p1/2BPP2P/8/PPP2PP1/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/ppp1k1pp/3p4/4Np1Q/4P3/8/PPPP1PPP/RNB1KB1R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1bnr/pppp1Qpp/8/8/2Nkp3/8/PPP2PPP/RNB1KB1R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1q1bnr/ppp2kp1/4b1p1/3BQ3/4p3/8/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq2r1/p1p2Qpp/3k4/1p1pN3/3Pp3/2N5/PPP2PPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1q2r/pp1k3p/3p1p2/3Q4/4p3/BP6/P1PP1PPP/RN2K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2q1knr/ppNnb1pp/3Nb3/8/3Pp3/8/PPP2PPP/R1B1KB1R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkN2/pppp3Q/2n5/5p2/4r1n1/8/PPPP1PPP/RNBK1B1R b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k3/ppppq2N/2n2n1Q/5p2/8/8/PPPPrPPP/RNB2K1R b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Q7/pppkq3/2p3p1/5b2/8/8/PPPP1bPP/RNBK3R b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kN2/pppp3p/5n1Q/5p2/3nq3/3P4/PPP1BPPP/R1B1K2R b KQq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kN2/pppp2Qp/8/5p2/5nn1/5P2/PPPPq1PP/R1B2RK1 b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kN2/pppp2Qp/8/5p2/5nn1/5P2/PPPPq1PP/R1B3RK b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2q1bnr/ppp1kBpp/2np4/4N3/4P3/2N5/PPPP1PPP/R1BbK2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2q1b1r/pppnkBpp/5n2/4p3/4P3/1Q6/PPP2PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2k1b1r/p1p1nppp/1p1N1q2/2n1p3/Q1B1P3/7P/PPPP1PP1/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq2nr/pppnb1pp/3p1k2/3Q4/4P3/8/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq2kr/ppp2npp/4P3/3p2N1/4p3/B1P5/P1P2PPP/R3KB1R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2q1b1r/pppb1Bpp/2np4/3N1p2/4k3/5N2/PPP2PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk2r/pppp1ppp/8/2b1N2Q/4n3/8/PPPP1PPP/RNB1KB1R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1r1k/pppp1Bpp/8/2b1N2Q/4n3/8/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2b1r/ppp1kBpp/3p4/4N3/3q4/2P5/PPP2PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kb1r/pppn2pp/8/6B1/2Bpq3/8/PPP3PP/RN3RK1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk1b1r/pppn1Bpp/8/6q1/3pQ3/8/PPP3PP/RN3RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk1b1r/ppp2Bpp/5R2/6B1/3pq3/8/PPP3PP/RN4K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkb1r/ppppnp1p/2n3p1/3N2B1/3NP3/8/PPP2PPP/R2QKBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqk2r/pppp1p1p/2n3p1/3n2B1/3QP3/8/PPP2PPP/R3KB1R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1k1r/ppppnp1p/5Np1/6B1/3nP3/8/PPP2PPP/R3KB1R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/pbppbppp/1p6/4Q1B1/2B1P1nq/2N5/PPP2PPP/R4RK1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqrk2/ppppb1pp/2n4N/3Q2n1/8/2N5/PPP2PPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqrk2/pppp2pp/2n4N/3Q2b1/4n3/2N5/PPP2PPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqk1nr/ppppbppp/2n5/3Q4/2B1P3/5N2/Pp3PPP/RNB1K2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq2nr/pppkbQpp/2np4/8/2B1P3/2p2N2/PP3PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1rk1/ppp1nppp/2n5/3p2NQ/2B1P3/2N5/PP3PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq2nr/pppp2p1/2n3kp/2bQ4/4P3/2N2N2/PP3PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k2r/ppppnppp/4n3/2Q3B1/2B1P3/2q2N2/P4PPP/R4RK1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2kr1b1r/Qppq1ppp/8/3nn3/6b1/2N1B3/PP2BPPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1b1r/ppp1kBpp/3p4/3PN3/8/2P5/PP3nPP/RNBQK2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbk1b1r/ppp3pp/3p4/1B1PNpq1/4Q3/2P5/PP3PPP/RN2K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbk1b1r/ppp1q1pp/3p4/1B1PN1B1/4p3/2P5/PP3PPP/RN2K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b2b1r/pppp1Bpp/8/2kP2q1/2N5/N1P5/PP4PP/R2nK2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1b1r/pppp1Bpp/8/2kP2B1/2N5/N1P5/Pn4PP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r4b1r/pppb1kpp/q1n3n1/5pB1/2NPp3/1QP5/PP3PPP/RN3RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqk2r/pp3ppp/2p5/1B1p4/4n2q/5N2/PPP2bPP/RNBQ3K b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3rkb1r/ppp2ppp/4b3/4Q3/2p1N3/8/PPP2PPP/R1B3K1 b k - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bNk2r/2pp2pp/8/ppn1p3/3b4/KB6/PPPPQ1PP/RNB4R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2kr1b1r/pbp2ppp/8/1B2p3/3P1n2/6NP/PP1P1P1P/RNBQ1RK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppp2N1p/2n1K1p1/3Bp3/7q/8/PPPP3P/RNB1Q2R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/ppp3pp/8/4p1N1/3n2b1/1BNPn3/PPPQ1P1P/R1B1KR2 b Qkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1rk1/ppppnp1p/2n3p1/2b1p1NQ/2B1P3/8/PPPP1PPP/RNB2RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1qrk1/ppppnNp1/2n5/2b1p2Q/2B1P3/8/PPPP1PPP/RNB2RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b3k1/ppp2r1p/2np1qNQ/2b1pp2/2B1P3/3P4/PPP2PPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1Q2r/ppp1n1qp/1bnpk3/4p1B1/3PP3/2P5/PP3PPP/RN3RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r4r1k/pppqNp1p/3p4/2b1p1Q1/2BnP3/3P1b2/PPP2PPP/R4RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq3R/pppp1Bp1/2nk2P1/2bNN3/4P3/3P4/PPP3P1/R2nK3 w Q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2rk1/pppp1ppp/8/2b5/2B1P1n1/8/PP4PP/RNBQR1NK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bn1rk1/ppp1B1pp/3p4/3Pp3/4n2N/2P4P/PP2BbP1/R2Q1K1R b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Q7/ppp2k1p/3p2p1/5b2/4P1n1/2P4P/PP1P1b2/RNB2R1K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k3/ppp2p1p/3p4/2b1ppr1/2B1P3/3P1P2/PPP2PbP/R2Q1RK1 b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2Nk3/1pp3p1/p1np4/4p3/2B1n3/P1NP4/1PP1KbP1/R1BQ3r b q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2Nk2r/ppp5/3p1n2/2b1p1Q1/2B1P3/2NP1bp1/PPP2P1P/R4RK1 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqk2r/pppp1ppp/1bn5/2nQP3/2B5/2P2N2/P4PPP/RNB2RK1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk2nr/pppp1Qpp/8/nP6/2B1P3/8/PqPP1KPP/RN5R w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqk2r/pppN1ppp/8/PB6/8/B7/2PPnnPP/RN2K2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bRnk1r/ppp1nBpp/8/b3p3/4P1q1/BQP2N2/P4PPP/RN4K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b2knr/ppp3pp/3p1qp1/b7/Q1B5/8/P1p2PPP/RNB1R1K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk2nr/ppp2Qpp/1bn5/4N1q1/4P3/2P5/P4PPP/RN3RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kbnr/pbpp1ppp/1p6/1B2q3/4P3/2P5/PP3PPP/RNBQK2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqk2r/ppppPppp/1b6/1B4B1/8/5N2/P3QPPP/qN2K2R w Kkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2qkb1r/1bp2ppp/p4n2/3p4/8/5p2/PPP1BPPP/RNBQR1K1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkb1r/2ppn3/p1n2P1p/1p5p/3N4/1B6/PPP2PPP/RNB2RK1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3Qbnr/1pp3pp/p1Bk4/4p3/2q1p3/2N1B3/PP3PPP/3bK2R w K - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk3r/2p2ppp/ppB1P3/8/3q4/B1P5/P1P2PPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kbnr/1pp2ppq/p1p5/6B1/4P1N1/3P4/PPP2PP1/RN1Q1RK1 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r4rk1/1pp2ppp/p1p5/2b1P3/6P1/2P5/PP1P1qP1/RNBQ3K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/1pp2pp1/p1p5/4p1Q1/4Pn2/3PB3/PPPN1PP1/R4RK1 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppp2ppp/8/2bBP1q1/6P1/3p2P1/PPPP2P1/RNBQ1R1K b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppp2pp1/8/2bpPRqp/6P1/1B1p2P1/PPPP2P1/RNB2Q1K b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/1bpp1ppp/p7/1p2PN2/5n2/1P5P/1PP2P1P/RNBQ1RK1 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kbnr/ppPqpppp/8/1B2N3/8/2N5/PPb2PPP/R1B1K2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kbnr/pP1qpppp/8/1B2N3/8/2N5/PPb2PPP/R1B1K2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkb1r/pbp1pppp/1n1P4/1N6/Bp6/5P2/PPPPQ1PP/R1B1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkb1r/pb1npppp/3p4/1N6/Bp6/5P2/PPPPQ1PP/R1B1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r2q1b1r/pp1n1kp1/2p1pnp1/8/3P4/2N5/PPP1QPPP/R1B1R1K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqnb1r/2pkpppp/p1p5/1N1P4/3N2P1/5P2/PPPP3P/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/ppp1pppp/8/3q4/8/8/PPPPKPPP/RNBQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bB1rk1/pp3ppp/2n5/4p3/2P1n3/3P4/PP2KbPP/R2Q1BNR b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/pppq1ppp/8/4Bb2/1bP1n3/P1N2Q2/1P2NPPP/R3KB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k1bnr/ppN2ppp/8/4B3/3n4/8/PPb2PPP/R3KB1R b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k4r/ppp2ppp/1n2b3/4P3/1nP2B2/bP6/P3NPPP/RK1N1B1R b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/pp3pQp/8/4pb2/1bP2P2/3q4/PPnP1KPP/RNB2BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/pppnp3/4p1p1/8/3p4/2NB4/PPPP1PPP/R1B1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2bkr/ppp1pqp1/1n1pP2p/6N1/8/8/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1b1r/pppkpBpp/8/2n1p1B1/8/1QP5/PP3PPP/R3K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2kb1r/pQ2pppp/2p2n2/4N3/3P4/8/PPP2PqP/RNB1K2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1b1r/ppppk1p1/4p1B1/4Pn2/2PP4/8/PP3PP1/RNB1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2R2/ppppk1p1/4p1B1/4Pnq1/2PP4/8/PP3PP1/RN2K1N1 w Q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/pppppppp/8/4P3/2P2n2/8/PP1PNPPP/RNBQKB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/pppppppp/8/4P3/1n6/2P5/PP1PNPPP/RNBQKB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bBk2r/pp3ppp/2n5/4p3/4n3/3P4/PPP1KbPP/R2Q1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/ppp1pppp/8/3N4/6b1/5nP1/PPPPNP1P/R1BQ1K1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/ppp1pppp/8/3q4/6b1/2N3P1/PPPPNP1P/R1BQnRK1 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/ppp1pppp/8/3N2n1/8/5bP1/PPPPNP1P/R1BQ1RK1 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkb1r/pppnnp1p/4p1p1/1B5Q/3PN3/8/PPP2PPP/R1B1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkb1r/pp1nnppp/2p1p3/1B5Q/3PN3/8/PPP2PPP/R1B1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k1nr/1p1n1pQp/p3pq1B/1BPp4/8/2P5/P1P2PPP/R3K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1r2/pp2npp1/4p2k/2ppP1N1/1b1P4/2NQ4/PPP2PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1r2/pp2npp1/4p3/2ppP1N1/1b1P2k1/2NQ4/PPP2P1P/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbq1r2/pp2npp1/4p1k1/2ppP1N1/1b1P4/2N4Q/PPP2PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/pppp1ppp/4p3/8/4P2q/5N2/PPPPKPPP/RNBQ1B1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k1nr/ppp2ppp/3b4/3p4/3P3q/3B4/PPP1NPPP/RNBQ1RK1 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqk1nr/ppp2pQp/4p3/8/4p3/P1N5/1Pn1KPPP/R1B2B1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1q1kr/ppNnb1pp/5n2/8/3P4/8/PPP2PPP/R1BQKB1R b KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r4rk1/ppqb2pp/2n1p3/3p4/2pP2n1/P1P4P/1P1N1PPN/R1BQRBK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r4rk1/ppqb2pp/2n1p3/3p4/2pP2n1/P1P2N1P/1P1N1PPb/R1BQRB1K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkb1r/pp2pp1p/2p2np1/8/3PN3/8/PPP1QPPP/R1B1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkb1r/pp1bpppp/2p2n2/8/3PN3/8/PPP1QPPP/R1B1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkbnr/pp1np3/2p1p1pp/7Q/3P4/8/PPP2PPP/R1B1KBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2b1r/ppk2ppp/2p5/4q1B1/4n3/8/PPP2PPP/2KR1BNR w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqr3/pp1nbk1p/2p2ppB/8/3P4/5Q2/PPP1NPPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1kq1bnr/p2np1pp/2p5/2p5/2B1PB2/2P5/PPP2PPP/4K1NR w K - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq2nr/pppnp1bp/3p1kp1/6N1/3PP3/8/PPP2PPP/RNBQK2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1bnr/pppnp2p/3p2p1/8/3PP2k/5Q2/PPP2PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1bnr/pppnp2p/3p2p1/6N1/3kP3/5Q2/PPP2PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq1bnr/pppnp2p/3p2p1/6N1/4Pk2/2Q5/PPPP1PPP/RNB1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bq2nr/2pnp1bp/p2p1kp1/1p4N1/3PPP2/2N5/PPP3PP/R1BQK2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2k1nr/pp1bppbp/6p1/1B1q2B1/3P4/2Q5/1PP2PPP/2KR2NR w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1q1bnr/p1ppp1pp/bp3k2/7Q/4P3/8/PPPP1PPP/RNB1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1q1bnr/p1ppp1pp/bp1k4/5Q2/4P3/8/PPPP1PPP/RNB1K1NR w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkb1r/p1pppppp/1p3n2/6N1/2B5/5b2/PPPP1PPP/RNB1K2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkbnr/p1ppp2p/1p4P1/8/2BP4/2N5/PPP2P1P/R1BQK1Nb w Qkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkbnr/p1ppp3/1p4Pp/7Q/3P4/3B4/PPP2PbP/RNB1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1qkb1r/p1ppp2P/1p6/7n/3P4/3B4/PPP2PbP/RNB1K1NR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/pppp1ppp/4p3/8/5PP1/8/PPPPP2P/RNBQKBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1kbnr/ppqppppp/8/2p2P2/7P/8/PPPPP1P1/RNBQKBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppp2ppp/3b4/3N4/4n3/1P2Pn2/PBPP2P1/R2Q1R1K b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b2rk1/ppp2p1p/3p2p1/8/3bP2q/1PN2P2/PBPPB1K1/R2Q1R2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppq2pp1/2p2B2/3p3p/6P1/1P1PPB2/P1PN2P1/R2Q1RbK b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppp4p/3b1Kp1/3N2n1/8/1P2Pn2/PBPP2P1/R2Q1R2 b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk1nr/ppp2p1p/3b4/6p1/8/5N1P/PPPPP1P1/RNBQKB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k1nr/ppp2ppp/8/8/7q/2N3P1/PPPPP3/R1BQKBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk1n1/ppp2pp1/3b4/8/7P/8/PPPPP2P/RNBQKB1R b KQq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk2r/ppp2ppp/8/8/3P4/1P4b1/P1PKP1PN/RNBQ1B1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqk2r/ppp2pBp/8/8/6n1/1P3Nb1/P1PPP1P1/RN1Q1BKR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k1nr/ppp2p1p/3P4/8/3q4/6P1/PPPPKp1P/RNBQ1B1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbnr/ppppp3/7p/6p1/3P4/4P1p1/PPP2PPP/RN1QKBNR w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbqkbn1/ppppp3/8/6pr/3P1p2/3BP1B1/PPP2PPP/RN2K1NR w KQq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb2r1k/p5pp/2pq1p2/1p3p1Q/1bBP1N2/2N1P3/PP3PPP/R3K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bk2n1/pp1np1b1/1qp5/3p1pNQ/3P4/2N1P3/PPP2PP1/R3KB2 w Q - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kb1r/pp1n3p/2pp4/5pB1/3P4/4P3/PqPN1P1P/R2QK2R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2kb1r/ppp1p2p/4B1p1/3Q4/3Pp3/4P3/PP1NKP1P/q7 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kbnr/3npppp/ppN5/B2N4/2p5/8/PP2PPPP/R3KB1R w KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn3b1r/pp2kPpp/4p3/q1p1N3/8/2p5/PP3PPP/R1BQK2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3rkb1r/pp2nppp/2n1p3/1B1NNb2/3P4/8/PP1q1PPP/R1B2RK1 w k - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1q1b1r/pp2k1pp/3np1p1/1B3Q2/P2p4/2N5/1P3PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn1q1b1r/pp2kpp1/3n2p1/1B1p1Q2/P2p4/8/1P3PPP/R1B1K2R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b2r2/pp1n1pp1/4p1k1/q2N2P1/1p1P4/4PN2/P4PP1/R3KB1R w KQ - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1kbnr/ppp1qppp/8/4n3/2PN4/6P1/PP1NPP1P/R1BQKB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/ppp2ppp/2n2B2/3q4/1b1P4/8/PP2KPPP/R2Q1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k2r/ppp2ppp/2n5/4Pn2/Q1Pq4/2B4K/PP4PP/RN3BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k2r/ppp2ppp/2n5/4Pn2/Q1P3K1/2B1q3/PP4PP/RN3BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k1nr/ppp3pp/2n1P3/4p3/1PPp4/4qN2/1PK3PP/RNBQ1B1R b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k1nr/ppp2ppp/2n5/4P3/2P2q2/B7/PP4PP/RN1Q1BKR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnbBk2r/pppp1ppp/8/2bPp3/2P1n3/8/PP2PPPP/RN1QKBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1bqkb1r/ppP2ppp/8/8/1nP2Qn1/8/PP2PPPP/RNB1KBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rnb1k2r/pppp1ppp/8/4P3/1bP4P/P7/1P1nPP1P/R1BQKBNR b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k2r/ppppqppp/2n5/4n3/1PP2B2/5N2/1P1NPPPP/R2QKB1R b KQkq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rn2k2r/ppp2ppp/3b4/5K2/2P5/2N3qP/PP2P1P1/R1BQ1BNR b kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3r1k1/1pp2ppp/2Np4/p1b3q1/2P5/1PN1PP2/PB1QbP1P/R4R1K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1q5/prp2ppp/2B1bn2/1NQ5/8/8/PPP2PPP/6K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/1pp3bp/3n2q1/8/8/1P6/rBP3PP/1R3QK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kqQ5/p5pp/1Pp5/2Pp4/4n3/1N6/P4rPP/3R2K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/3bb2p/1p4nB/p6B/3P4/6P1/Pr4rP/2K1RR2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2R1bkr1/4n1pQ/p2Bn3/1p2P3/1P6/6q1/6P1/6K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "R2bk3/3n1r2/2BP2R1/2p2q1Q/4p1n1/1p2B1P1/1P3P2/6K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r5k1/5ppb/7p/7P/2Q3P1/b1p2P2/R7/K7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r7/4bpk1/3p2p1/1PpP4/2B2NP1/5P2/R7/KR5r b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2kr4/pbp1R3/1p1p2Q1/8/2P5/1P1P3r/P5RN/2qn2BK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3q3/1k3p2/1p6/p6p/Pb1P1R2/1Pp5/4QP1P/2R1KNr1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3q2k1/2bn1ppp/1p6/1Pp2P2/2PpP2P/3P1QB1/r5NK/6R1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4r1k1/2p2ppq/1p6/1b1NB1Qp/rN1K3P/2RP2P1/1b3PB1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2B1R1B1/2Bqqn2/2Rqk1Kn/3qqn2/2B1R1B1/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "B5B1/Q7/2n1n3/Rn1k1n1R/8/1nnKnn2/B7/7B w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1B2R2B/8/3rrr2/R2rkr1R/3rrr2/2K5/7B/4R1B1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3Q4/1N3N2/2bbb3/K1bkb2Q/2bbb3/1B3B2/8/3Q4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "B5B1/1B3B2/2nnn3/R1nkn2K/2nnn3/1B3B2/B5B1/3R4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2Q3Q1/3qqq2/2QqkqQ1/3qqq2/2Q1Q1Q1/7q/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3bkq2/2pr3p/1p1p4/3P1p2/2P1N2P/1P3BP1/P4P2/4R1K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k4r2/2P3b1/1p6/p2R1b2/2n3p1/P1q3Pp/1r3PBP/4R1K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2rkr3/1p4p1/p1n3N1/5p1p/P1p5/1P6/2PB1PPP/2KR4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5rkr/6p1/p4p2/1pnN4/2B2P2/6Pp/PPP4P/2KR4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b3r1/pk6/n1pbNp2/1P3P1p/P5p1/5B2/6PP/1R4K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/8/p7/2bB1p2/2P3n1/6q1/1R5p/Q1R2K2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k5/pp2bp1p/6p1/6P1/2q1n1K1/P3BQN1/1P3P2/2R5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3b2k1/4n1p1/4n3/pppp3P/6QK/1P2P2R/P1P2P2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4r1k1/1R1q1p2/P2b2p1/2B4p/2QKPPn1/5NP1/7P/1R6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4r1k1/5bpp/2p1np2/pp6/3P4/PKN1PN2/1B3PPP/3R4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/ppp2k2/5N2/3bK1nr/5R2/PPP3R1/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5rk1/2p3pp/3p1p2/4P1B1/1p1PQKR1/r6P/2P5/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3rr2k/pppqn2p/5Pb1/3P4/2P3p1/1P5P/PB4P1/4RRK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6rk/4q1p1/3p4/2pPp1p1/2P1P3/2N4N/1pK5/r6R w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r1q2/8/p2P1n2/k3P2Q/1p6/1Pp5/K2n1B1P/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k4B1R/pp6/q5r1/5pp1/P1Nb4/1P1P1P2/2PK2P1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k4B1R/1p3p2/p5p1/5n2/2q2P2/3N4/PPP3r1/2K2R2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/kp6/8/1rpN1pp1/P6p/6B1/3nqPPP/R5K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k1r3/ppp5/2n5/3Nppp1/2P4r/1PQ1R3/P5Pn/7K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k2r1/pb2b3/1p6/2pp1p1p/PPR3n1/7P/4N3/3Q2BK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2kr4/ppp2ppp/5n2/2Pb4/1Pr5/P4N2/KB2RPPP/4R3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2kr4/ppp5/2n1p3/3pB2r/Q4P1b/2N5/PPP3PK/5R2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k6/p1p1b3/QpP3p1/3qp3/P7/1P3r2/R1R2P1p/5N1K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k6/p1p1b2p/QpP5/4p3/P3q3/5r2/1PR1Pp1N/2R4K b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r1rk1/1bb2p2/p2qpn1p/1ppp2p1/3NP1P1/P1NP3P/1PPBQPB1/3R1RK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r1rk1/2N2pbp/1p1p1np1/p1nP4/2P5/1PN1PpPq/PBQ2P1P/3R1RK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r1r1k/1b3ppp/p3p3/1pp1P3/3p3N/P2P1qP1/1PQB1P1P/3R1RK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r1r1k/1bp2pb1/1p1p2pp/p1nPp3/2P1P1nq/1PNB4/PBQ1NPPP/3R1RK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r3r/4bpk1/p3p3/1pppP1p1/8/P1NP1bP1/1PQB1P2/3R1RK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r1r1k/2p2ppB/1p1p3p/pNnPb3/2P3nP/1PN1Pb1P/PBQ2P2/4RRK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2krr3/pppqbppp/4bn2/4n1B1/2Pp4/1Q4P1/PP1NPPBP/2KRR3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1kr1r3/p1p1bppp/BpQp1n2/3Pp3/4P3/2N2P1q/PPP2P1P/2KRR3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2krr3/p2nqppp/2p1pn2/5b2/1b1P1B2/2N2N2/PPP1BPPP/2KRR3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1kr2r2/p1p3bp/p1Bq1pn1/2NPpbp1/5n2/5N1P/PPPB1PP1/2KRR3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1kr2r2/2pbq1bp/pp2pnp1/8/1n3BP1/2NP3P/PPP1NQB1/2KRR3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k2r1r/pppb1pbp/2N1pnp1/3N4/2B1P3/2B2PqP/PPP3P1/2KRR3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/pbpn4/1pN1pnp1/7p/7q/2NB4/PPPB1PPP/3RR1K1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3kb1r/1p3pp1/4p2p/1p1n3q/6bB/3B4/PPP1NPPP/3RR1K1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r3k2r/pbppB2p/1p2n1pb/nB1NNp2/8/8/PPP2PPP/3RR1K1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "r1b1k2r/ppp3pp/2n1p3/1Bb1NpBq/6n1/2N5/PPP2PPP/3R1RK1 w kq - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3rkr2/p2b2pp/1p2pn2/nB6/3P1q2/1QN2N2/PP3PPP/R5K1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2r1k2r/1pp1npp1/p1n1b1qp/1B1p4/3P3Q/BP3N2/P1P2PPP/3RR1K1 w k - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "K1k5/1b2p3/4Pp2/Bpq1n1p1/2p5/R1P1R1P1/1P3PBP/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6r1/5p1k/p3pP1B/1p2N3/1P4P1/P4P1R/2r5/K2q4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6kr/5Rp1/8/p1p1b1Np/PpB5/1P2q3/5nPP/6RK w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5np1/p1p2p2/NnPp1Prp/1Q1B3k/P7/4r2K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r4/4r2p/6pQ/1pn2p2/1k1q3R/pP3PP1/P2pp1B1/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3q4/3Pp1np/1p5k/p1b1N2p/P1P5/1P6/3P2PP/R1B2BKR w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1N3b2/2p3p1/1pPk2P1/1B1R1p2/PK3Qq1/7r/3B1R2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2q5/1Npkn3/2P5/6p1/1p5p/r2R3K/2Q2PNP/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1r2b3/3k2p1/PN5p/RKB1p3/5r2/1Q1R3P/2P3P1/5q2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2p2p2/1rk2K1n/3B1nB1/p6P/P1R5/1q1P4/2R2Q2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "bK2kq2/P2P4/1p6/1R2R1p1/2N2bPp/7P/4Q3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7b/2r3k1/2pQn2P/1pP1Kp2/pP2b3/N3B1R1/5P1q/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4n3/ppR4B/2p1k3/8/5Q2/2Pr3q/1P3P2/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4n3/ppR3B1/2p1k3/8/5Q2/2Pr3q/1P3P2/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r2rk/8/1pp2Kp1/n3Qp2/3Pb3/2N5/1PP1B3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1r1r2bk/8/1pp2Kp1/n3Qp2/3Pp3/2N5/1PP1B3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6r1/ppq4p/2b1R1p1/3k4/7Q/2K2PP1/PP3N2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6r1/ppq4p/2b1r1p1/3k4/7Q/2K2PP1/PP3N2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k5r/ppp5/6Q1/8/5p2/4p1n1/PPP3R1/5NK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k5r/ppp5/6Q1/8/5p2/4p1n1/PPP3B1/5NK1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k1K/ppp1r3/2n2N2/7N/2qb1Pp1/6P1/PPP3Q1/5R2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k1K/ppp1r3/2n2N2/2q4N/3b1Pp1/6P1/PPP3Q1/5R2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6b1/rpp3k1/5pNp/1P4pP/1P1K2Q1/q4B2/4P3/3R1n2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6b1/rpp3k1/5pNp/1P4pP/1P1K2Q1/5B2/q3P3/3R1n2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/B7/6n1/3b2p1/1p3bPp/1PpN3P/2P1B3/R6r w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K5/8/N5n1/3b2p1/1p3bPp/1PpN3P/2P1B3/R6r w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b7/7p/2p1P1r1/2P5/pK3RpP/P2pQ1B1/2q5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b4K2/7p/2p1P1r1/2P5/p4RpP/P2pQ1B1/2q5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5r2/2p5/1q1b3p/p2k2p1/4Rp2/2Q2P1P/P3PN2/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5r2/2p5/1q1n3p/p2k2p1/4Rp2/2Q2P1P/P3PN2/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5r1k/3n1p1p/2p3p1/6P1/1p1N3P/qPb1P3/2R1Q3/1K3R2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5r1k/3n1p1p/2p3p1/6P1/1p1N3P/qPb1P3/2N1Q3/1K3R2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "R7/p1kp2pr/Ppp4q/8/3K2Np/Q2R3P/2P5/3n4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "R7/p1kp2pr/Ppp5/7q/3K2Np/Q2R3P/2P5/3n4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/1p4p1/p2pQ3/P1bP3N/2nN1p1K/2P2P2/1P4q1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/1p4p1/p2pQ3/P1bP3R/2nN1p1K/2P2P2/1P4q1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7b/1qNp3k/2pP2R1/1pP3K1/pP6/P7/2B1n3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7b/1qNp3k/2pP2R1/1pP3K1/pP6/P7/B3n3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rk6/1B3ppp/1Qp1n1r1/p2b4/Pp5q/1P1P4/2P2PPP/3R1RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "rk6/1N3ppp/1Qp1n1r1/p2b4/Pp5q/1P1P4/2P2PPP/3R1RK1 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6r1/1qQ5/k6P/p2R1N2/1p4r1/1Pp5/2Pb3B/7K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6r1/1qQ4K/k6P/p2R1N2/1p4r1/1Pp5/2Pb3B/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5K1p/7k/7p/5PP1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/p7/kpP5/8/K7/1P6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6p1/6Pk/7P/7K/4p1P1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1p1p4/2kP4/2P5/p1K5/1P6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3ppp2/4k3/2p1P1p1/3PK3/5P2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3ppp2/4k3/2p1P3/4K3/3P1P2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7p/6PP/5k1K/7P/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1pp5/P7/KP6/8/1k6/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/P7/8/8/7P/5k1K/6pP/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5p2/3pp2P/1p1P4/3K1k2/2PP4/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6P1/8/5p2/2pP4/4K1k1/4Pp2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4pkp1/2p2P2/2PpKP2/3P1P2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/p7/kbP5/8/2K5/3B4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7p/3B2bk/5p2/7K/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4p3/2Pk4/1K1b1P2/8/2p1B3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2K5/4pp2/3bk3/8/3PP3/2B5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3p4/1PpkbP2/8/3K4/8/3B4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5P2/2pBk1K1/2Pb4/8/8/6p1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2b5/1p6/2k5/K7/PB6/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7p/5kPB/5b1K/7P/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7P/8/8/5k2/1b6/3pKB2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5b2/3k4/4p3/4K3/4BP2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4bpk1/6p1/8/5BKp/5P1P/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1p1pk3/2p5/4P3/pPK5/P1BPb3/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7n/3N3k/7P/6K1/2p5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/pn6/k7/3N4/K7/1P6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3K4/8/2pkp3/2n3N1/2P5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4pp2/3nk3/6K1/2P1NP2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2ppn3/3k4/N2P4/4K3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4nPK1/3pk3/4p3/8/4N3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1p6/2k5/8/KPn5/1N6/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4n3/3k4/3p4/3K4/2NP4/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5kp1/8/4PKPp/5N2/8/4n3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2p5/4p3/8/2PKp3/2NnPk2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4p3/5k2/1pN5/1n1KPp2/2P2P2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3p1p2/4k3/2P1p1P1/4K3/3NPP2/8/3n4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/3nn3/4N3/8/4N3/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4N3/3nn3/4k3/8/4K3/5N2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4np2/5kn1/8/3N1P2/6N1/3K4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2pnn3/3k4/3P4/1K3N2/4N3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/3pP3/4k3/2KNnn2/8/5N2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2n1n3/3k4/2N5/1N1K4/4P3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3b4/3bk3/6B1/4K3/8/4B3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/B7/8/bb6/1k1K4/8/2B5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4p3/2bkB3/2b5/5K2/6B1/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3bb3/4k1B1/4B3/3K4/5P2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4b3/4Bkb1/8/3P3K/2B5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3bb2B/4k3/4B3/5PK1/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6np/7k/7P/6K1/B7/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/p7/knK5/8/1P6/8/3B4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4pn2/4k3/4P3/3K4/8/4B3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3p4/2pk1K1B/2n5/2P5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4B3/2nP4/1pk5/2p1K3/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3pn3/1P1kp3/8/3KP3/5B2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1K6/8/kp6/b7/8/NP6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7p/5Pbk/8/7K/4N3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3bp3/4k3/4P3/4K3/5N2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4p3/2K1kp1N/4b3/8/5P2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/4Npp1/3K1k2/6b1/4P3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2p1p3/3kb3/4N3/3K4/2P5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/2n1nK2/8/8/8/B6B/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/6n1/5B1k/7n/4B2K/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4n3/3knB2/1Bp5/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5n1B/2KBkn2/8/8/5P2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1B1nB3/3Pk3/4n3/4K3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3n4/3Bkp2/5n2/2P5/1B6/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3k4/2n5/2BK4/2B3n1/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2K1k3/1BBn4/8/1n6/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7p/6k1/5n2/3n1BK1/7B/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3p4/8/5B2/2k1K3/3nB3/8/4n3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5n2/2k1np2/8/4K3/3BBP2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/k1K5/1nBP4/8/5n2/4B3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6N1/8/2K1k3/4bn2/8/3B4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3b4/3nkBK1/1N6/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2N5/5n2/4kbB1/8/4K3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/K1b5/2k3B1/3n4/4N3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5b2/3Bpkn1/8/5NK1/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2p1n3/3k4/2b2B2/1N2PK2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/pn6/k7/p1R5/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3ppn2/4k3/6R1/4K3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6p1/6nk/4R3/6P1/2K5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/R7/2nkP3/2p2K2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4np2/4k3/4P3/4K3/8/3R4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5R2/8/3pp3/4k3/2K1n3/8/5P2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4k3/8/1r6/8/8/5PPB/6K1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4k3/8/8/8/6p1/3BP2r/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1p3k2/8/B7/K7/P7/8/1r6 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5p2/4k3/8/3BKP2/1r6/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2pk4/3p4/3K4/1r1PB3/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2PP1p2/3K4/2B1r3/4k3/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1p6/kr6/7R/1P6/2K5/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5K1p/7k/7r/4RP2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/1pr5/2k5/4P3/1K6/8/3R4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5R2/3pr3/4k3/4P3/4K3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6r1/8/7R/3Pk3/2K1Pp2/8/6p1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3K4/8/2pkr2R/3p4/3PP3/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/2P2k2/2RKp3/5r2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4p3/3k4/8/2RKP3/7r/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3R4/3PK1k1/3P4/8/8/5r2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2pr1P2/2p3k1/4K3/3P1R2/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r4/8/2k5/5Pp1/2pPK3/5R2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4kp2/4p3/4K1Pr/3RPP2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kqQ5/p7/1P6/8/8/8/8/4K3 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3q2p1/4k1P1/6Q1/5K2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/Q2q4/3kp3/8/1P6/4K3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4p1q1/5k2/3Q4/4P3/8/5K2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/7Q/8/4pq2/4k3/4P3/3K4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5Q2/8/8/3pq3/3k4/8/2P2K2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2q5/4k3/2Q5/3K4/2PP4/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1k6/q3Qp2/2PK4/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "q7/6k1/4QpP1/5K2/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7q/3Q4/k1KPp3/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6p1/4q2k/8/5K2/5QP1/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1q6/8/4k3/7p/3PKQp1/4P3/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3k4/8/3r3r/4KR2/5R2/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2k5/4RR2/4K3/r7/1r6/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5k2/7r/4RKR1/7r/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3k4/1R6/2K1Rr2/r7/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "6k1/5p2/8/r7/3RK3/3PR3/5r2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/6k1/2p1R3/4K3/4PR2/8/3r4/4r3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5Bp1/6Q1/2k1KP2/8/5q2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5Bp1/6Q1/2k1Kp2/8/5q2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4B1pk/r7/6RK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4B1pk/8/r5RK b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/3q2k1/8/5R1K/7R/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/6k1/3q4/5R1K/7R/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1Q5p/6q1/k3Kb2/P7/1P6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1Q5p/6q1/k3Kb2/p7/1P6/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2N5/1p6/k1B1q3/8/K7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2N5/1P6/k1B1q3/8/K7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/pp5K/2r5/7k/8/5PP1/4R3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/pp5K/2r5/7k/8/5PP1/4B3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4b3/4k3/2Qp4/3K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/4n3/4k3/2Qp4/3K4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4Q3/2q5/4K3/3B2k1/8/3b4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4Q3/2q5/4K3/4B1k1/8/3b4 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1Q6/4k3/8/4K3/3R4/8/5q2/5r2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1Q6/4k3/8/4K3/4R3/8/5q2/5r2 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1QBk4/4q3/5b2/5K2/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1QNk4/4q3/5b2/5K2/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3Q4/3q1b2/4k3/6P1/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3Q4/4qb2/4k3/6P1/2K5/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/2N2b1K/8/8/4Q3/8/8/5q2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/2N2n1K/8/8/4Q3/8/8/5q2 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1Q5b/7q/8/8/4k3/1R4P1/2K5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1Q5b/7q/8/8/4k3/1N4P1/2K5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3R4/1b6/8/3B4/6k1/r7/6K1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3R4/1r6/8/3B4/6k1/r7/6K1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4q3/b3k3/8/3K4/4B3/5Q2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4q3/b2k4/8/3K4/4B3/5Q2/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/1rr5/k7/1R6/K2B4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/r1r5/k7/1R6/K2B4/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/b7/1Q6/7q/8/8/3K3B/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/r7/1Q6/7q/8/8/3K3B/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5N2/8/3k4/6Q1/3K4/5q2/3n4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5N2/8/3k4/8/3K2Q1/5q2/3n4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/8/5K2/4r1R1/3n4/7N/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "5k2/8/5KR1/4r3/3n4/7N/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4k3/8/3RK2R/5r1n/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/4k3/8/3RK2R/5r2/6n1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r4/8/8/8/4KR1Q/1q6/6k1/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3r4/8/8/8/4KR1Q/1q6/3k4/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "b7/8/8/8/8/R7/Kp6/2k5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "b7/8/8/8/8/B7/Kp6/2k5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/b7/5B2/6Q1/2k5/7q/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/b7/5BQ1/8/2k5/7q/4K3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/k7/1r6/K7/P7/n2R4/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/k7/1r6/K7/R7/n2R4/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/5R2/6Q1/7K/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "3k4/2R5/1K6/R7/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/k7/1R6/2R5/3B4/4K3/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7B/6P1/5k2/4R3/3K4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/1q6/2Q5/3B4/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/7k/6R1/8/4R3/3Q4/2K5 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/6R1/5K2/4N3/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/1R6/2K5/3R4/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/1b6/2N5/3N4/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/6p1/5N2/4K3/3R4/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1Q6/2R5/3k4/4R3/5K2/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/5N2/4R3/3k4/2R5/1K6/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1k6/1P6/1K6/8/1B6/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/4P3/4k3/4B3/4K3/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/P7/K7/8/N7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/p7/Q7/K7/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7Q/7r/7k/8/7K/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/Q7/p7/k7/8/K7 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7Q/7r/7k/7p/8/7K/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3P4/3k4/3B4/3B4/3K4/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/5P2/5k2/8/5N2/5N2/5K2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2k5/2p5/2P5/2Q5/2K5/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7k/7P/8/8/7B/8/7R/7K w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k7/P7/Q7/N7/K7/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "7q/8/8/8/7P/7K/7b/7k b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "b7/8/8/B7/K7/b7/k7/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/2q5/2b5/2P5/2K5/8/2k5 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3r4/3q4/3Q4/3K4/8/3k4/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/b7/8/n7/P7/K7/8/k7 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4k3/8/4n3/8/4b3/4K3/4p3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/4QK1k/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "k1K4Q/8/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/8/kNQK4 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "4QKNk/8/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/kBK3B1/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "2QNk1K1/8/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/KRQ3rk/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/kr1NQK2/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/KPkBR3/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1KQPk1N1/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/K1kPNN2/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/3QPkBK/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/KRbqk3/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/8/2k1KBqn b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/8/kbKBq3 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/nPKpk3/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/2kpKnq1/8/8/8/8/8/8 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/8/kbKB2b1 b - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/3KPkBQ/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/K1kPQN2/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/2QPkNK1/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "1KNkNR2/8/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/NqkPK3/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/3KPkBR/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/Q1K1kp1N/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "kbN3BK/8/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "B1Nbk1K1/8/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/8/1KPkNQ2/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/1NPkNK2/8/8/8/8/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "8/8/8/8/8/3QKNkr/8/8 w - - 0 1",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Vladimir Fedoseev vs Tomi Nyback, Tallinn, 1/8/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Nana Dzagnidze vs Gulnar Mammadova, Gaziantep, 3/2/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Mukhit Ismailov vs Pavel Potapov, Tashkent, 3/14/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Aleksej Aleksandrov vs Misraddin Iskandarov, Nakhchivan, 5/3/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Aleksa Strikovic vs Jasem Alhuwar, Paris, 7/7/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "David Howell vs Aljoscha Feuerstack, Germany, 10/20/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Alexander Motylev vs David Baramidze, Germany, 10/21/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Teodora Rogozenco vs Marina Gabriel, Germany, 12/2/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Hendrik Kues vs Twan Burg, Germany, 12/9/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Pavel Tregubov vs Krishnan Sasikiran, Moscow, 2/12/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Danny Raznikov vs Zdenko Kozul, Skopje, 3/13/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Martin Zumsande vs Rainer Polzin, Germany, 4/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Michal Olszewski vs Mladen Palac, Bratto, 4/30/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Gudmundur Kjartansson vs Sergey Fedorchuk, Legnica, 5/5/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Jan Musialkiewicz vs Elina Danielian, Legnica, 5/6/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Miodrag Perunovic vs Alexey Kislinsky, Legnica, 5/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Antonios Xylogiannopoulos vs Alexandru Manea, Legnica 5/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Vlad-Cristian Jianu vs Burak Firat, Legnica, 5/13/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Hichem Hamdouchi vs Samy Shoker, Haguenau, 6/5/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Sasa Martinovic vs Vitezslav Rasik, Meissen, 6/5/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Alexander Areshchenko vs Sergei Zhigalko, Kiev, 6/6/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Aleksei Pridorozhni vs Yuriy Kuzubov, Voronezh, 6/15/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Tigran Kotanjian vs Tigran L. Petrosian, Jermuk 6/18/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Maria Kursova vs Tijana Blagojevic, Belgrade, 7/23/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Olena Martynkova vs Deimante Daulyte, Belgrade, 7/24/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Ekaterini Pavlidou vs Bojana Bejatovic, Belgrade, 7/24/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Cristina Adela Foisor vs Maja Velickovski-Kostic, Belgrade, 7/26/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Ana Srebrnic vs Laura Rogule, Belgrade, 8/2/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Igor Bondarevsky vs Mikhail Botvinnik, Moscow/Leningrad, 1941",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Prasad Arun vs Zhamsaran Tsydypov, Moscow, 1/29/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Svetlana Cherednichenko vs Yuri Shulman, Reykjavik, 3/7/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Christopher Lutz vs Sergio Harnandan, Utrecht, 6/10/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Vladimir Fedoseev vs Alexander Zubov, Voronezh, 6/16/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Javier Moreno Carnero vs Julian Andres Munoz, Bogota, 10/??/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Mariusz Szewczyk vs Regina Buechle, Germany, 10/6/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Liubka Genova vs Bergit Brendel, Germany, 10/7/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "S P Sethuraman vs Mhamal Anurag, Kolkata, 10/7/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Tamir Nabaty vs Pinto Paolo Ladron De Guevara, Navalmoral de la Mata, 12/7/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Viktor Polischtschuk vs Gerlef Meins, Germany 12/8/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Evgeny Sveshnikov vs Daniel Fridman, Tallinn, 1/13/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Vladimir Burmakin vs Julio Granda Zuniga, La Roda, 3/31/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Parimarjan Negi vs Arnd Lauber, Germany, 3/17/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Peter Svidler vs Viswanathan Anand, Stavanger 5/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Martin Petr vs Maxim Rodshtein, Legnica, 5/10/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Jan Rindlisbacher vs Jorgen Henseler, Legnica, 5/10/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Yuri Shulman vs Benjamin Finegold, Saint Louis, 5/10/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Alexey Kislinsky vs Joseph Gallagher, Legnica, 5/13/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Burak Firat vs Bart Michiels, Legnica, 5/14/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Bogdan Posedaru vs Anna Iwanow, Legnica, 5/15/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Tanguy Ringoir vs Vladimir Dobrov, Maastricht, 5/18/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Alexey Kislinsky vs Vojtech Plat, Ledec nad Sazavou, 5/25/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Pavel Ponkratov vs Alekasndr Rakhmanov, Khanty Mansyisk, 6/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Sahaj Grower vs Dragisa Blagojevic, Golden Sands, 6/15/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Andrey Vovk vs Roeland Pruijssers, Stroebeck, 6/22/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Elena Cherednichenko vs Natasa Korbovljanovic, Belgrade, 7/24/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Mila Paramentic vs Martina Folkova, Belgrade, 7/24/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Anna Muzychuk vs Lilit Galojan, Belgrade, 7/26/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Miranda Mikadze vs Tatiana Kosintseva, Belgrade, 7/31/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Irina Zakurdjaeva vs Madona Bokuchava, Belgrade, 7/31/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Thomas Casper vs Reinhard Postler, Frankfurt/Oder, 1977",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Robin Dragomirescu vs Mircea Parligras, Sarata Monteoru, 2/15/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Ilyas Sodikov vs Evandro Amorim Barbosa, Athens, 8/15/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Sinisa Drazic vs Samuel Franklin, Livigno, 9/10/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Imre Balog vs Robert Markus, Hungary, 10/7/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Evgeniy Najer vs Yiping Lou, Beijing, 10/9/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Borislav Ivanov vs Bojan Kurajica, Zadar, 12/17/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Vlad-Cristian Jianu vs Atanas Kolev, Plovdiv 2/ 4/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Bartosz Socko vs Mads Andersen, Reykjavik, 3/ 2/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Sebastian Siebrecht vs Gawain Jones, Germany, 4/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Ivan Sokolov vs Alexandre Danin, Koege, 4/23/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Azer Mirzoev vs Constantin Lupulescu, Legnica, 5/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Dmitry Svetushkin vs Kamil Dragun, Legnica, 5/14/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Yuriy Kuzubov vs Vladimir Onischuk, Voronezh, 6/20/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Ketevan Arakhamia-Grant vs Ioulia Makka, Belgrade, 7/24/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Zoja Schleining vs Nino Khurtsidze, Belgrade, 7/26/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Dimante Daulyte vs Antoaneta Stefanova, Belgrade, 7/27/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Tereza Olsarova vs Sopio Gvetadze, Belgrade, 7/27/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Vladimir Fedoseev vs Tomi Nyback, Tallinn, 1/8/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Nana Dzagnidze vs Gulnar Mammadova, Gaziantep, 3/2/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Mukhit Ismailov vs Pavel Potapov, Tashkent, 3/14/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Aleksej Aleksandrov vs Misraddin Iskandarov, Nakhchivan, 5/3/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Aleksa Strikovic vs Jasem Alhuwar, Paris, 7/7/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "David Howell vs Aljoscha Feuerstack, Germany, 10/20/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Alexander Motylev vs David Baramidze, Germany, 10/21/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Teodora Rogozenco vs Marina Gabriel, Germany, 12/2/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Hendrik Kues vs Twan Burg, Germany, 12/9/2012",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Pavel Tregubov vs Krishnan Sasikiran, Moscow, 2/12/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Danny Raznikov vs Zdenko Kozul, Skopje, 3/13/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Martin Zumsande vs Rainer Polzin, Germany, 4/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Michal Olszewski vs Mladen Palac, Bratto, 4/30/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Gudmundur Kjartansson vs Sergey Fedorchuk, Legnica, 5/5/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Jan Musialkiewicz vs Elina Danielian, Legnica, 5/6/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Miodrag Perunovic vs Alexey Kislinsky, Legnica, 5/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Antonios Xylogiannopoulos vs Alexandru Manea, Legnica 5/7/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Vlad-Cristian Jianu vs Burak Firat, Legnica, 5/13/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Hichem Hamdouchi vs Samy Shoker, Haguenau, 6/5/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Sasa Martinovic vs Vitezslav Rasik, Meissen, 6/5/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Alexander Areshchenko vs Sergei Zhigalko, Kiev, 6/6/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Aleksei Pridorozhni vs Yuriy Kuzubov, Voronezh, 6/15/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Tigran Kotanjian vs Tigran L. Petrosian, Jermuk 6/18/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Maria Kursova vs Tijana Blagojevic, Belgrade, 7/23/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Olena Martynkova vs Deimante Daulyte, Belgrade, 7/24/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Ekaterini Pavlidou vs Bojana Bejatovic, Belgrade, 7/24/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Cristina Adela Foisor vs Maja Velickovski-Kostic, Belgrade, 7/26/2013",
            "solution": "Нет решения в файле"
        },
        {
            "fen": "Ana Srebrnic vs Laura Rogule, Belgrade, 8/2/2013",
            "solution": "Нет решения в файле"
        },
    ],
    "Мат в 2 хода": [
        {
            "fen": "r2qkb1r/pp2nppp/3p4/2pNN1B1/2BnP3/3P4/PPP2PPP/R2bK2R w KQkq - 1 0",
            "solution": "1. Nf6+ gxf6 2. Bxf7#"
        },
        {
            "fen": "1rb4r/pkPp3p/1b1P3n/1Q6/N3Pp2/8/P1P3PP/7K w - - 1 0",
            "solution": "1. Qd5+ Ka6 2. cxb8=N#"
        },
        {
            "fen": "4kb1r/p2n1ppp/4q3/4p1B1/4P3/1Q6/PPP2PPP/2KR4 w k - 1 0",
            "solution": "1. Qb8+ Nxb8 2. Rd8#"
        },
        {
            "fen": "r1b2k1r/ppp1bppp/8/1B1Q4/5q2/2P5/PPP2PPP/R3R1K1 w - - 1 0",
            "solution": "1. Qd8+ Bxd8 2. Re8#"
        },
        {
            "fen": "5rkr/pp2Rp2/1b1p1Pb1/3P2Q1/2n3P1/2p5/P4P2/4R1K1 w - - 1 0",
            "solution": "1. Qxg6+ fxg6 2. Rg7#"
        },
        {
            "fen": "1r1kr3/Nbppn1pp/1b6/8/6Q1/3B1P2/Pq3P1P/3RR1K1 w - - 1 0",
            "solution": "1. Qxd7+ Kxd7 2. Bb5#"
        },
        {
            "fen": "5rk1/1p1q2bp/p2pN1p1/2pP2Bn/2P3P1/1P6/P4QKP/5R2 w - - 1 0",
            "solution": "1. Qxf8+ Bxf8 2. Rxf8#"
        },
        {
            "fen": "r1nk3r/2b2ppp/p3b3/3NN3/Q2P3q/B2B4/P4PPP/4R1K1 w - - 1 0",
            "solution": "1. Qd7+ Bxd7 2. Nxf7#"
        },
        {
            "fen": "r4br1/3b1kpp/1q1P4/1pp1RP1N/p7/6Q1/PPB3PP/2KR4 w - - 1 0",
            "solution": "1. Qg6+ hxg6 2. fxg6#"
        },
        {
            "fen": "r1b2k1r/ppppq3/5N1p/4P2Q/4PP2/1B6/PP5P/n2K2R1 w - - 1 0",
            "solution": "1. Qxh6+ Rxh6 2. Rg8#"
        },
        {
            "fen": "r2q1b1r/1pN1n1pp/p1n3k1/4Pb2/2BP4/8/PPP3PP/R1BQ1RK1 w - - 1 0",
            "solution": "1. Qg4+ Bxg4 2. Bf7#"
        },
        {
            "fen": "3q2r1/4n2k/p1p1rBpp/PpPpPp2/1P3P1Q/2P3R1/7P/1R5K w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh3#"
        },
        {
            "fen": "r2qk2r/pb4pp/1n2Pb2/2B2Q2/p1p5/2P5/2B2PPP/RN2R1K1 w - - 1 0",
            "solution": "1. Qg6+ hxg6 2. Bxg6#"
        },
        {
            "fen": "6k1/pp4p1/2p5/2bp4/8/P5Pb/1P3rrP/2BRRN1K b - - 0 1",
            "solution": "1... Rg1+ 2. Kxg1 Rxf1#"
        },
        {
            "fen": "rnbqkbn1/ppppp3/7r/6pp/3P1p2/3BP1B1/PPP2PPP/RN1QK1NR w - - 1 0",
            "solution": "1. Qxh5+ Rxh5 2. Bg6#"
        },
        {
            "fen": "r2qrb2/p1pn1Qp1/1p4Nk/4PR2/3n4/7N/P5PP/R6K w - - 1 0",
            "solution": "1. Ne7 Nxf5 2. Qg6#"
        },
        {
            "fen": "8/2r5/1k5p/1pp4P/8/K2P4/PR2QB2/2q5 b - - 0 1",
            "solution": "1... Qc3+ 2. Rb3 Ra7#"
        },
        {
            "fen": "r1b3nr/ppqk1Bbp/2pp4/4P1B1/3n4/3P4/PPP2QPP/R4RK1 w - - 1 0",
            "solution": "1. Qf5+ Nxf5 2. e6#"
        },
        {
            "fen": "3k1r1r/pb3p2/1p4p1/1B2B3/3qn3/6QP/P4RP1/2R3K1 w - - 1 0",
            "solution": "1. Bf6+ Qxf6 2. Qc7#"
        },
        {
            "fen": "rn2kb1r/1pQbpppp/1p6/qp1N4/6n1/8/PPP3PP/2KR2NR w - - 1 0",
            "solution": "1. Qc8+ Bxc8 2. Nc7#"
        },
        {
            "fen": "r2k2nr/pp1b1Q1p/2n4b/3N4/3q4/3P4/PPP3PP/4RR1K w - - 1 0",
            "solution": "1. Re8+ Bxe8 2. Qc7#"
        },
        {
            "fen": "7k/1p4p1/p4b1p/3N3P/2p5/2rb4/PP2r3/K2R2R1 b - - 0 1",
            "solution": "1... Rc1+ 2. Rxc1 Bxb2#"
        },
        {
            "fen": "r2q2nr/5p1p/p1Bp3b/1p1NkP2/3pP1p1/2PP2P1/PP5P/R1Bb1RK1 w - - 1 0",
            "solution": "1. Bf4+ Bxf4 2. gxf4#"
        },
        {
            "fen": "r2q1k1r/ppp1bB1p/2np4/6N1/3PP1bP/8/PPP5/RNB2RK1 w - - 1 0",
            "solution": "1. Ne6+ Bxe6 2. Bh6#"
        },
        {
            "fen": "6k1/1p1r1pp1/p1r3b1/3pPqB1/2pP4/Q1P4R/P3P2K/6R1 w - - 1 0",
            "solution": "1. Qf8+ Kxf8 2. Rh8#"
        },
        {
            "fen": "r1b3k1/ppp3pp/8/3pB3/1P1P4/3K1P2/PP1n1q1P/R2Q3R b - - 0 1",
            "solution": "1... Bf5+ 2. Kc3 Qe3#"
        },
        {
            "fen": "2kr1b1r/pp3ppp/2p1b2q/4B3/4Q3/2PB2R1/PPP2PPP/3R2K1 w - - 1 0",
            "solution": "1. Qxc6+ bxc6 2. Ba6#"
        },
        {
            "fen": "rn2kb1r/pp3ppp/4p1qn/1p4B1/2B5/3P2QP/PPP2PP1/R3K2R w - - 1 0",
            "solution": "1. Qxb8+ Rxb8 2. Bxb5#"
        },
        {
            "fen": "rnb2b1r/p3kBp1/3pNn1p/2pQN3/1p2PP2/4B3/Pq5P/4K3 w - - 1 0",
            "solution": "1. Qxd6+ Kxd6 2. Bxc5#"
        },
        {
            "fen": "r1b1k2r/ppQ1q2n/2p2p2/P3p2p/N3P1pP/1B4P1/1PP2P2/3R1NK1 w - - 1 0",
            "solution": "1. Rd8+ Qxd8 2. Qf7#"
        },
        {
            "fen": "r6k/pp4pp/1b1P4/8/1n4Q1/2N1RP2/PPq3p1/1RB1K3 b - - 0 1",
            "solution": "1... Nd3+ 2. Rxd3 Bf2#"
        },
        {
            "fen": "8/1r5p/kpQ3p1/p3rp2/P6P/8/4bPPK/1R6 w - - 1 0",
            "solution": "1. Rxb6+ Rxb6 2. Qa8#"
        },
        {
            "fen": "r1b2rk1/2p2ppp/p7/1p6/3P3q/1BP3bP/PP3QP1/RNB1R1K1 w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Re8#"
        },
        {
            "fen": "r2qkb1r/2p1nppp/p2p4/np1NN3/4P3/1BP5/PP1P1PPP/R1B1K2R w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Bxf7#"
        },
        {
            "fen": "rnbkn2r/pppp1Qpp/5b2/3NN3/3Pp3/8/PPP1KP1P/R1B4q w - - 1 0",
            "solution": "1. Qe7+ Bxe7 2. Nf7#"
        },
        {
            "fen": "4rk2/2pQn2p/p4p2/1p2pN1P/4q3/2P3R1/5PPK/8 w - - 1 0",
            "solution": "1. Rg8+ Kf7 2. Nh6#"
        },
        {
            "fen": "r1b2rk1/pp3ppp/3p4/3Q1nq1/2B1R3/8/PP3PPP/R5K1 w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Re8#"
        },
        {
            "fen": "7r/p3ppk1/3p4/2p1P1Kp/2Pb4/3P1QPq/PP5P/R6R b - - 0 1",
            "solution": "1... Be3+ 2. Qxe3 Qg4#"
        },
        {
            "fen": "rn2kb1r/ppp1pppp/8/8/4q3/3P1N1b/PPP1BPnP/RNBQ1K1R b kq - 0 1",
            "solution": "1... Nh4+ 2. Ke1 Nxf3#"
        },
        {
            "fen": "r1b1kb1r/pp1n1pp1/1qp1p2p/6B1/2PPQ3/3B1N2/P4PPP/R4RK1 w - - 1 0",
            "solution": "1. Qxe6+ fxe6 2. Bg6#"
        },
        {
            "fen": "6k1/5p2/1p5p/p4Np1/5q2/Q6P/PPr5/3R3K w - - 1 0",
            "solution": "1. Qf8+ Kxf8 2. Rd8#"
        },
        {
            "fen": "r3q3/ppp3k1/3p3R/5b2/2PR3Q/2P1PrP1/P7/4K3 w - - 1 0",
            "solution": "1. Qf6+ Kg8 2. Rh8#"
        },
        {
            "fen": "r3k2r/1Bp2ppp/8/4q1b1/pP1n4/P1KP3P/1BP5/R2Q3R b - - 0 1",
            "solution": "1... Nb5+ 2. Kc4 Nd6#"
        },
        {
            "fen": "r1bq2rk/pp3pbp/2p1p1pQ/7P/3P4/2PB1N2/PP3PPR/2KR4 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. hxg6#"
        },
        {
            "fen": "k1n3rr/Pp3p2/3q4/3N4/3Pp2p/1Q2P1p1/3B1PP1/R4RK1 w - - 1 0",
            "solution": "1. Qxb7+ Kxb7 2. a8=Q#"
        },
        {
            "fen": "8/1p3k2/4p1rp/p3Pp1Q/3qnP2/1P6/P6P/2R2R1K b - - 0 1",
            "solution": "1... Qg1+ 2. Rxg1 Nf2#"
        },
        {
            "fen": "r1bq3r/ppp1b1kp/2n3p1/3B3Q/3p4/8/PPP2PPP/RNB2RK1 w - - 1 0",
            "solution": "1. Bh6+ Kf6 2. Qg5#"
        },
        {
            "fen": "4r3/pbpn2n1/1p1prp1k/8/2PP2PB/P5N1/2B2R1P/R5K1 w - - 1 0",
            "solution": "1. Rxf6+ Nxf6 2. g5#"
        },
        {
            "fen": "1q5r/1b1r1p1k/2p1pPpb/p1Pp4/3B1P1Q/1P4P1/P4KB1/2RR4 w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh1#"
        },
        {
            "fen": "r4R2/1b2n1pp/p2Np1k1/1pn5/4pP1P/8/PPP1B1P1/2K4R w - - 1 0",
            "solution": "1. h5+ Kh6 2. Nf7#"
        },
        {
            "fen": "r1bqk2r/bppp1ppp/8/PB2N3/3n4/B7/2PPQnPP/RN2K2R w KQkq - 1 0",
            "solution": "1. Nxd7+ Nxe2 2. Nf6#"
        },
        {
            "fen": "1r4k1/3b2pp/1b1pP2r/pp1P4/4q3/8/PP4RP/2Q2R1K b - - 0 1",
            "solution": "1... Rxh2+ 2. Kxh2 Qh4#"
        },
        {
            "fen": "8/2k2p2/2b3p1/P1p1Np2/1p3b2/1P1K4/5r2/R3R3 b - - 0 1",
            "solution": "1... Bb5+ 2. Nc4 Rd2#"
        },
        {
            "fen": "r4r1k/2qb3p/p2p1p2/1pnPN3/2p1Pn2/2P1N3/PPB1QPR1/6RK w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Nf7#"
        },
        {
            "fen": "1r2q3/1R6/3p1kp1/1ppBp1b1/p3Pp2/2PP4/PP3P2/5K1Q w - - 1 0",
            "solution": "1. Qh8+ Qxh8 2. Rf7#"
        },
        {
            "fen": "r3kb1r/pb6/2p2p1p/1p2pq2/2pQ3p/2N2B2/PP3PPP/3RR1K1 w - - 1 0",
            "solution": "1. Bh5+ Qxh5 2. Qd7#"
        },
        {
            "fen": "4r3/2q1rpk1/p3bN1p/2p3p1/4QP2/2N4P/PP4P1/5RK1 w - - 1 0",
            "solution": "1. Qh7+ Kxf6 2. Ne4#"
        },
        {
            "fen": "r5rk/pp1np1bn/2pp2q1/3P1bN1/2P1N2Q/1P6/PB2PPBP/3R1RK1 w - - 1 0",
            "solution": "1. Qxh7+ Qxh7 2. Nf7#"
        },
        {
            "fen": "rn1qkb1r/4p2p/2p2nN1/p4p1Q/PpBP4/8/1P3PPP/R1B1K2R w - - 1 0",
            "solution": "1. Ne5+ Nxh5 2. Bf7#"
        },
        {
            "fen": "r1b2rk1/ppppbpp1/7p/4R3/6Qq/2BB4/PPP2PPP/R5K1 w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rg5#"
        },
        {
            "fen": "1r3k2/2n1p1b1/3p2QR/p1pq1pN1/bp6/7P/2P2PP1/4RBK1 w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Nh7#"
        },
        {
            "fen": "5b2/1p3rpk/p1b3Rp/4B1RQ/3P1p1P/7q/5P2/6K1 w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Qg6#"
        },
        {
            "fen": "r2Rnk1r/1p2q1b1/7p/6pQ/4Ppb1/1BP5/PP3BPP/2K4R w - - 1 0",
            "solution": "1. Qxe8+ Qxe8 2. Bc5#"
        },
        {
            "fen": "r2qr2k/pp1b3p/2nQ4/2pB1p1P/3n1PpR/2NP2P1/PPP5/2K1R1N1 w - - 1 0",
            "solution": "1. Rxe8+ Bxe8 2. Qf8#"
        },
        {
            "fen": "4r3/p2r1p1k/3q1Bpp/4P3/1PppR3/P5P1/5P1P/2Q3K1 w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh4#"
        },
        {
            "fen": "r3n1rk/q3NQ1p/p2pbP2/1p4p1/1P1pP1P1/3R4/P1P4P/3B2K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3#"
        },
        {
            "fen": "8/2r2pk1/3p2p1/3Pb3/2P1P2K/6r1/1R2B3/1R6 b - - 0 1",
            "solution": "1... Kh6 2. c5 g5#"
        },
        {
            "fen": "8/8/p3p3/3b1pR1/1B3P1k/8/4r1PK/8 w - - 1 0",
            "solution": "1. Be1+ Rxe1 2. g3#"
        },
        {
            "fen": "Q7/2r2rpk/2p4p/7N/3PpN2/1p2P3/1K4R1/5q2 w - - 1 0",
            "solution": "1. Rxg7+ Rxg7 2. Nf6#"
        },
        {
            "fen": "r3rknQ/1p1R1pb1/p3pqBB/2p5/8/6P1/PPP2P1P/4R1K1 w - - 1 0",
            "solution": "1. Qxg7+ Qxg7 2. Rxf7#"
        },
        {
            "fen": "4rr2/1p5R/3p1p2/p2Bp3/P2bPkP1/1P5R/1P2K3/8 w - - 1 0",
            "solution": "1. Rg7 Bxb2 2. Rf3#"
        },
        {
            "fen": "r4kr1/pbNn1q1p/1p6/2p2BPQ/5B2/8/P6P/b4RK1 w - - 1 0",
            "solution": "1. Bd6+ Qe7 2. Ne6#"
        },
        {
            "fen": "6rk/6pp/5p2/p7/P2Q1N2/4P1P1/2r2n1P/6K1 w - - 1 0",
            "solution": "1. Ng6+ hxg6 2. Qh4#"
        },
        {
            "fen": "1n6/p3q2p/2pNk3/1pP1p3/1P2P2Q/2P3P1/6K1/8 w - - 1 0",
            "solution": "1. Qh3+ Kf6 2. Qh6#"
        },
        {
            "fen": "6rk/p3p2p/1p2Pp2/2p2P2/2P1nBr1/1P6/P6P/3R1R1K b - - 0 1",
            "solution": "1... Rg1+ 2. Rxg1 Nf2#"
        },
        {
            "fen": "3rk3/1p3p2/2p5/7P/1P1qpp1R/P5P1/2Q5/3BK3 b - - 0 1",
            "solution": "1... Qg1+ 2. Ke2 f3#"
        },
        {
            "fen": "2QR4/6b1/1p4pk/7p/5n1P/4rq2/5P2/5BK1 w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Qxh8#"
        },
        {
            "fen": "r3q1k1/5p2/3P2pQ/Ppp5/1pnbN2R/8/1P4PP/5R1K w - - 1 0",
            "solution": "1. Rf6 Bxf6 2. Nxf6#"
        },
        {
            "fen": "5b2/R4p1p/1r2kp2/1p2pN2/2r1P3/P1P3P1/1PK4P/3R4 w - - 1 0",
            "solution": "1. Re7+ Bxe7 2. Ng7#"
        },
        {
            "fen": "r3q1r1/1p2bNkp/p3n3/2PN1B1Q/PP1P1p2/7P/5PP1/6K1 w - - 1 0",
            "solution": "1. Qh6+ Kxf7 2. Bxe6#"
        },
        {
            "fen": "1r2q2k/4N2p/3p1Pp1/2p1n1P1/2P5/p2P2KQ/P3R3/8 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh2#"
        },
        {
            "fen": "5R2/4r1r1/1p4k1/p1pB2Bp/P1P4K/2P1p3/1P6/8 w - - 1 0",
            "solution": "1. Rf6+ Kh7 2. Rh6#"
        },
        {
            "fen": "2bq1rk1/r1p1b1pn/p2pP1Np/1p1B1Q2/4P3/2P4P/PP3PP1/R1B1R1K1 w - - 1 0",
            "solution": "1. Qf7+ Rxf7 2. exf7#"
        },
        {
            "fen": "1nbk1b1r/1r6/p2P2pp/1B2PpN1/2p2P2/2P1B3/7P/R3K2R w - - 1 0",
            "solution": "1. Bb6+ Rxb6 2. Nf7#"
        },
        {
            "fen": "3r2k1/p1p2p2/bp2p1nQ/4PB1P/2pr3q/6R1/PP3PP1/3R2K1 w - - 1 0",
            "solution": "1. Rxg6+ fxg6 2. Bxe6#"
        },
        {
            "fen": "6k1/3r3p/p1q3pP/1p1p4/3Q4/4R1P1/P4PK1/8 w - - 1 0",
            "solution": "1. Qh8+ Kxh8 2. Re8#"
        },
        {
            "fen": "2k4r/ppp5/4bqp1/3p2Q1/6n1/2NB3P/PPP2bP1/R1B2R1K b - - 0 1",
            "solution": "1... Rxh3+ 2. gxh3 Qf3#"
        },
        {
            "fen": "r2r3k/b1qn2pp/1p2Bp2/2p2P2/PP1pQ3/7R/1B3PPP/5RK1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh4#"
        },
        {
            "fen": "8/1p3Qb1/p5pk/P1p1p1p1/1P2P1P1/2P1N2n/5P1P/4qB1K w - - 1 0",
            "solution": "1. Nf5+ gxf5 2. Qh5#"
        },
        {
            "fen": "3rrk2/2p2pR1/p4n2/1p1PpP2/2p2q1P/3P1BQ1/PPP5/6RK w - - 1 0",
            "solution": "1. Rxf7+ Kxf7 2. Qg7#"
        },
        {
            "fen": "r4kr1/1b2R1n1/pq4p1/4Q3/1p4P1/5P2/PPP4P/1K2R3 w - - 1 0",
            "solution": "1.Rf7+ Kxf7 2.Qe7#"
        },
        {
            "fen": "3n4/1R6/p5k1/2B5/1P3PK1/r7/8/8 w - - 1 0",
            "solution": "1. f5+ Kf6 2. Bd4#"
        },
        {
            "fen": "1r3rk1/1pnnq1bR/p1pp2B1/P2P1p2/1PP1pP2/2B3P1/5PK1/2Q4R w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Rxh8#"
        },
        {
            "fen": "b3r1k1/5ppp/p2p4/p4qN1/Q2b4/6R1/5PPP/5RK1 b - - 0 1",
            "solution": "1... Qxf2+ 2. Rxf2 Re1#"
        },
        {
            "fen": "5r1k/pp1n1p1p/5n1Q/3p1pN1/3P4/1P4RP/P1r1qPP1/R5K1 w - - 1 0",
            "solution": "1. Qxf8+ Nxf8 2. Nxf7#"
        },
        {
            "fen": "5k2/p3Rr2/1p4pp/q4p2/1nbQ1P2/6P1/5N1P/3R2K1 w - - 1 0",
            "solution": "1. Re8+ Kxe8 2. Qd8#"
        },
        {
            "fen": "4rk2/pp2N1bQ/5p2/8/2q5/P7/3r2PP/4RR1K w - - 1 0",
            "solution": "1. Rxf6+ Bxf6 2. Ng6#"
        },
        {
            "fen": "r4rk1/4bp2/1Bppq1p1/4p1n1/2P1Pn2/3P2N1/P2Q1PBK/1R5R b - - 0 1",
            "solution": "1... Qh3+ 2. Bxh3 Nf3#"
        },
        {
            "fen": "2q1r3/4pR2/3rQ1pk/p1pnN2p/Pn5B/8/1P4PP/3R3K w - - 1 0",
            "solution": "1. Nf3 Qxe6 2. Bg5#"
        },
        {
            "fen": "q2br1k1/1b4pp/3Bp3/p6n/1p3R2/3B1N2/PP2QPPP/6K1 w - - 1 0",
            "solution": "1. Qxe6+ Rxe6 2. Rf8#"
        },
        {
            "fen": "5r1k/p2n1p1p/5P1N/1p1p4/2pP3P/8/PP4RK/8 w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Nxf7#"
        },
        {
            "fen": "8/7p/5pk1/3n2pq/3N1nR1/1P3P2/P6P/4QK2 w - - 1 0",
            "solution": "1.Qe8+ Kg7 2.Nf5#"
        },
        {
            "fen": "2Q5/pp2rk1p/3p2pq/2bP1r2/5RR1/1P2P3/PB3P1P/7K w - - 1 0",
            "solution": "1. Rxf5+ gxf5 2. Qg8#"
        },
        {
            "fen": "4r1k1/pQ3pp1/7p/4q3/4r3/P7/1P2nPPP/2BR1R1K b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Rh4#"
        },
        {
            "fen": "3R1rk1/1pp2pp1/1p6/8/8/P7/1q4BP/3Q2K1 w - - 1 0",
            "solution": "1. Rxf8+ Kh7 2. Qh5#"
        },
        {
            "fen": "6k1/5p2/p3bRpQ/4q3/2r3P1/6NP/P1p2R1K/1r6 w - - 1 0",
            "solution": "1. Rxg6+ fxg6 2. Rf8#"
        },
        {
            "fen": "rnb1k2r/pp3ppp/1qp2B2/2bPp3/4P3/2N5/PPP3PP/R2QKBNR b KQkq - 0 1",
            "solution": "1... Bf2+ 2. Kd2 Qe3#"
        },
        {
            "fen": "r2r4/pp2ppkp/2P3p1/q1p5/4PQ2/2P2b2/P4PPP/2R1KB1R b - - 0 1",
            "solution": "1... Qxc3+ 2. Rxc3 Rd1#"
        },
        {
            "fen": "8/8/2N1P3/1P6/4Q3/4b2K/4k3/4q3 w - - 1 0",
            "solution": "1. Nd4+ Kd1 2. Qc2#"
        },
        {
            "fen": "1b2r1k1/3n2p1/p3p2p/1p3r2/3PNp1q/3BnP1P/PP1BQP1K/R6R b - - 0 1",
            "solution": "1... Qxh3+ 2. Kxh3 Rh5#"
        },
        {
            "fen": "5b2/q4r1p/p3k1p1/2pNppP1/1P6/3Q1P1P/P7/1K1R4 w - - 1 0",
            "solution": "1. Nf4+ exf4 2. Qe2#"
        },
        {
            "fen": "8/2p5/Q4pk1/p1Pp4/5n2/PP3PK1/2q4N/8 b - - 0 1",
            "solution": "1... Qg2+ 2. Kxf4 Qg5#"
        },
        {
            "fen": "r3nr1k/1b2Nppp/pn6/q3p1P1/P1p4Q/R7/1P2PP1P/2B2RK1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3#"
        },
        {
            "fen": "r1b3nr/ppp1kB1p/3p4/8/3PPBnb/1Q3p2/PPP2q2/RN4RK b - - 0 1",
            "solution": "1... Qh2+ 2. Bxh2 Nf2#"
        },
        {
            "fen": "q5k1/5rb1/r6p/1Np1n1p1/3p1Pn1/1N4P1/PP5P/R1BQRK2 b - - 0 1",
            "solution": "1... Qh1+ 2. Ke2 Qg2#"
        },
        {
            "fen": "8/2P2pk1/3Q4/4pq2/7p/6pP/2r3P1/6RK b - - 0 1",
            "solution": "1... Qxh3+ 2. gxh3 Rh2#"
        },
        {
            "fen": "8/p1R3p1/4p1kn/3p3N/3Pr2P/6P1/PP3K2/8 w - - 1 0",
            "solution": "1. Rxg7+ Kxh5 2. Rg5#"
        },
        {
            "fen": "r1b1k2r/1p2bppp/p3q3/1p2p1B1/8/3Q1N2/PPP2PPP/3R1RK1 w kq - 1 0",
            "solution": "1. Qd8+ Bxd8 2. Rxd8#"
        },
        {
            "fen": "rn2k2r/pp2b2p/2p1Q1p1/5B2/1q3B2/8/PPP3PP/3RR2K w kq - 1 0",
            "solution": "1. Rd8+ Kxd8 2. Qc8#"
        },
        {
            "fen": "r1b1k2r/pp3ppp/2n1p3/6B1/2p1q3/Q7/PP2PPPP/3RKB1R w Kkq - 1 0",
            "solution": "1. Rd8+ Nxd8 2. Qe7#"
        },
        {
            "fen": "2k4r/1pp1n1pp/p1pr1pb1/4p3/Nq2P1P1/1P1PKN1P/2P1QP2/3R3R b - - 0 1",
            "solution": "1... Nd5+ 2. exd5 Qf4#"
        },
        {
            "fen": "5k1r/4npp1/p3p2p/3nP2P/3P3Q/3N4/qB2KPP1/2R5 w - - 1 0",
            "solution": "1. Rc8+ Nxc8 2. Qd8#"
        },
        {
            "fen": "2r5/2R5/3npkpp/3bN3/p4PP1/4K3/P1B4P/8 w - - 1 0",
            "solution": "1. g5+ hxg5 2. Ng4#"
        },
        {
            "fen": "5r1r/1p6/p1p2p2/2P1bPpk/4R3/6PP/P2B2K1/3R4 w - - 1 0",
            "solution": "1. Rh4+ gxh4 2. g4#"
        },
        {
            "fen": "5qrk/5p1n/pp3p1Q/2pPp3/2P1P1rN/2P4R/P5P1/2B3K1 w - - 1 0",
            "solution": "1. Ng6+ R4xg6 2. Qxh7#"
        },
        {
            "fen": "3rk2r/p1qn1pp1/1p2pb1p/7P/2Pp4/B1P1QP2/P1B1KP2/3R3R w k - 1 0",
            "solution": "1. Qxe6+ fxe6 2. Bg6#"
        },
        {
            "fen": "r3kb1r/q5pp/p1p1Bnn1/1p2Q3/8/2N2PBP/PPP5/2KRR3 w - - 1 0",
            "solution": "1. Bf7+ Kxf7 2. Qe6#"
        },
        {
            "fen": "rq3rk1/3n1pp1/pb4n1/3N2P1/1pB1QP2/4B3/PP6/2KR3R w - - 1 0",
            "solution": "1. Ne7+ Nxe7 2. Qh7#"
        },
        {
            "fen": "3q2r1/p2b1k2/1pnBp1N1/3p1pQP/6P1/5R2/2r2P2/4RK2 w - - 1 0",
            "solution": "1. Nh8+ Rxh8 2. Qg6#"
        },
        {
            "fen": "8/p4pk1/6p1/3R4/3nqN1P/2Q3P1/5P2/3r1BK1 b - - 0 1",
            "solution": "1... Rxf1+ 2. Kxf1 Qh1#"
        },
        {
            "fen": "2r5/3nbkp1/2q1p1p1/1p1n2P1/3P4/2p1P1NQ/1P1B1P2/1B4KR w - - 1 0",
            "solution": "1. Bxg6+ Kxg6 2. Qh5#"
        },
        {
            "fen": "r1bq1rkb/ppp2n1p/5n2/4p1NN/5pQ1/1BP5/PP3PPP/R1B1K2R w KQ - 1 0",
            "solution": "1. Nxf7+ Nxg4 2. Nh6#"
        },
        {
            "fen": "4r3/1b2r2p/p2p2k1/P1pP1R1N/3b4/1P1B3P/3n2P1/5R1K w - - 1 0",
            "solution": "1. Re5+ Ne4 2. Rf6#"
        },
        {
            "fen": "2b3k1/1p5p/2p1n1pQ/3qB3/3P4/3B3P/r5P1/5RK1 w - - 1 0",
            "solution": "1. Rf8+ Nxf8 2. Qg7#"
        },
        {
            "fen": "3rk2r/1pR2p2/b2BpPp1/p2p4/8/1P6/P4PPP/4R1K1 w - - 1 0",
            "solution": "1. Rxe6+ fxe6 2. f7#"
        },
        {
            "fen": "4nr1k/1bq3pp/5p2/1p2pNQ1/3pP3/1B1P3R/1PP3PP/6K1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh5#"
        },
        {
            "fen": "r1bk1r2/pp1n2pp/3NQ3/1P6/8/2n2PB1/q1B3PP/3R1RK1 w - - 1 0",
            "solution": "1. Nxb7+ Bxb7 2. Qxd7#"
        },
        {
            "fen": "1rb2k2/pp3ppQ/7q/2p1n1N1/2p5/2N5/P3BP1P/K2R4 w - - 1 0",
            "solution": "1. Qg8+ Ke7 2. Qd8#"
        },
        {
            "fen": "4r3/5p1k/2p1nBpp/q2p4/P1bP4/2P1R2Q/2B2PPP/6K1 w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh3#"
        },
        {
            "fen": "2r3k1/6pp/4pp2/3bp3/1Pq5/3R1P2/r1PQ2PP/1K1RN3 b - - 0 1",
            "solution": "1... Ra1+ 2. Kb2 Qa2#"
        },
        {
            "fen": "6R1/5r1k/p6b/1pB1p2q/1P6/5rQP/5P1K/6R1 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qg8#"
        },
        {
            "fen": "r5q1/pp1b1kr1/2p2p2/2Q5/2PpB3/1P4NP/P4P2/4RK2 w - - 1 0",
            "solution": "1. Bg6+ Kxg6 2. Qh5#"
        },
        {
            "fen": "2r1kb1r/p2b1ppp/3p4/Q2Np1B1/4P2P/8/PP4P1/4KB1n w k - 1 0",
            "solution": "1. Qd8+ Rxd8 2. Nc7#"
        },
        {
            "fen": "5rk1/ppp2pbp/3p2p1/1q6/4r1P1/1NP1B3/PP2nPP1/R2QR2K b - - 0 1",
            "solution": "1... Qh5+ 2. gxh5 Rh4#"
        },
        {
            "fen": "r2q1bk1/5n1p/2p3pP/p7/3Br3/1P3PQR/P5P1/2KR4 w - - 1 0",
            "solution": "1. Qxg6+ hxg6 2. h7#"
        },
        {
            "fen": "2b5/k2n1p2/p2q4/5R1B/2p4P/P1b5/KPQ1R3/6r1 b - - 0 1",
            "solution": "1... Qxa3+ 2. Kxa3 Ra1#"
        },
        {
            "fen": "4Q3/r4ppk/3p3p/4pPbB/2P1P3/1q5P/6P1/3R3K w - - 1 0",
            "solution": "1. Bg6+ fxg6 2. fxg6#"
        },
        {
            "fen": "rn5r/p4pp1/3n3p/qB1k4/3P4/4P3/PP2NPPP/R4K1R w - - 1 0",
            "solution": "1. Nf4+ Ke4 2. Bd3#"
        },
        {
            "fen": "r2r2k1/pp2bppp/2p1p3/4qb1P/8/1BP1BQ2/PP3PP1/2KR3R b - - 0 1",
            "solution": "1... Qxc3+ 2. bxc3 Ba3#"
        },
        {
            "fen": "5R2/6k1/3K4/p6r/1p1NB3/1P4r1/8/8 w - - 1 0",
            "solution": "1. Ne6+ Kh6 2. Rh8#"
        },
        {
            "fen": "5r2/1qp2pp1/bnpk3p/4NQ2/2P5/1P5P/5PP1/4R1K1 w - - 1 0",
            "solution": "1. Nxf7+ Rxf7 2. c5#"
        },
        {
            "fen": "3nk1r1/1pq4p/p3PQpB/5p2/2r5/8/P4PPP/3RR1K1 w - - 1 0",
            "solution": "1. Rxd8+ Qxd8 2. Qf7#"
        },
        {
            "fen": "5rk1/5ppp/pq6/1r3n2/2Q2P2/1P1N4/P1P1R1PP/4R2K b - - 0 1",
            "solution": "1... Ng3+ 2. hxg3 Rh5#"
        },
        {
            "fen": "1k3r2/4R1Q1/p2q1r2/8/2p1Bb2/5R2/pP5P/K7 w - - 1 0",
            "solution": "1. Re8+ Rxe8 2. Qb7#"
        },
        {
            "fen": "2k1r2r/ppp3p1/3b4/3pq2b/7p/2NP1P2/PPP2Q1P/R5RK b - - 0 1",
            "solution": "1... Bxf3+ 2. Rg2 Qxh2#"
        },
        {
            "fen": "3k4/1p3Bp1/p5r1/2b5/P3P1N1/5Pp1/1P1r4/2R4K b - - 0 1",
            "solution": "1... Rh2+ 2. Nxh2 g2#"
        },
        {
            "fen": "6k1/1r4np/pp1p1R1B/2pP2p1/P1P5/1n5P/6P1/4R2K w - - 1 0",
            "solution": "1. Re8+ Nxe8 2. Rf8#"
        },
        {
            "fen": "8/p2q1p1k/4pQp1/1p1b2Bp/7P/8/5PP1/6K1 w - - 1 0",
            "solution": "1. Bh6 Kxh6 2. Qh8#"
        },
        {
            "fen": "r7/6R1/ppkqrn1B/2pp3p/P6n/2N5/8/1Q1R1K2 w - - 1 0",
            "solution": "1. Qb5+ axb5 2. axb5#"
        },
        {
            "fen": "r2q1k1r/3bnp2/p1n1pNp1/3pP1Qp/Pp1P4/2PB4/5PPP/R1B2RK1 w - - 1 0",
            "solution": "1. Qh6+ Rxh6 2. Bxh6#"
        },
        {
            "fen": "6rk/1r2pR1p/3pP1pB/2p1p3/P6Q/P1q3P1/7P/5BK1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Bf8#"
        },
        {
            "fen": "1r2Rr2/3P1p1k/5Rpp/qp6/2pQ4/7P/5PPK/8 w - - 1 0",
            "solution": "1. Rxf7+ Rxf7 2. Qh8#"
        },
        {
            "fen": "r4rk1/5Rbp/p1qN2p1/P1n1P3/8/1Q3N1P/5PP1/5RK1 w - - 1 0",
            "solution": "1. Rxf8+ Kxf8 2. Qf7#"
        },
        {
            "fen": "7R/3r4/8/3pkp1p/5N1P/b3PK2/5P2/8 w - - 1 0",
            "solution": "1. Rh6 Re7 2. Nd3#"
        },
        {
            "fen": "8/1R3p2/3rk2p/p2p2p1/P2P2P1/3B1PN1/5K1P/r7 w - - 1 0",
            "solution": "1. Bf5+ Kf6 2. Nh5#"
        },
        {
            "fen": "8/5prk/p5rb/P3N2R/1p1PQ2p/7P/1P3RPq/5K2 w - - 1 0",
            "solution": "1. Rxh6+ Kg8 2. Qa8#"
        },
        {
            "fen": "rqb2bk1/3n2pr/p1pp2Qp/1p6/3BP2N/2N4P/PPP3P1/2KR3R w - - 1 0",
            "solution": "1. Qe6+ Kh8 2. Ng6#"
        },
        {
            "fen": "1Q6/r3R2p/k2p2pP/p1q5/Pp4P1/5P2/1PP3K1/8 w - - 1 0",
            "solution": "1. Rxa7+ Qxa7 2. Qb5#"
        },
        {
            "fen": "N5k1/5p2/6p1/6Pp/4bb1P/P5r1/7K/2R3R1 b - - 0 1",
            "solution": "1... Rg2+ 2. Kh3 Rh2#"
        },
        {
            "fen": "3R4/3Q1p2/q1rn2kp/4p3/4P3/2N3P1/5P1P/6K1 w - - 1 0",
            "solution": "1. Qg4+ Kf6 2. Nd5#"
        },
        {
            "fen": "6R1/2k2P2/1n5r/3p1p2/3P3b/1QP2p1q/3R4/6K1 b - - 0 1",
            "solution": "1... Qh1+ 2. Kxh1 Bf2#"
        },
        {
            "fen": "5r2/7p/3R4/p3pk2/1p2N2p/1P2BP2/6PK/4r3 w - - 1 0",
            "solution": "1. g4+ hxg3+ 2. Nxg3#"
        },
        {
            "fen": "7r/3kbp1p/1Q3R2/3p3q/p2P3B/1P5K/P6P/8 w - - 1 0",
            "solution": "1. Qc6+ Kd8 2. Rd6#"
        },
        {
            "fen": "r4r1k/p2p3p/bp1Np3/4P3/2P2nR1/3B1q2/P1PQ4/2K3R1 w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Nf7#"
        },
        {
            "fen": "1r3b2/1bp2pkp/p1q4N/1p1n1pBn/8/2P3QP/PPB2PP1/4R1K1 w - - 1 0",
            "solution": "1. Bf6+ Kxf6 2. Ng8#"
        },
        {
            "fen": "8/k1p1q3/Pp5Q/4p3/2P1P2p/3P4/4K3/8 w - - 1 0",
            "solution": "1. Qc6 Kxa6 2. Qa8#"
        },
        {
            "fen": "8/pp2k3/7r/2P1p1p1/4P3/5pq1/2R3N1/1R3BK1 b - - 0 1",
            "solution": "1... f2+ 2. Rxf2 Qh2#"
        },
        {
            "fen": "7k/p5b1/1p4Bp/2q1p1p1/1P1n1r2/P2Q2N1/6P1/3R2K1 b - - 0 1",
            "solution": "1... Ne2+ 2. Kh2 Rh4#"
        },
        {
            "fen": "8/p4q2/6k1/1p3rP1/3Q4/8/PPP5/K6R w - - 1 0",
            "solution": "1. Rh6+ Kxg5 2. Qh4#"
        },
        {
            "fen": "2r3k1/1p3ppp/p3p3/7P/P4P2/1R2QbP1/6q1/1B2K3 b - - 0 1",
            "solution": "1... Rc1+ 2. Qxc1 Qe2#"
        },
        {
            "fen": "6r1/p6k/Bp3n1r/2pP1P2/P4q1P/2P2Q2/5K2/2R2R2 b - - 0 1",
            "solution": "1... Ne4+ 2. Ke1 Qd2#"
        },
        {
            "fen": "8/8/8/5P2/R2p1N2/4n1r1/PP6/5k1K b - - 0 1",
            "solution": "1... Ng4 2. Ng2 Rh3#"
        },
        {
            "fen": "r7/4k1Pp/2n1p2P/q2pp1N1/1p4P1/1P6/P4R2/1K1R4 w - - 1 0",
            "solution": "1. Rf7+ Kd6 2. Ne4#"
        },
        {
            "fen": "2Q5/1p3p2/3b1k1p/3Pp3/4B1R1/4q1P1/r4PK1/8 w - - 1 0",
            "solution": "1. Qd8+ Be7 2. Qh8#"
        },
        {
            "fen": "8/5Qpk/p1R4p/P2p4/6P1/2rq4/5PPK/8 w - - 1 0",
            "solution": "1. Rxh6+ Kxh6 2. Qh5#"
        },
        {
            "fen": "3n1k2/5p2/2p1bb2/1p2pN1q/1P2P3/2P3Q1/5PB1/3R2K1 w - - 1 0",
            "solution": "1. Qg7+ Bxg7 2. Rxd8#"
        },
        {
            "fen": "rnR5/p3p1kp/4p1pn/bpP5/5BP1/5N1P/2P2P2/2K5 w - - 1 0",
            "solution": "1. Be5+ Kf7 2. Ng5#"
        },
        {
            "fen": "6rk/6p1/4R2p/p2pP2b/5Q2/2P2PB1/1q4PK/8 w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Qxh6#"
        },
        {
            "fen": "1Q6/8/3p1pk1/2pP4/1p3K2/5R2/5qP1/4r3 b - - 0 1",
            "solution": "1... Re4+ 2. Kxe4 Qd4#"
        },
        {
            "fen": "r4r1k/pp5p/n5p1/1q2Np1n/1Pb5/6P1/PQ2PPBP/1RB3K1 w - - 1 0",
            "solution": "1. Nf7+ Kg8 2. Nh6#"
        },
        {
            "fen": "7k/p1p2bp1/3q1N1p/4rP2/4pQ2/2P4R/P2r2PP/4R2K w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Qxh6#"
        },
        {
            "fen": "7k/2p3pp/p7/1p1p4/PP2pr2/B1P3qP/4N1B1/R1Qn2K1 b - - 0 1",
            "solution": "1... Rf1+ 2. Kxf1 Qf2#"
        },
        {
            "fen": "r1b2k2/1p1p1r1B/n4p2/p1qPp3/2P4N/4P1R1/PPQ3PP/R5K1 w - - 1 0",
            "solution": "1. Rg8+ Ke7 2. Nf5#"
        },
        {
            "fen": "8/8/2K2b2/2N2k2/1p4R1/1B3n1P/3r1P2/8 w - - 1 0",
            "solution": "1. Be6+ Ke5 2. Re4#"
        },
        {
            "fen": "5R2/R5pp/2b1p1k1/5n2/p1r2PK1/8/7P/8 b - - 0 1",
            "solution": "1... h5+ 2. Kh3 Rc3#"
        },
        {
            "fen": "8/3R3p/2b4k/p1p1B1p1/2n2PB1/3p1P2/P7/6K1 w - - 1 0",
            "solution": "1. Bg7+ Kg6 2. f5# *"
        },
        {
            "fen": "6k1/1p5p/3P3r/4p3/2N1PBpb/PPr5/3R1P1K/5b1R b - - 0 1",
            "solution": "1... Bxf2+ 2. Bxh6 Rh3#"
        },
        {
            "fen": "8/4n2k/b1Pp2p1/3Ppp1p/p2qP3/3B1P2/Q2NK1PP/3R4 b - - 0 1",
            "solution": "1... Bxd3+ 2. Ke1 Qe3#"
        },
        {
            "fen": "k2r4/ppRn2p1/6p1/1P3p2/3p1B2/6P1/P4PBP/4n1K1 w - - 1 0",
            "solution": "1. Bxb7+ Kb8 2. Rxd7#"
        },
        {
            "fen": "4rk2/1bq2p1Q/3p1bp1/1p1n2N1/4PB2/2Pp3P/1P1N4/5RK1 w - - 1 0",
            "solution": "1. Bxd6+ Qe7 2. Qxf7#"
        },
        {
            "fen": "8/R7/pp1b2kp/1b1B1p2/5P1P/5KP1/P7/8 w - - 1 0",
            "solution": "1. h5+ Kxh5 2. Bf7#"
        },
        {
            "fen": "2b3k1/6p1/p2bp2r/1p1p4/3Np1B1/1PP1PRq1/P1R3P1/3Q2K1 b - - 0 1",
            "solution": "1... Rh1+ 2. Kxh1 Qh2#"
        },
        {
            "fen": "6k1/p2p2p1/8/3np1N1/1P5R/3q2P1/5RKP/8 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Rf8#"
        },
        {
            "fen": "2r3k1/3b2b1/5pp1/3P4/pB2P3/2NnqN2/1P2B2Q/5K1R b - - 0 1",
            "solution": "1... Bh3+ 2. Qg2 Qf2#"
        },
        {
            "fen": "n3r1k1/Q4R1p/p5pb/1p2p1N1/1q2P3/1P4PB/2P3KP/8 w - - 1 0",
            "solution": "1. Rf8+ Qxf8 2. Qxh7#"
        },
        {
            "fen": "2r5/2k4p/1p2pp2/1P2qp2/8/Q5P1/4PP1P/R5K1 w - - 1 0",
            "solution": "1. Qe7+ Kb8 2. Qa7#"
        },
        {
            "fen": "6k1/4q1b1/p1p1p1Q1/1r4N1/4p3/1P5R/5P2/7K w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qh7#"
        },
        {
            "fen": "5rk1/pb2npp1/1pq4p/5p2/5B2/1B6/P2RQ1PP/2r1R2K b - - 0 1",
            "solution": "1... Qxg2+ 2. Qxg2 Rxe1#"
        },
        {
            "fen": "6k1/2R1Qpb1/3Bp1p1/1p2n2p/3q4/1P5P/2N2PPK/r7 b - - 0 1",
            "solution": "1... Qf4+ 2. g3 Qxf2#"
        },
        {
            "fen": "6k1/pp3p2/2p2np1/2P1pbqp/P3P3/2N2nP1/2Pr1P2/1RQ1RB1K b - - 0 1",
            "solution": "1... Qxg3 2. fxg3 Rh2#"
        },
        {
            "fen": "6k1/p2rR1p1/1p1r1p1R/3P4/4QPq1/1P6/P5PK/8 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Re8#"
        },
        {
            "fen": "7R/1bpkp3/p2pp3/3P4/4B1q1/2Q5/4NrP1/3K4 w - - 1 0",
            "solution": "1. Qc6+ Bxc6 2. dxc6#"
        },
        {
            "fen": "1r3r1k/qp5p/3N4/3p2Q1/p6P/P7/1b6/1KR3R1 w - - 1 0",
            "solution": "1. Qg8+ Rxg8 2. Nf7#"
        },
        {
            "fen": "r3k2r/p3bpp1/2q1p1b1/1ppPP1B1/3n3P/5NR1/PP2NP2/K1QR4 b kq - 0 1",
            "solution": "1... Nb3+ 2. axb3 Qa6#"
        },
        {
            "fen": "1r5k/3b3p/3p3b/2qPp3/Pnp4P/Q1N5/8/K5RR b - - 0 1",
            "solution": "1... Nc2+ 2. Ka2 Qxa3#"
        },
        {
            "fen": "1k1r4/pp5R/2p5/P5p1/7b/4Pq2/1PQ2P2/3NK3 b - - 0 1",
            "solution": "1... Rxd1+ 2. Qxd1 Qxf2#"
        },
        {
            "fen": "1r3k2/4R3/1p4Pp/p1pN1p2/2Pn1K2/1P6/1P6/8 w - - 1 0",
            "solution": "1. g7+ Kg8 2. Nf6#"
        },
        {
            "fen": "5bk1/R4p1p/6p1/8/3p2K1/1Q4P1/1P3P1q/2r5 b - - 0 1",
            "solution": "1... Qh5+ 2. Kf4 Qf5#"
        },
        {
            "fen": "3rr2k/pp1b2b1/4q1pp/2Pp1p2/3B4/1P2QNP1/P6P/R4RK1 w - - 1 0",
            "solution": "1. Qxh6+ Kg8 2. Qxg7#"
        },
        {
            "fen": "3r2k1/6pp/1nQ1R3/3r4/3N2q1/6N1/n4PPP/4R1K1 w - - 1 0",
            "solution": "1. Re8+ Kf7 2. R1e7#"
        },
        {
            "fen": "5bk1/6p1/5PQ1/pp4Pp/2p4P/P2r4/1PK5/8 w - - 1 0",
            "solution": "1. f7+ Kh8 2. Qxh5#"
        },
        {
            "fen": "r2qkb1r/pp2nppp/3p4/2pNN1B1/2BnP3/3P4/PPP2PPP/R2bK2R w KQkq - 1 0",
            "solution": "1. Nf6+ gxf6 2. Bxf7#"
        },
        {
            "fen": "1rb4r/pkPp3p/1b1P3n/1Q6/N3Pp2/8/P1P3PP/7K w - - 1 0",
            "solution": "1. Qd5+ Ka6 2. cxb8=N#"
        },
        {
            "fen": "4kb1r/p2n1ppp/4q3/4p1B1/4P3/1Q6/PPP2PPP/2KR4 w k - 1 0",
            "solution": "1. Qb8+ Nxb8 2. Rd8#"
        },
        {
            "fen": "r1b2k1r/ppp1bppp/8/1B1Q4/5q2/2P5/PPP2PPP/R3R1K1 w - - 1 0",
            "solution": "1. Qd8+ Bxd8 2. Re8#"
        },
        {
            "fen": "5rkr/pp2Rp2/1b1p1Pb1/3P2Q1/2n3P1/2p5/P4P2/4R1K1 w - - 1 0",
            "solution": "1. Qxg6+ fxg6 2. Rg7#"
        },
        {
            "fen": "1r1kr3/Nbppn1pp/1b6/8/6Q1/3B1P2/Pq3P1P/3RR1K1 w - - 1 0",
            "solution": "1. Qxd7+ Kxd7 2. Bb5#"
        },
        {
            "fen": "5rk1/1p1q2bp/p2pN1p1/2pP2Bn/2P3P1/1P6/P4QKP/5R2 w - - 1 0",
            "solution": "1. Qxf8+ Bxf8 2. Rxf8#"
        },
        {
            "fen": "r1nk3r/2b2ppp/p3b3/3NN3/Q2P3q/B2B4/P4PPP/4R1K1 w - - 1 0",
            "solution": "1. Qd7+ Bxd7 2. Nxf7#"
        },
        {
            "fen": "r4br1/3b1kpp/1q1P4/1pp1RP1N/p7/6Q1/PPB3PP/2KR4 w - - 1 0",
            "solution": "1. Qg6+ hxg6 2. fxg6#"
        },
        {
            "fen": "r1b2k1r/ppppq3/5N1p/4P2Q/4PP2/1B6/PP5P/n2K2R1 w - - 1 0",
            "solution": "1. Qxh6+ Rxh6 2. Rg8#"
        },
        {
            "fen": "r2q1b1r/1pN1n1pp/p1n3k1/4Pb2/2BP4/8/PPP3PP/R1BQ1RK1 w - - 1 0",
            "solution": "1. Qg4+ Bxg4 2. Bf7#"
        },
        {
            "fen": "3q2r1/4n2k/p1p1rBpp/PpPpPp2/1P3P1Q/2P3R1/7P/1R5K w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh3#"
        },
        {
            "fen": "r2qk2r/pb4pp/1n2Pb2/2B2Q2/p1p5/2P5/2B2PPP/RN2R1K1 w - - 1 0",
            "solution": "1. Qg6+ hxg6 2. Bxg6#"
        },
        {
            "fen": "6k1/pp4p1/2p5/2bp4/8/P5Pb/1P3rrP/2BRRN1K b - - 0 1",
            "solution": "1... Rg1+ 2. Kxg1 Rxf1#"
        },
        {
            "fen": "rnbqkbn1/ppppp3/7r/6pp/3P1p2/3BP1B1/PPP2PPP/RN1QK1NR w - - 1 0",
            "solution": "1. Qxh5+ Rxh5 2. Bg6#"
        },
        {
            "fen": "r2qrb2/p1pn1Qp1/1p4Nk/4PR2/3n4/7N/P5PP/R6K w - - 1 0",
            "solution": "1. Ne7 Nxf5 2. Qg6#"
        },
        {
            "fen": "8/2r5/1k5p/1pp4P/8/K2P4/PR2QB2/2q5 b - - 0 1",
            "solution": "1... Qc3+ 2. Rb3 Ra7#"
        },
        {
            "fen": "r1b3nr/ppqk1Bbp/2pp4/4P1B1/3n4/3P4/PPP2QPP/R4RK1 w - - 1 0",
            "solution": "1. Qf5+ Nxf5 2. e6#"
        },
        {
            "fen": "3k1r1r/pb3p2/1p4p1/1B2B3/3qn3/6QP/P4RP1/2R3K1 w - - 1 0",
            "solution": "1. Bf6+ Qxf6 2. Qc7#"
        },
        {
            "fen": "rn2kb1r/1pQbpppp/1p6/qp1N4/6n1/8/PPP3PP/2KR2NR w - - 1 0",
            "solution": "1. Qc8+ Bxc8 2. Nc7#"
        },
        {
            "fen": "r2k2nr/pp1b1Q1p/2n4b/3N4/3q4/3P4/PPP3PP/4RR1K w - - 1 0",
            "solution": "1. Re8+ Bxe8 2. Qc7#"
        },
        {
            "fen": "7k/1p4p1/p4b1p/3N3P/2p5/2rb4/PP2r3/K2R2R1 b - - 0 1",
            "solution": "1... Rc1+ 2. Rxc1 Bxb2#"
        },
        {
            "fen": "r2q2nr/5p1p/p1Bp3b/1p1NkP2/3pP1p1/2PP2P1/PP5P/R1Bb1RK1 w - - 1 0",
            "solution": "1. Bf4+ Bxf4 2. gxf4#"
        },
        {
            "fen": "r2q1k1r/ppp1bB1p/2np4/6N1/3PP1bP/8/PPP5/RNB2RK1 w - - 1 0",
            "solution": "1. Ne6+ Bxe6 2. Bh6#"
        },
        {
            "fen": "6k1/1p1r1pp1/p1r3b1/3pPqB1/2pP4/Q1P4R/P3P2K/6R1 w - - 1 0",
            "solution": "1. Qf8+ Kxf8 2. Rh8#"
        },
        {
            "fen": "r1b3k1/ppp3pp/8/3pB3/1P1P4/3K1P2/PP1n1q1P/R2Q3R b - - 0 1",
            "solution": "1... Bf5+ 2. Kc3 Qe3#"
        },
        {
            "fen": "2kr1b1r/pp3ppp/2p1b2q/4B3/4Q3/2PB2R1/PPP2PPP/3R2K1 w - - 1 0",
            "solution": "1. Qxc6+ bxc6 2. Ba6#"
        },
        {
            "fen": "rn2kb1r/pp3ppp/4p1qn/1p4B1/2B5/3P2QP/PPP2PP1/R3K2R w - - 1 0",
            "solution": "1. Qxb8+ Rxb8 2. Bxb5#"
        },
        {
            "fen": "rnb2b1r/p3kBp1/3pNn1p/2pQN3/1p2PP2/4B3/Pq5P/4K3 w - - 1 0",
            "solution": "1. Qxd6+ Kxd6 2. Bxc5#"
        },
        {
            "fen": "r1b1k2r/ppQ1q2n/2p2p2/P3p2p/N3P1pP/1B4P1/1PP2P2/3R1NK1 w - - 1 0",
            "solution": "1. Rd8+ Qxd8 2. Qf7#"
        },
        {
            "fen": "r6k/pp4pp/1b1P4/8/1n4Q1/2N1RP2/PPq3p1/1RB1K3 b - - 0 1",
            "solution": "1... Nd3+ 2. Rxd3 Bf2#"
        },
        {
            "fen": "8/1r5p/kpQ3p1/p3rp2/P6P/8/4bPPK/1R6 w - - 1 0",
            "solution": "1. Rxb6+ Rxb6 2. Qa8#"
        },
        {
            "fen": "r1b2rk1/2p2ppp/p7/1p6/3P3q/1BP3bP/PP3QP1/RNB1R1K1 w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Re8#"
        },
        {
            "fen": "r2qkb1r/2p1nppp/p2p4/np1NN3/4P3/1BP5/PP1P1PPP/R1B1K2R w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Bxf7#"
        },
        {
            "fen": "rnbkn2r/pppp1Qpp/5b2/3NN3/3Pp3/8/PPP1KP1P/R1B4q w - - 1 0",
            "solution": "1. Qe7+ Bxe7 2. Nf7#"
        },
        {
            "fen": "4rk2/2pQn2p/p4p2/1p2pN1P/4q3/2P3R1/5PPK/8 w - - 1 0",
            "solution": "1. Rg8+ Kf7 2. Nh6#"
        },
        {
            "fen": "r1b2rk1/pp3ppp/3p4/3Q1nq1/2B1R3/8/PP3PPP/R5K1 w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Re8#"
        },
        {
            "fen": "7r/p3ppk1/3p4/2p1P1Kp/2Pb4/3P1QPq/PP5P/R6R b - - 0 1",
            "solution": "1... Be3+ 2. Qxe3 Qg4#"
        },
        {
            "fen": "rn2kb1r/ppp1pppp/8/8/4q3/3P1N1b/PPP1BPnP/RNBQ1K1R b kq - 0 1",
            "solution": "1... Nh4+ 2. Ke1 Nxf3#"
        },
        {
            "fen": "r1b1kb1r/pp1n1pp1/1qp1p2p/6B1/2PPQ3/3B1N2/P4PPP/R4RK1 w - - 1 0",
            "solution": "1. Qxe6+ fxe6 2. Bg6#"
        },
        {
            "fen": "6k1/5p2/1p5p/p4Np1/5q2/Q6P/PPr5/3R3K w - - 1 0",
            "solution": "1. Qf8+ Kxf8 2. Rd8#"
        },
        {
            "fen": "r3q3/ppp3k1/3p3R/5b2/2PR3Q/2P1PrP1/P7/4K3 w - - 1 0",
            "solution": "1. Qf6+ Kg8 2. Rh8#"
        },
        {
            "fen": "r3k2r/1Bp2ppp/8/4q1b1/pP1n4/P1KP3P/1BP5/R2Q3R b - - 0 1",
            "solution": "1... Nb5+ 2. Kc4 Nd6#"
        },
        {
            "fen": "r1bq2rk/pp3pbp/2p1p1pQ/7P/3P4/2PB1N2/PP3PPR/2KR4 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. hxg6#"
        },
        {
            "fen": "k1n3rr/Pp3p2/3q4/3N4/3Pp2p/1Q2P1p1/3B1PP1/R4RK1 w - - 1 0",
            "solution": "1. Qxb7+ Kxb7 2. a8=Q#"
        },
        {
            "fen": "8/1p3k2/4p1rp/p3Pp1Q/3qnP2/1P6/P6P/2R2R1K b - - 0 1",
            "solution": "1... Qg1+ 2. Rxg1 Nf2#"
        },
        {
            "fen": "r1bq3r/ppp1b1kp/2n3p1/3B3Q/3p4/8/PPP2PPP/RNB2RK1 w - - 1 0",
            "solution": "1. Bh6+ Kf6 2. Qg5#"
        },
        {
            "fen": "4r3/pbpn2n1/1p1prp1k/8/2PP2PB/P5N1/2B2R1P/R5K1 w - - 1 0",
            "solution": "1. Rxf6+ Nxf6 2. g5#"
        },
        {
            "fen": "1q5r/1b1r1p1k/2p1pPpb/p1Pp4/3B1P1Q/1P4P1/P4KB1/2RR4 w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh1#"
        },
        {
            "fen": "r4R2/1b2n1pp/p2Np1k1/1pn5/4pP1P/8/PPP1B1P1/2K4R w - - 1 0",
            "solution": "1. h5+ Kh6 2. Nf7#"
        },
        {
            "fen": "r1bqk2r/bppp1ppp/8/PB2N3/3n4/B7/2PPQnPP/RN2K2R w KQkq - 1 0",
            "solution": "1. Nxd7+ Nxe2 2. Nf6#"
        },
        {
            "fen": "1r4k1/3b2pp/1b1pP2r/pp1P4/4q3/8/PP4RP/2Q2R1K b - - 0 1",
            "solution": "1... Rxh2+ 2. Kxh2 Qh4#"
        },
        {
            "fen": "8/2k2p2/2b3p1/P1p1Np2/1p3b2/1P1K4/5r2/R3R3 b - - 0 1",
            "solution": "1... Bb5+ 2. Nc4 Rd2#"
        },
        {
            "fen": "r4r1k/2qb3p/p2p1p2/1pnPN3/2p1Pn2/2P1N3/PPB1QPR1/6RK w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Nf7#"
        },
        {
            "fen": "1r2q3/1R6/3p1kp1/1ppBp1b1/p3Pp2/2PP4/PP3P2/5K1Q w - - 1 0",
            "solution": "1. Qh8+ Qxh8 2. Rf7#"
        },
        {
            "fen": "r3kb1r/pb6/2p2p1p/1p2pq2/2pQ3p/2N2B2/PP3PPP/3RR1K1 w - - 1 0",
            "solution": "1. Bh5+ Qxh5 2. Qd7#"
        },
        {
            "fen": "4r3/2q1rpk1/p3bN1p/2p3p1/4QP2/2N4P/PP4P1/5RK1 w - - 1 0",
            "solution": "1. Qh7+ Kxf6 2. Ne4#"
        },
        {
            "fen": "r5rk/pp1np1bn/2pp2q1/3P1bN1/2P1N2Q/1P6/PB2PPBP/3R1RK1 w - - 1 0",
            "solution": "1. Qxh7+ Qxh7 2. Nf7#"
        },
        {
            "fen": "rn1qkb1r/4p2p/2p2nN1/p4p1Q/PpBP4/8/1P3PPP/R1B1K2R w - - 1 0",
            "solution": "1. Ne5+ Nxh5 2. Bf7#"
        },
        {
            "fen": "r1b2rk1/ppppbpp1/7p/4R3/6Qq/2BB4/PPP2PPP/R5K1 w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rg5#"
        },
        {
            "fen": "1r3k2/2n1p1b1/3p2QR/p1pq1pN1/bp6/7P/2P2PP1/4RBK1 w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Nh7#"
        },
        {
            "fen": "5b2/1p3rpk/p1b3Rp/4B1RQ/3P1p1P/7q/5P2/6K1 w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Qg6#"
        },
        {
            "fen": "r2Rnk1r/1p2q1b1/7p/6pQ/4Ppb1/1BP5/PP3BPP/2K4R w - - 1 0",
            "solution": "1. Qxe8+ Qxe8 2. Bc5#"
        },
        {
            "fen": "r2qr2k/pp1b3p/2nQ4/2pB1p1P/3n1PpR/2NP2P1/PPP5/2K1R1N1 w - - 1 0",
            "solution": "1. Rxe8+ Bxe8 2. Qf8#"
        },
        {
            "fen": "4r3/p2r1p1k/3q1Bpp/4P3/1PppR3/P5P1/5P1P/2Q3K1 w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh4#"
        },
        {
            "fen": "r3n1rk/q3NQ1p/p2pbP2/1p4p1/1P1pP1P1/3R4/P1P4P/3B2K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3#"
        },
        {
            "fen": "8/2r2pk1/3p2p1/3Pb3/2P1P2K/6r1/1R2B3/1R6 b - - 0 1",
            "solution": "1... Kh6 2. c5 g5#"
        },
        {
            "fen": "8/8/p3p3/3b1pR1/1B3P1k/8/4r1PK/8 w - - 1 0",
            "solution": "1. Be1+ Rxe1 2. g3#"
        },
        {
            "fen": "Q7/2r2rpk/2p4p/7N/3PpN2/1p2P3/1K4R1/5q2 w - - 1 0",
            "solution": "1. Rxg7+ Rxg7 2. Nf6#"
        },
        {
            "fen": "r3rknQ/1p1R1pb1/p3pqBB/2p5/8/6P1/PPP2P1P/4R1K1 w - - 1 0",
            "solution": "1. Qxg7+ Qxg7 2. Rxf7#"
        },
        {
            "fen": "4rr2/1p5R/3p1p2/p2Bp3/P2bPkP1/1P5R/1P2K3/8 w - - 1 0",
            "solution": "1. Rg7 Bxb2 2. Rf3#"
        },
        {
            "fen": "r4kr1/pbNn1q1p/1p6/2p2BPQ/5B2/8/P6P/b4RK1 w - - 1 0",
            "solution": "1. Bd6+ Qe7 2. Ne6#"
        },
        {
            "fen": "6rk/6pp/5p2/p7/P2Q1N2/4P1P1/2r2n1P/6K1 w - - 1 0",
            "solution": "1. Ng6+ hxg6 2. Qh4#"
        },
        {
            "fen": "1n6/p3q2p/2pNk3/1pP1p3/1P2P2Q/2P3P1/6K1/8 w - - 1 0",
            "solution": "1. Qh3+ Kf6 2. Qh6#"
        },
        {
            "fen": "6rk/p3p2p/1p2Pp2/2p2P2/2P1nBr1/1P6/P6P/3R1R1K b - - 0 1",
            "solution": "1... Rg1+ 2. Rxg1 Nf2#"
        },
        {
            "fen": "3rk3/1p3p2/2p5/7P/1P1qpp1R/P5P1/2Q5/3BK3 b - - 0 1",
            "solution": "1... Qg1+ 2. Ke2 f3#"
        },
        {
            "fen": "2QR4/6b1/1p4pk/7p/5n1P/4rq2/5P2/5BK1 w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Qxh8#"
        },
        {
            "fen": "r3q1k1/5p2/3P2pQ/Ppp5/1pnbN2R/8/1P4PP/5R1K w - - 1 0",
            "solution": "1. Rf6 Bxf6 2. Nxf6#"
        },
        {
            "fen": "5b2/R4p1p/1r2kp2/1p2pN2/2r1P3/P1P3P1/1PK4P/3R4 w - - 1 0",
            "solution": "1. Re7+ Bxe7 2. Ng7#"
        },
        {
            "fen": "r3q1r1/1p2bNkp/p3n3/2PN1B1Q/PP1P1p2/7P/5PP1/6K1 w - - 1 0",
            "solution": "1. Qh6+ Kxf7 2. Bxe6#"
        },
        {
            "fen": "1r2q2k/4N2p/3p1Pp1/2p1n1P1/2P5/p2P2KQ/P3R3/8 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh2#"
        },
        {
            "fen": "5R2/4r1r1/1p4k1/p1pB2Bp/P1P4K/2P1p3/1P6/8 w - - 1 0",
            "solution": "1. Rf6+ Kh7 2. Rh6#"
        },
        {
            "fen": "2bq1rk1/r1p1b1pn/p2pP1Np/1p1B1Q2/4P3/2P4P/PP3PP1/R1B1R1K1 w - - 1 0",
            "solution": "1. Qf7+ Rxf7 2. exf7#"
        },
        {
            "fen": "1nbk1b1r/1r6/p2P2pp/1B2PpN1/2p2P2/2P1B3/7P/R3K2R w - - 1 0",
            "solution": "1. Bb6+ Rxb6 2. Nf7#"
        },
        {
            "fen": "3r2k1/p1p2p2/bp2p1nQ/4PB1P/2pr3q/6R1/PP3PP1/3R2K1 w - - 1 0",
            "solution": "1. Rxg6+ fxg6 2. Bxe6#"
        },
        {
            "fen": "6k1/3r3p/p1q3pP/1p1p4/3Q4/4R1P1/P4PK1/8 w - - 1 0",
            "solution": "1. Qh8+ Kxh8 2. Re8#"
        },
        {
            "fen": "2k4r/ppp5/4bqp1/3p2Q1/6n1/2NB3P/PPP2bP1/R1B2R1K b - - 0 1",
            "solution": "1... Rxh3+ 2. gxh3 Qf3#"
        },
        {
            "fen": "r2r3k/b1qn2pp/1p2Bp2/2p2P2/PP1pQ3/7R/1B3PPP/5RK1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh4#"
        },
        {
            "fen": "8/1p3Qb1/p5pk/P1p1p1p1/1P2P1P1/2P1N2n/5P1P/4qB1K w - - 1 0",
            "solution": "1. Nf5+ gxf5 2. Qh5#"
        },
        {
            "fen": "3rrk2/2p2pR1/p4n2/1p1PpP2/2p2q1P/3P1BQ1/PPP5/6RK w - - 1 0",
            "solution": "1. Rxf7+ Kxf7 2. Qg7#"
        },
        {
            "fen": "r4kr1/1b2R1n1/pq4p1/4Q3/1p4P1/5P2/PPP4P/1K2R3 w - - 1 0",
            "solution": "1.Rf7+ Kxf7 2.Qe7#"
        },
        {
            "fen": "3n4/1R6/p5k1/2B5/1P3PK1/r7/8/8 w - - 1 0",
            "solution": "1. f5+ Kf6 2. Bd4#"
        },
        {
            "fen": "1r3rk1/1pnnq1bR/p1pp2B1/P2P1p2/1PP1pP2/2B3P1/5PK1/2Q4R w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Rxh8#"
        },
        {
            "fen": "b3r1k1/5ppp/p2p4/p4qN1/Q2b4/6R1/5PPP/5RK1 b - - 0 1",
            "solution": "1... Qxf2+ 2. Rxf2 Re1#"
        },
        {
            "fen": "5r1k/pp1n1p1p/5n1Q/3p1pN1/3P4/1P4RP/P1r1qPP1/R5K1 w - - 1 0",
            "solution": "1. Qxf8+ Nxf8 2. Nxf7#"
        },
        {
            "fen": "5k2/p3Rr2/1p4pp/q4p2/1nbQ1P2/6P1/5N1P/3R2K1 w - - 1 0",
            "solution": "1. Re8+ Kxe8 2. Qd8#"
        },
        {
            "fen": "4rk2/pp2N1bQ/5p2/8/2q5/P7/3r2PP/4RR1K w - - 1 0",
            "solution": "1. Rxf6+ Bxf6 2. Ng6#"
        },
        {
            "fen": "r4rk1/4bp2/1Bppq1p1/4p1n1/2P1Pn2/3P2N1/P2Q1PBK/1R5R b - - 0 1",
            "solution": "1... Qh3+ 2. Bxh3 Nf3#"
        },
        {
            "fen": "2q1r3/4pR2/3rQ1pk/p1pnN2p/Pn5B/8/1P4PP/3R3K w - - 1 0",
            "solution": "1. Nf3 Qxe6 2. Bg5#"
        },
        {
            "fen": "q2br1k1/1b4pp/3Bp3/p6n/1p3R2/3B1N2/PP2QPPP/6K1 w - - 1 0",
            "solution": "1. Qxe6+ Rxe6 2. Rf8#"
        },
        {
            "fen": "5r1k/p2n1p1p/5P1N/1p1p4/2pP3P/8/PP4RK/8 w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Nxf7#"
        },
        {
            "fen": "8/7p/5pk1/3n2pq/3N1nR1/1P3P2/P6P/4QK2 w - - 1 0",
            "solution": "1.Qe8+ Kg7 2.Nf5#"
        },
        {
            "fen": "2Q5/pp2rk1p/3p2pq/2bP1r2/5RR1/1P2P3/PB3P1P/7K w - - 1 0",
            "solution": "1. Rxf5+ gxf5 2. Qg8#"
        },
        {
            "fen": "4r1k1/pQ3pp1/7p/4q3/4r3/P7/1P2nPPP/2BR1R1K b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Rh4#"
        },
        {
            "fen": "3R1rk1/1pp2pp1/1p6/8/8/P7/1q4BP/3Q2K1 w - - 1 0",
            "solution": "1. Rxf8+ Kh7 2. Qh5#"
        },
        {
            "fen": "6k1/5p2/p3bRpQ/4q3/2r3P1/6NP/P1p2R1K/1r6 w - - 1 0",
            "solution": "1. Rxg6+ fxg6 2. Rf8#"
        },
        {
            "fen": "rnb1k2r/pp3ppp/1qp2B2/2bPp3/4P3/2N5/PPP3PP/R2QKBNR b KQkq - 0 1",
            "solution": "1... Bf2+ 2. Kd2 Qe3#"
        },
        {
            "fen": "r2r4/pp2ppkp/2P3p1/q1p5/4PQ2/2P2b2/P4PPP/2R1KB1R b - - 0 1",
            "solution": "1... Qxc3+ 2. Rxc3 Rd1#"
        },
        {
            "fen": "8/8/2N1P3/1P6/4Q3/4b2K/4k3/4q3 w - - 1 0",
            "solution": "1. Nd4+ Kd1 2. Qc2#"
        },
        {
            "fen": "1b2r1k1/3n2p1/p3p2p/1p3r2/3PNp1q/3BnP1P/PP1BQP1K/R6R b - - 0 1",
            "solution": "1... Qxh3+ 2. Kxh3 Rh5#"
        },
        {
            "fen": "5b2/q4r1p/p3k1p1/2pNppP1/1P6/3Q1P1P/P7/1K1R4 w - - 1 0",
            "solution": "1. Nf4+ exf4 2. Qe2#"
        },
        {
            "fen": "8/2p5/Q4pk1/p1Pp4/5n2/PP3PK1/2q4N/8 b - - 0 1",
            "solution": "1... Qg2+ 2. Kxf4 Qg5#"
        },
        {
            "fen": "r3nr1k/1b2Nppp/pn6/q3p1P1/P1p4Q/R7/1P2PP1P/2B2RK1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3#"
        },
        {
            "fen": "r1b3nr/ppp1kB1p/3p4/8/3PPBnb/1Q3p2/PPP2q2/RN4RK b - - 0 1",
            "solution": "1... Qh2+ 2. Bxh2 Nf2#"
        },
        {
            "fen": "q5k1/5rb1/r6p/1Np1n1p1/3p1Pn1/1N4P1/PP5P/R1BQRK2 b - - 0 1",
            "solution": "1... Qh1+ 2. Ke2 Qg2#"
        },
        {
            "fen": "8/2P2pk1/3Q4/4pq2/7p/6pP/2r3P1/6RK b - - 0 1",
            "solution": "1... Qxh3+ 2. gxh3 Rh2#"
        },
        {
            "fen": "8/p1R3p1/4p1kn/3p3N/3Pr2P/6P1/PP3K2/8 w - - 1 0",
            "solution": "1. Rxg7+ Kxh5 2. Rg5#"
        },
        {
            "fen": "r1b1k2r/1p2bppp/p3q3/1p2p1B1/8/3Q1N2/PPP2PPP/3R1RK1 w kq - 1 0",
            "solution": "1. Qd8+ Bxd8 2. Rxd8#"
        },
        {
            "fen": "rn2k2r/pp2b2p/2p1Q1p1/5B2/1q3B2/8/PPP3PP/3RR2K w kq - 1 0",
            "solution": "1. Rd8+ Kxd8 2. Qc8#"
        },
        {
            "fen": "r1b1k2r/pp3ppp/2n1p3/6B1/2p1q3/Q7/PP2PPPP/3RKB1R w Kkq - 1 0",
            "solution": "1. Rd8+ Nxd8 2. Qe7#"
        },
        {
            "fen": "2k4r/1pp1n1pp/p1pr1pb1/4p3/Nq2P1P1/1P1PKN1P/2P1QP2/3R3R b - - 0 1",
            "solution": "1... Nd5+ 2. exd5 Qf4#"
        },
        {
            "fen": "5k1r/4npp1/p3p2p/3nP2P/3P3Q/3N4/qB2KPP1/2R5 w - - 1 0",
            "solution": "1. Rc8+ Nxc8 2. Qd8#"
        },
        {
            "fen": "2r5/2R5/3npkpp/3bN3/p4PP1/4K3/P1B4P/8 w - - 1 0",
            "solution": "1. g5+ hxg5 2. Ng4#"
        },
        {
            "fen": "5r1r/1p6/p1p2p2/2P1bPpk/4R3/6PP/P2B2K1/3R4 w - - 1 0",
            "solution": "1. Rh4+ gxh4 2. g4#"
        },
        {
            "fen": "5qrk/5p1n/pp3p1Q/2pPp3/2P1P1rN/2P4R/P5P1/2B3K1 w - - 1 0",
            "solution": "1. Ng6+ R4xg6 2. Qxh7#"
        },
        {
            "fen": "3rk2r/p1qn1pp1/1p2pb1p/7P/2Pp4/B1P1QP2/P1B1KP2/3R3R w k - 1 0",
            "solution": "1. Qxe6+ fxe6 2. Bg6#"
        },
        {
            "fen": "r3kb1r/q5pp/p1p1Bnn1/1p2Q3/8/2N2PBP/PPP5/2KRR3 w - - 1 0",
            "solution": "1. Bf7+ Kxf7 2. Qe6#"
        },
        {
            "fen": "rq3rk1/3n1pp1/pb4n1/3N2P1/1pB1QP2/4B3/PP6/2KR3R w - - 1 0",
            "solution": "1. Ne7+ Nxe7 2. Qh7#"
        },
        {
            "fen": "3q2r1/p2b1k2/1pnBp1N1/3p1pQP/6P1/5R2/2r2P2/4RK2 w - - 1 0",
            "solution": "1. Nh8+ Rxh8 2. Qg6#"
        },
        {
            "fen": "8/p4pk1/6p1/3R4/3nqN1P/2Q3P1/5P2/3r1BK1 b - - 0 1",
            "solution": "1... Rxf1+ 2. Kxf1 Qh1#"
        },
        {
            "fen": "2r5/3nbkp1/2q1p1p1/1p1n2P1/3P4/2p1P1NQ/1P1B1P2/1B4KR w - - 1 0",
            "solution": "1. Bxg6+ Kxg6 2. Qh5#"
        },
        {
            "fen": "r1bq1rkb/ppp2n1p/5n2/4p1NN/5pQ1/1BP5/PP3PPP/R1B1K2R w KQ - 1 0",
            "solution": "1. Nxf7+ Nxg4 2. Nh6#"
        },
        {
            "fen": "4r3/1b2r2p/p2p2k1/P1pP1R1N/3b4/1P1B3P/3n2P1/5R1K w - - 1 0",
            "solution": "1. Re5+ Ne4 2. Rf6#"
        },
        {
            "fen": "2b3k1/1p5p/2p1n1pQ/3qB3/3P4/3B3P/r5P1/5RK1 w - - 1 0",
            "solution": "1. Rf8+ Nxf8 2. Qg7#"
        },
        {
            "fen": "3rk2r/1pR2p2/b2BpPp1/p2p4/8/1P6/P4PPP/4R1K1 w - - 1 0",
            "solution": "1. Rxe6+ fxe6 2. f7#"
        },
        {
            "fen": "4nr1k/1bq3pp/5p2/1p2pNQ1/3pP3/1B1P3R/1PP3PP/6K1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh5#"
        },
        {
            "fen": "r1bk1r2/pp1n2pp/3NQ3/1P6/8/2n2PB1/q1B3PP/3R1RK1 w - - 1 0",
            "solution": "1. Nxb7+ Bxb7 2. Qxd7#"
        },
        {
            "fen": "1rb2k2/pp3ppQ/7q/2p1n1N1/2p5/2N5/P3BP1P/K2R4 w - - 1 0",
            "solution": "1. Qg8+ Ke7 2. Qd8#"
        },
        {
            "fen": "4r3/5p1k/2p1nBpp/q2p4/P1bP4/2P1R2Q/2B2PPP/6K1 w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh3#"
        },
        {
            "fen": "2r3k1/6pp/4pp2/3bp3/1Pq5/3R1P2/r1PQ2PP/1K1RN3 b - - 0 1",
            "solution": "1... Ra1+ 2. Kb2 Qa2#"
        },
        {
            "fen": "6R1/5r1k/p6b/1pB1p2q/1P6/5rQP/5P1K/6R1 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qg8#"
        },
        {
            "fen": "r5q1/pp1b1kr1/2p2p2/2Q5/2PpB3/1P4NP/P4P2/4RK2 w - - 1 0",
            "solution": "1. Bg6+ Kxg6 2. Qh5#"
        },
        {
            "fen": "2r1kb1r/p2b1ppp/3p4/Q2Np1B1/4P2P/8/PP4P1/4KB1n w k - 1 0",
            "solution": "1. Qd8+ Rxd8 2. Nc7#"
        },
        {
            "fen": "5rk1/ppp2pbp/3p2p1/1q6/4r1P1/1NP1B3/PP2nPP1/R2QR2K b - - 0 1",
            "solution": "1... Qh5+ 2. gxh5 Rh4#"
        },
        {
            "fen": "r2q1bk1/5n1p/2p3pP/p7/3Br3/1P3PQR/P5P1/2KR4 w - - 1 0",
            "solution": "1. Qxg6+ hxg6 2. h7#"
        },
        {
            "fen": "2b5/k2n1p2/p2q4/5R1B/2p4P/P1b5/KPQ1R3/6r1 b - - 0 1",
            "solution": "1... Qxa3+ 2. Kxa3 Ra1#"
        },
        {
            "fen": "4Q3/r4ppk/3p3p/4pPbB/2P1P3/1q5P/6P1/3R3K w - - 1 0",
            "solution": "1. Bg6+ fxg6 2. fxg6#"
        },
        {
            "fen": "rn5r/p4pp1/3n3p/qB1k4/3P4/4P3/PP2NPPP/R4K1R w - - 1 0",
            "solution": "1. Nf4+ Ke4 2. Bd3#"
        },
        {
            "fen": "r2r2k1/pp2bppp/2p1p3/4qb1P/8/1BP1BQ2/PP3PP1/2KR3R b - - 0 1",
            "solution": "1... Qxc3+ 2. bxc3 Ba3#"
        },
        {
            "fen": "5R2/6k1/3K4/p6r/1p1NB3/1P4r1/8/8 w - - 1 0",
            "solution": "1. Ne6+ Kh6 2. Rh8#"
        },
        {
            "fen": "5r2/1qp2pp1/bnpk3p/4NQ2/2P5/1P5P/5PP1/4R1K1 w - - 1 0",
            "solution": "1. Nxf7+ Rxf7 2. c5#"
        },
        {
            "fen": "3nk1r1/1pq4p/p3PQpB/5p2/2r5/8/P4PPP/3RR1K1 w - - 1 0",
            "solution": "1. Rxd8+ Qxd8 2. Qf7#"
        },
        {
            "fen": "5rk1/5ppp/pq6/1r3n2/2Q2P2/1P1N4/P1P1R1PP/4R2K b - - 0 1",
            "solution": "1... Ng3+ 2. hxg3 Rh5#"
        },
        {
            "fen": "1k3r2/4R1Q1/p2q1r2/8/2p1Bb2/5R2/pP5P/K7 w - - 1 0",
            "solution": "1. Re8+ Rxe8 2. Qb7#"
        },
        {
            "fen": "2k1r2r/ppp3p1/3b4/3pq2b/7p/2NP1P2/PPP2Q1P/R5RK b - - 0 1",
            "solution": "1... Bxf3+ 2. Rg2 Qxh2#"
        },
        {
            "fen": "3k4/1p3Bp1/p5r1/2b5/P3P1N1/5Pp1/1P1r4/2R4K b - - 0 1",
            "solution": "1... Rh2+ 2. Nxh2 g2#"
        },
        {
            "fen": "6k1/1r4np/pp1p1R1B/2pP2p1/P1P5/1n5P/6P1/4R2K w - - 1 0",
            "solution": "1. Re8+ Nxe8 2. Rf8#"
        },
        {
            "fen": "8/p2q1p1k/4pQp1/1p1b2Bp/7P/8/5PP1/6K1 w - - 1 0",
            "solution": "1. Bh6 Kxh6 2. Qh8#"
        },
        {
            "fen": "r7/6R1/ppkqrn1B/2pp3p/P6n/2N5/8/1Q1R1K2 w - - 1 0",
            "solution": "1. Qb5+ axb5 2. axb5#"
        },
        {
            "fen": "r2q1k1r/3bnp2/p1n1pNp1/3pP1Qp/Pp1P4/2PB4/5PPP/R1B2RK1 w - - 1 0",
            "solution": "1. Qh6+ Rxh6 2. Bxh6#"
        },
        {
            "fen": "6rk/1r2pR1p/3pP1pB/2p1p3/P6Q/P1q3P1/7P/5BK1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Bf8#"
        },
        {
            "fen": "1r2Rr2/3P1p1k/5Rpp/qp6/2pQ4/7P/5PPK/8 w - - 1 0",
            "solution": "1. Rxf7+ Rxf7 2. Qh8#"
        },
        {
            "fen": "r4rk1/5Rbp/p1qN2p1/P1n1P3/8/1Q3N1P/5PP1/5RK1 w - - 1 0",
            "solution": "1. Rxf8+ Kxf8 2. Qf7#"
        },
        {
            "fen": "7R/3r4/8/3pkp1p/5N1P/b3PK2/5P2/8 w - - 1 0",
            "solution": "1. Rh6 Re7 2. Nd3#"
        },
        {
            "fen": "8/1R3p2/3rk2p/p2p2p1/P2P2P1/3B1PN1/5K1P/r7 w - - 1 0",
            "solution": "1. Bf5+ Kf6 2. Nh5#"
        },
        {
            "fen": "8/5prk/p5rb/P3N2R/1p1PQ2p/7P/1P3RPq/5K2 w - - 1 0",
            "solution": "1. Rxh6+ Kg8 2. Qa8#"
        },
        {
            "fen": "rqb2bk1/3n2pr/p1pp2Qp/1p6/3BP2N/2N4P/PPP3P1/2KR3R w - - 1 0",
            "solution": "1. Qe6+ Kh8 2. Ng6#"
        },
        {
            "fen": "1Q6/r3R2p/k2p2pP/p1q5/Pp4P1/5P2/1PP3K1/8 w - - 1 0",
            "solution": "1. Rxa7+ Qxa7 2. Qb5#"
        },
        {
            "fen": "N5k1/5p2/6p1/6Pp/4bb1P/P5r1/7K/2R3R1 b - - 0 1",
            "solution": "1... Rg2+ 2. Kh3 Rh2#"
        },
        {
            "fen": "3R4/3Q1p2/q1rn2kp/4p3/4P3/2N3P1/5P1P/6K1 w - - 1 0",
            "solution": "1. Qg4+ Kf6 2. Nd5#"
        },
        {
            "fen": "6R1/2k2P2/1n5r/3p1p2/3P3b/1QP2p1q/3R4/6K1 b - - 0 1",
            "solution": "1... Qh1+ 2. Kxh1 Bf2#"
        },
        {
            "fen": "5r2/7p/3R4/p3pk2/1p2N2p/1P2BP2/6PK/4r3 w - - 1 0",
            "solution": "1. g4+ hxg3+ 2. Nxg3#"
        },
        {
            "fen": "7r/3kbp1p/1Q3R2/3p3q/p2P3B/1P5K/P6P/8 w - - 1 0",
            "solution": "1. Qc6+ Kd8 2. Rd6#"
        },
        {
            "fen": "r4r1k/p2p3p/bp1Np3/4P3/2P2nR1/3B1q2/P1PQ4/2K3R1 w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Nf7#"
        },
        {
            "fen": "1r3b2/1bp2pkp/p1q4N/1p1n1pBn/8/2P3QP/PPB2PP1/4R1K1 w - - 1 0",
            "solution": "1. Bf6+ Kxf6 2. Ng8#"
        },
        {
            "fen": "8/k1p1q3/Pp5Q/4p3/2P1P2p/3P4/4K3/8 w - - 1 0",
            "solution": "1. Qc6 Kxa6 2. Qa8#"
        },
        {
            "fen": "8/pp2k3/7r/2P1p1p1/4P3/5pq1/2R3N1/1R3BK1 b - - 0 1",
            "solution": "1... f2+ 2. Rxf2 Qh2#"
        },
        {
            "fen": "7k/p5b1/1p4Bp/2q1p1p1/1P1n1r2/P2Q2N1/6P1/3R2K1 b - - 0 1",
            "solution": "1... Ne2+ 2. Kh2 Rh4#"
        },
        {
            "fen": "8/p4q2/6k1/1p3rP1/3Q4/8/PPP5/K6R w - - 1 0",
            "solution": "1. Rh6+ Kxg5 2. Qh4#"
        },
        {
            "fen": "2r3k1/1p3ppp/p3p3/7P/P4P2/1R2QbP1/6q1/1B2K3 b - - 0 1",
            "solution": "1... Rc1+ 2. Qxc1 Qe2#"
        },
        {
            "fen": "6r1/p6k/Bp3n1r/2pP1P2/P4q1P/2P2Q2/5K2/2R2R2 b - - 0 1",
            "solution": "1... Ne4+ 2. Ke1 Qd2#"
        },
        {
            "fen": "8/8/8/5P2/R2p1N2/4n1r1/PP6/5k1K b - - 0 1",
            "solution": "1... Ng4 2. Ng2 Rh3#"
        },
        {
            "fen": "r7/4k1Pp/2n1p2P/q2pp1N1/1p4P1/1P6/P4R2/1K1R4 w - - 1 0",
            "solution": "1. Rf7+ Kd6 2. Ne4#"
        },
        {
            "fen": "2Q5/1p3p2/3b1k1p/3Pp3/4B1R1/4q1P1/r4PK1/8 w - - 1 0",
            "solution": "1. Qd8+ Be7 2. Qh8#"
        },
        {
            "fen": "8/5Qpk/p1R4p/P2p4/6P1/2rq4/5PPK/8 w - - 1 0",
            "solution": "1. Rxh6+ Kxh6 2. Qh5#"
        },
        {
            "fen": "3n1k2/5p2/2p1bb2/1p2pN1q/1P2P3/2P3Q1/5PB1/3R2K1 w - - 1 0",
            "solution": "1. Qg7+ Bxg7 2. Rxd8#"
        },
        {
            "fen": "rnR5/p3p1kp/4p1pn/bpP5/5BP1/5N1P/2P2P2/2K5 w - - 1 0",
            "solution": "1. Be5+ Kf7 2. Ng5#"
        },
        {
            "fen": "6rk/6p1/4R2p/p2pP2b/5Q2/2P2PB1/1q4PK/8 w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Qxh6#"
        },
        {
            "fen": "1Q6/8/3p1pk1/2pP4/1p3K2/5R2/5qP1/4r3 b - - 0 1",
            "solution": "1... Re4+ 2. Kxe4 Qd4#"
        },
        {
            "fen": "r4r1k/pp5p/n5p1/1q2Np1n/1Pb5/6P1/PQ2PPBP/1RB3K1 w - - 1 0",
            "solution": "1. Nf7+ Kg8 2. Nh6#"
        },
        {
            "fen": "7k/p1p2bp1/3q1N1p/4rP2/4pQ2/2P4R/P2r2PP/4R2K w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Qxh6#"
        },
        {
            "fen": "7k/2p3pp/p7/1p1p4/PP2pr2/B1P3qP/4N1B1/R1Qn2K1 b - - 0 1",
            "solution": "1... Rf1+ 2. Kxf1 Qf2#"
        },
        {
            "fen": "r1b2k2/1p1p1r1B/n4p2/p1qPp3/2P4N/4P1R1/PPQ3PP/R5K1 w - - 1 0",
            "solution": "1. Rg8+ Ke7 2. Nf5#"
        },
        {
            "fen": "8/8/2K2b2/2N2k2/1p4R1/1B3n1P/3r1P2/8 w - - 1 0",
            "solution": "1. Be6+ Ke5 2. Re4#"
        },
        {
            "fen": "5R2/R5pp/2b1p1k1/5n2/p1r2PK1/8/7P/8 b - - 0 1",
            "solution": "1... h5+ 2. Kh3 Rc3#"
        },
        {
            "fen": "8/3R3p/2b4k/p1p1B1p1/2n2PB1/3p1P2/P7/6K1 w - - 1 0",
            "solution": "1. Bg7+ Kg6 2. f5# *"
        },
        {
            "fen": "6k1/1p5p/3P3r/4p3/2N1PBpb/PPr5/3R1P1K/5b1R b - - 0 1",
            "solution": "1... Bxf2+ 2. Bxh6 Rh3#"
        },
        {
            "fen": "8/4n2k/b1Pp2p1/3Ppp1p/p2qP3/3B1P2/Q2NK1PP/3R4 b - - 0 1",
            "solution": "1... Bxd3+ 2. Ke1 Qe3#"
        },
        {
            "fen": "k2r4/ppRn2p1/6p1/1P3p2/3p1B2/6P1/P4PBP/4n1K1 w - - 1 0",
            "solution": "1. Bxb7+ Kb8 2. Rxd7#"
        },
        {
            "fen": "4rk2/1bq2p1Q/3p1bp1/1p1n2N1/4PB2/2Pp3P/1P1N4/5RK1 w - - 1 0",
            "solution": "1. Bxd6+ Qe7 2. Qxf7#"
        },
        {
            "fen": "8/R7/pp1b2kp/1b1B1p2/5P1P/5KP1/P7/8 w - - 1 0",
            "solution": "1. h5+ Kxh5 2. Bf7#"
        },
        {
            "fen": "2b3k1/6p1/p2bp2r/1p1p4/3Np1B1/1PP1PRq1/P1R3P1/3Q2K1 b - - 0 1",
            "solution": "1... Rh1+ 2. Kxh1 Qh2#"
        },
        {
            "fen": "6k1/p2p2p1/8/3np1N1/1P5R/3q2P1/5RKP/8 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Rf8#"
        },
        {
            "fen": "2r3k1/3b2b1/5pp1/3P4/pB2P3/2NnqN2/1P2B2Q/5K1R b - - 0 1",
            "solution": "1... Bh3+ 2. Qg2 Qf2#"
        },
        {
            "fen": "n3r1k1/Q4R1p/p5pb/1p2p1N1/1q2P3/1P4PB/2P3KP/8 w - - 1 0",
            "solution": "1. Rf8+ Qxf8 2. Qxh7#"
        },
        {
            "fen": "2r5/2k4p/1p2pp2/1P2qp2/8/Q5P1/4PP1P/R5K1 w - - 1 0",
            "solution": "1. Qe7+ Kb8 2. Qa7#"
        },
        {
            "fen": "6k1/4q1b1/p1p1p1Q1/1r4N1/4p3/1P5R/5P2/7K w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qh7#"
        },
        {
            "fen": "5rk1/pb2npp1/1pq4p/5p2/5B2/1B6/P2RQ1PP/2r1R2K b - - 0 1",
            "solution": "1... Qxg2+ 2. Qxg2 Rxe1#"
        },
        {
            "fen": "6k1/2R1Qpb1/3Bp1p1/1p2n2p/3q4/1P5P/2N2PPK/r7 b - - 0 1",
            "solution": "1... Qf4+ 2. g3 Qxf2#"
        },
        {
            "fen": "6k1/pp3p2/2p2np1/2P1pbqp/P3P3/2N2nP1/2Pr1P2/1RQ1RB1K b - - 0 1",
            "solution": "1... Qxg3 2. fxg3 Rh2#"
        },
        {
            "fen": "6k1/p2rR1p1/1p1r1p1R/3P4/4QPq1/1P6/P5PK/8 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Re8#"
        },
        {
            "fen": "7R/1bpkp3/p2pp3/3P4/4B1q1/2Q5/4NrP1/3K4 w - - 1 0",
            "solution": "1. Qc6+ Bxc6 2. dxc6#"
        },
        {
            "fen": "1r3r1k/qp5p/3N4/3p2Q1/p6P/P7/1b6/1KR3R1 w - - 1 0",
            "solution": "1. Qg8+ Rxg8 2. Nf7#"
        },
        {
            "fen": "r3k2r/p3bpp1/2q1p1b1/1ppPP1B1/3n3P/5NR1/PP2NP2/K1QR4 b kq - 0 1",
            "solution": "1... Nb3+ 2. axb3 Qa6#"
        },
        {
            "fen": "1r5k/3b3p/3p3b/2qPp3/Pnp4P/Q1N5/8/K5RR b - - 0 1",
            "solution": "1... Nc2+ 2. Ka2 Qxa3#"
        },
        {
            "fen": "1k1r4/pp5R/2p5/P5p1/7b/4Pq2/1PQ2P2/3NK3 b - - 0 1",
            "solution": "1... Rxd1+ 2. Qxd1 Qxf2#"
        },
        {
            "fen": "1r3k2/4R3/1p4Pp/p1pN1p2/2Pn1K2/1P6/1P6/8 w - - 1 0",
            "solution": "1. g7+ Kg8 2. Nf6#"
        },
        {
            "fen": "5bk1/R4p1p/6p1/8/3p2K1/1Q4P1/1P3P1q/2r5 b - - 0 1",
            "solution": "1... Qh5+ 2. Kf4 Qf5#"
        },
        {
            "fen": "3rr2k/pp1b2b1/4q1pp/2Pp1p2/3B4/1P2QNP1/P6P/R4RK1 w - - 1 0",
            "solution": "1. Qxh6+ Kg8 2. Qxg7#"
        },
        {
            "fen": "3r2k1/6pp/1nQ1R3/3r4/3N2q1/6N1/n4PPP/4R1K1 w - - 1 0",
            "solution": "1. Re8+ Kf7 2. R1e7#"
        },
        {
            "fen": "5bk1/6p1/5PQ1/pp4Pp/2p4P/P2r4/1PK5/8 w - - 1 0",
            "solution": "1. f7+ Kh8 2. Qxh5#"
        },
    ],
    "Мат в 3 хода": [
        {
            "fen": "r1b1kb1r/pppp1ppp/5q2/4n3/3KP3/2N3PN/PPP4P/R1BQ1B1R b kq - 0 1",
            "solution": "1... Bc5+ 2. Kxc5 Qb6+ 3. Kd5 Qd6#"
        },
        {
            "fen": "r3k2r/ppp2Npp/1b5n/4p2b/2B1P2q/BQP2P2/P5PP/RN5K w kq - 1 0",
            "solution": "1. Bb5+ c6 2. Qe6+ Qe7 3. Qxe7#"
        },
        {
            "fen": "r1b3kr/ppp1Bp1p/1b6/n2P4/2p3q1/2Q2N2/P4PPP/RN2R1K1 w - - 1 0",
            "solution": "1. Qxh8+ Kxh8 2. Bf6+ Kg8 3. Re8#"
        },
        {
            "fen": "r2n1rk1/1ppb2pp/1p1p4/3Ppq1n/2B3P1/2P4P/PP1N1P1K/R2Q1RN1 b - - 0 1",
            "solution": "1... Qxf2+ 2. Rxf2 Rxf2+ 3. Kh1 Ng3#"
        },
        {
            "fen": "3q1r1k/2p4p/1p1pBrp1/p2Pp3/2PnP3/5PP1/PP1Q2K1/5R1R w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Rh1+ Kg7 3. Qh6#"
        },
        {
            "fen": "6k1/ppp2ppp/8/2n2K1P/2P2P1P/2Bpr3/PP4r1/4RR2 b - - 0 1",
            "solution": "1... g6+ 2. hxg6 hxg6+ 3. Kf6 Nd7#"
        },
        {
            "fen": "rn3rk1/p5pp/2p5/3Ppb2/2q5/1Q6/PPPB2PP/R3K1NR b - - 0 1",
            "solution": "1... Qf1+ 2. Kxf1 Bd3+ 3. Ke1 Rf1#"
        },
        {
            "fen": "N1bk4/pp1p1Qpp/8/2b5/3n3q/8/PPP2RPP/RNB1rBK1 b - - 0 1",
            "solution": "1... Ne2+ 2. Kh1 Ng3+ 3. Kg1 Rxf1#"
        },
        {
            "fen": "8/2p3N1/6p1/5PB1/pp2Rn2/7k/P1p2K1P/3r4 w - - 1 0",
            "solution": "1. Re3+ Kxh2 2. Bxf4+ Kh1 3. Rh3#"
        },
        {
            "fen": "r1b1k1nr/p2p1ppp/n2B4/1p1NPN1P/6P1/3P1Q2/P1P1K3/q5b1 w - - 1 0",
            "solution": "1. Nxg7+ Kd8 2. Qf6+ Nxf6 3. Be7#"
        },
        {
            "fen": "1q2r3/k4p2/prQ2b1p/R7/1PP1B1p1/6P1/P5K1/8 w - - 1 0",
            "solution": "1. Rxa6+ Rxa6 2. Qd7+ Kb6 3. c5#"
        },
        {
            "fen": "r1bqr1k1/ppp2pp1/3p4/4n1NQ/2B1PN2/8/P4PPP/b4RK1 w - - 1 0",
            "solution": "1. Qxf7+ Nxf7 2. Bxf7+ Kf8 3. Ng6#"
        },
        {
            "fen": "3r4/pp5Q/B7/k7/3q4/2b5/P4PPP/1R4K1 w - - 1 0",
            "solution": "1. Rb5+ Ka4 2. Qc2+ Ka3 3. Qb3#"
        },
        {
            "fen": "rnbk1b1r/ppqpnQ1p/4p1p1/2p1N1B1/4N3/8/PPP2PPP/R3KB1R w - - 1 0",
            "solution": "1. Qe8+ Kxe8 2. Nf6+ Kd8 3. Nf7#"
        },
        {
            "fen": "3rnr1k/p1q1b1pB/1pb1p2p/2p1P3/2P2N2/PP4P1/1BQ4P/4RRK1 w - - 1 0",
            "solution": "1. Ng6+ Kxh7 2. Nxf8+ Kg8 3. Qh7#"
        },
        {
            "fen": "8/Qp4pk/2p3b1/5p1p/3B3P/1P4P1/P1P1rnBK/3r4 b - - 0 1",
            "solution": "1... Ng4+ 2. Kh3 Rh1+ 3. Bxh1 Rh2#"
        },
        {
            "fen": "k7/1p1rr1pp/pR1p1p2/Q1pq4/P7/8/2P3PP/1R4K1 w - - 1 0",
            "solution": "1. Rxa6+ bxa6 2. Qxa6+ Ra7 3. Qc8#"
        },
        {
            "fen": "3r1rk1/p1p4p/8/1PP1p1bq/2P5/3N1Pp1/PB2Q3/1R3RK1 b - - 0 1",
            "solution": "1... Be3+ 2. Rf2 Qh2+ 3. Kf1 Qh1#"
        },
        {
            "fen": "Q4R2/3kr3/1q3n1p/2p1p1p1/1p1bP1P1/1B1P3P/2PBK3/8 w - - 1 0",
            "solution": "1. Qc8+ Kd6 2. Rxf6+ Re6 3. Rxe6#"
        },
        {
            "fen": "2rrk3/QR3pp1/2n1b2p/1BB1q3/3P4/8/P4PPP/6K1 w - - 1 0",
            "solution": "1. Re7+ Kf8 2. Re8+ Kxe8 3. Qe7#"
        },
        {
            "fen": "7k/pbp3bp/3p4/1p5q/3n2p1/5rB1/PP1NrN1P/1Q1BRRK1 b - - 0 1",
            "solution": "1... Rxg3+ 2. hxg3 Qh1+ 3. Nxh1 Rg2#"
        },
        {
            "fen": "3r4/pR2N3/2pkb3/5p2/8/2B5/qP3PPP/4R1K1 w - - 1 0",
            "solution": "1. Be5+ Kc5 2. Rc1+ Bc4 3. b4#"
        },
        {
            "fen": "5qrk/p3b1rp/4P2Q/5P2/1pp5/5PR1/P6P/B6K w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Bh4 3. Rxh4#"
        },
        {
            "fen": "r1nk3r/2b2ppp/p3bq2/3pN3/Q2P4/B1NB4/P4PPP/4R1K1 w - - 1 0",
            "solution": "1. Nc6+ Kd7 2. Na5+ Kd8 3. Nb7#"
        },
        {
            "fen": "r1n5/pp2q1kp/2ppr1p1/4p1Q1/8/2N4R/PPP3PP/5RK1 w - - 1 0",
            "solution": "1. Qh6+ Kg8 2. Rf8+ Qxf8 3. Qxh7#"
        },
        {
            "fen": "2bn1rk1/5q2/2p3N1/2PpB1p1/1P4p1/4P3/2Q3K1/R7 w - - 1 0",
            "solution": "1. Ne7+ Qxe7 2. Qg6+ Qg7 3. Qxg7#"
        },
        {
            "fen": "rnb1k2r/ppppbN1p/5n2/7Q/4P3/2N5/PPPP3P/R1B1KB1q w - - 1 0",
            "solution": "1. Nd6+ Kd8 2. Qe8+ Nxe8 3. Nf7#"
        },
        {
            "fen": "r1bq3r/ppp1nQ2/2kp1N2/6N1/3bP3/8/P2n1PPP/1R3RK1 w - - 1 0",
            "solution": "1. Rfc1+ Bc5 2. Qd5+ Nxd5 3. exd5#"
        },
        {
            "fen": "r1bq1k1r/pp2R1pp/2pp1p2/1n1N4/8/3P1Q2/PPP2PPP/R1B3K1 w - - 1 0",
            "solution": "1. Qxf6+ gxf6 2. Bh6+ Kg8 3. Nxf6#"
        },
        {
            "fen": "1r4r1/5Q2/3q4/3pk3/4p1p1/6P1/PP4BP/4RR1K w - - 1 0",
            "solution": "1. Rd1 Rg5 2. Rxd5+ Qxd5 3. Qf6#"
        },
        {
            "fen": "r5kr/pppN1pp1/1bn1R3/1q1N2Bp/3p2Q1/8/PPP2PPP/R5K1 w - - 1 0",
            "solution": "1. N5f6+ gxf6 2. Bh6+ hxg4 3. Nxf6#"
        },
        {
            "fen": "r1bq1r1k/pp2n1pp/8/3N1p2/2B4R/8/PPP2QPP/7K w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh4+ Kg6 3. Nf4#"
        },
        {
            "fen": "2b3rk/1q3p1p/p1p1pPpQ/4N3/2pP4/2P1p1P1/1P4PK/5R2 w - - 1 0",
            "solution": "1. Rh1 e2 2. Qxh7+ Kxh7 3. Kg1#"
        },
        {
            "fen": "1r4kr/Q1bRBppp/2b5/8/2B1q3/6P1/P4P1P/5RK1 w - - 1 0",
            "solution": "1. Qxb8+ Bxb8 2. Rd8+ Be8 3. Rxe8#"
        },
        {
            "fen": "rk1q3r/pp1Qbp1p/4pp2/8/4N3/6P1/PP3PBP/2R3K1 w - - 1 0",
            "solution": "1. Nxf6 Qb6 2. Qe8+ Rxe8 3. Nd7#"
        },
        {
            "fen": "2r1b3/1pp1qrk1/p1n1P1p1/7R/2B1p3/4Q1P1/PP3PP1/3R2K1 w - - 1 0",
            "solution": "1. Qh6+ Kf6 2. Rf5+ Kxf5 3. Qf4#"
        },
        {
            "fen": "1qk1r2r/Qp4pp/1Rp5/4Nb2/2PPp3/8/P1P2PPP/1R4K1 w - - 1 0",
            "solution": "1. Rxc6+ Kd8 2. Qxb8+ Ke7 3. Qd6#"
        },
        {
            "fen": "8/p1p5/2p3k1/2b1rpB1/7K/2P3PP/P1P2r2/3R3R b - - 0 1",
            "solution": "1... Rf4+ 2. Bxf4 Be7+ 3. Bg5 Bxg5#"
        },
        {
            "fen": "2r5/2p2k1p/pqp1RB2/2r5/PbQ2N2/1P3PP1/2P3P1/4R2K w - - 1 0",
            "solution": "1. Re7+ Kxf6 2. Qe6+ Kg5 3. Rg7#"
        },
        {
            "fen": "r1b1kb1r/pp2nppp/2pQ4/8/2q1P3/8/P1PB1PPP/3RK2R w - - 1 0",
            "solution": "1. Qd8+ Kxd8 2. Ba5+ Ke8 3. Rd8#"
        },
        {
            "fen": "r1bk2nr/ppp2ppp/3p4/bQ3q2/3p4/B1P5/P3BPPP/RN1KR3 w - - 1 0",
            "solution": "1. Qe8+ Kxe8 2. Bb5+ Kd8 3. Re8#"
        },
        {
            "fen": "3r4/1nb1kp2/p1p2N2/1p2pPr1/8/1BP2P2/PP1R4/2KR4 w - - 1 0",
            "solution": "1. Rd7+ Rxd7 2. Rxd7+ Kxf6 3. Rxf7#"
        },
        {
            "fen": "rn4nr/pppq2bk/7p/5b1P/4NBQ1/3B4/PPP3P1/R3K2R w - - 1 0",
            "solution": "1. Qg6+ Bxg6 2. Ng5+ hxg5 3. hxg6#"
        },
        {
            "fen": "rr3k2/pppq1pN1/1b1p1BnQ/1b2p1N1/4P3/2PP3P/PP3PP1/R4RK1 w - - 1 0",
            "solution": "1. N7e6+ Ke8 2. Qf8+ Nxf8 3. Ng7#"
        },
        {
            "fen": "r4k1r/2pQ1pp1/p4q1p/2N3N1/1p3P2/8/PP3PPP/4R1K1 w - - 1 0",
            "solution": "1. Qe8+ Rxe8 2. Nd7+ Kg8 3. Rxe8#"
        },
        {
            "fen": "r2qkbnr/pppb2pp/5pn1/3Pp3/4Q3/2PBBN2/PP4PP/RN2K2R w - - 1 0",
            "solution": "1. Qxg6+ hxg6 2. Bxg6+ Ke7 3. Bc5#"
        },
        {
            "fen": "r5r1/p1q2p1k/1p1R2pB/3pP3/6bQ/2p5/P1P1NPPP/6K1 w - - 1 0",
            "solution": "1. Bf8+ Bh5 2. Qxh5+ gxh5 3. Rh6#"
        },
        {
            "fen": "r2qkbnr/pppb2pp/5pn1/3Pp3/4Q3/2PBBN2/PP4PP/RN2K2R w KQkq - 1 0",
            "solution": "1. Qxg6+ hxg6 2. Bxg6+ Ke7 3. Bc5#"
        },
        {
            "fen": "6rk/p1q2p2/2p1rb1P/1p2pN2/4P1Q1/2PP4/PPB5/2K4R w - - 1 0",
            "solution": "1. Qg7+ Rxg7 2. hxg7+ Kg8 3. Rh8#"
        },
        {
            "fen": "r3nrkq/pp3p1p/2p3nQ/5NN1/8/3BP3/PPP3PP/2KR4 w - - 1 0",
            "solution": "1. Ne7+ Nxe7 2. Bxh7+ Qxh7 3. Qxh7#"
        },
        {
            "fen": "rnb1kb1r/pp3ppp/2p5/4q3/4n3/3Q4/PPPB1PPP/2KR1BNR w - - 1 0",
            "solution": "1. Qd8+ Kxd8 2. Bg5+ Kc7 3. Bd8#"
        },
        {
            "fen": "4k3/r2bnn1r/1q2pR1p/p2pPp1B/2pP1N1P/PpP1B3/1P4Q1/5KR1 w - - 1 0",
            "solution": "1. Qg8+ Nxg8 2. Rxg8+ Ke7 3. Ng6#"
        },
        {
            "fen": "8/p3Q2p/6pk/1N6/4nP2/7P/P5PK/3rr3 w - - 1 0",
            "solution": "1. Qf8+ Kh5 2. g4+ Kh4 3. Qh6#"
        },
        {
            "fen": "6rb/1p2k3/p2p1nQ1/q1p1p2r/B1P1P3/2N4P/PP4P1/1R3RK1 w - - 1 0",
            "solution": "1. Nd5+ Kd8 2. Qxg8+ Nxg8 3. Rf8#"
        },
        {
            "fen": "1k1r4/3b1p2/QP1b3p/1p1p4/3P2pN/1R4P1/KPPq1PP1/4r2R w - - 1 0",
            "solution": "1. Qa7+ Kc8 2. Qa8+ Bb8 3. Qa6#"
        },
        {
            "fen": "r3q2k/1bn2p2/p4P1p/1pPp2R1/3P4/P1N1Q3/1PB3PP/6K1 w - - 1 0",
            "solution": "1. Rg8+ Kxg8 2. Qg3+ Kh8 3. Qg7#"
        },
        {
            "fen": "r1b2r2/pp3Npk/6np/8/2q1N3/4Q3/PPP2RPP/6K1 w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Qxh6+ Kg8 3. Qxg6#"
        },
        {
            "fen": "r3k2r/pbp2pp1/3b1n2/1p6/3P3p/1B2N1Pq/PP1PQP1P/R1B1NRK1 b kq - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 hxg3+ 3. Kg1 Rh1#"
        },
        {
            "fen": "r1b2k1r/1p1p1pp1/p2P4/4N1Bp/3p4/8/PPB2P2/2K1R3 w - - 1 0",
            "solution": "1. Ng6+ fxg6 2. Bxg6 h4 3. Re8#"
        },
        {
            "fen": "2r3k1/6pp/p2p4/1p6/1p2P3/1PNK1bQ1/1BP3qP/R7 b - - 0 1",
            "solution": "1... Rxc3+ 2. Bxc3 Qe2+ 3. Kd4 Qxe4#"
        },
        {
            "fen": "r1b5/kpQ4p/p1q5/2P5/3B4/8/P4PPP/R5K1 w - - 1 0",
            "solution": "1. Qb6+ Qxb6 2. cxb6+ Kb8 3. Be5#"
        },
        {
            "fen": "4rk2/2pQ1p2/2p2B2/2P1P2q/1b4R1/1P6/r5PP/2R3K1 w - - 1 0",
            "solution": "1. Bg7+ Kg8 2. Qxe8+ Kh7 3. Qh8#"
        },
        {
            "fen": "4R3/1p4rk/6p1/2pQBpP1/p1P1pP2/Pq6/1P6/K7 w - - 1 0",
            "solution": "1. Qd7 Qxa3+ 2. bxa3 Rxd7 3. Rh8#"
        },
        {
            "fen": "1rbk1r2/pp4R1/3Np3/3p2p1/6q1/BP2P3/P2P2B1/2R3K1 w - - 1 0",
            "solution": "1. Rxc8+ Rxc8 2. Nxb7+ Ke8 3. Re7#"
        },
        {
            "fen": "rn2kb1r/pp2pp1p/2p2p2/8/8/3Q1N2/qPPB1PPP/2KR3R w - - 1 0",
            "solution": "1. Qd8+ Kxd8 2. Ba5+ Kc8 3. Rd8#"
        },
        {
            "fen": "bn5k/7p/p2p2r1/1p2p3/5p2/2P4q/PP1B1QPP/4N1RK b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Rh6+ 3. Qh4 Rxh4#"
        },
        {
            "fen": "r1bqkb1r/ppp1n3/3p1nNp/4pp1Q/2B1P3/3P4/PPP2PPP/R1B2RK1 w - - 1 0",
            "solution": "1. Nxe5+ Ng6 2. Qxg6+ Ke7 3. Qf7#"
        },
        {
            "fen": "4r1k1/3n1ppp/4r3/3n3q/Q2P4/5P2/PP2BP1P/R1B1R1K1 b - - 0 1",
            "solution": "1... Rg6+ 2. Kh1 Qxf3+ 3. Bxf3 Rxe1#"
        },
        {
            "fen": "4Rnk1/pr3ppp/1p3q2/5NQ1/2p5/8/P4PPP/6K1 w - - 1 0",
            "solution": "1. Nh6+ Qxh6 2. Rxf8+ Kxf8 3. Qd8#"
        },
        {
            "fen": "1r2r1k1/4bpp1/b1q1pBn1/p2pP1Q1/2pP2N1/P1P4R/5PP1/1N3RK1 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qh6+ Kg8 3. Qxg7#"
        },
        {
            "fen": "r5rk/2b2p1p/1pppq3/5Np1/p1n4Q/P4R2/1PB3PP/4R1K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Qh6 3. Rxh6#"
        },
        {
            "fen": "r1b1k1nr/p5bp/p1pBq1p1/3pP1P1/N4Q2/8/PPP1N2P/R4RK1 w - - 1 0",
            "solution": "1. Qf8+ Bxf8 2. Rxf8+ Kd7 3. Nc5#"
        },
        {
            "fen": "6r1/6rk/pq1P4/1p2p1pB/2p1P2Q/2P3RP/PP4PK/8 w - - 1 0",
            "solution": "1. Bg6+ Kxg6 2. Qxg5+ Kf7 3. Qe7#"
        },
        {
            "fen": "b2rB3/p7/1n2kp2/2b2N1Q/2p1rP2/2P5/P5PP/5R1K w - - 1 0",
            "solution": "1. Qf7+ Kxf5 2. g4+ Kxg4 3. Qh5#"
        },
        {
            "fen": "5kqQ/1b1r2p1/ppn1p1Bp/2b5/2P2rP1/P4N2/1B5P/4RR1K w - - 1 0",
            "solution": "1. Rxe6 Re7 2. Bxg7+ Rxg7 3. Re8#"
        },
        {
            "fen": "5rk1/n1p1R1bp/p2p4/1qpP1QB1/7P/2P3P1/PP3P2/6K1 w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Bh6+ Kxh6 3. Qg5#"
        },
        {
            "fen": "r2q4/p2nR1bk/1p1Pb2p/4p2p/3nN3/B2B3P/PP1Q2P1/6K1 w - - 1 0",
            "solution": "1. Nf6+ Kh8 2. Qxh6+ Bxh6 3. Rh7#"
        },
        {
            "fen": "6k1/2b3r1/8/6pR/2p3N1/2PbP1PP/1PB2R1K/2r5 w - - 1 0",
            "solution": "1. Nh6+ Kh8 2. Nf7+ Kg8 3. Rh8#"
        },
        {
            "fen": "r5n1/ppp1q3/2bp2kp/5rP1/3Qp3/2N5/PPP1B3/2KR3R w - - 1 0",
            "solution": "1. Bh5+ Kxg5 2. Rdg1+ Kf4 3. Ne2#"
        },
        {
            "fen": "5b2/pp2r1pk/2pp1R1p/4rP1N/2P1P3/1P4Q1/P3q1PP/5R1K w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Nf6+ Kh8 3. Qg8#"
        },
        {
            "fen": "qn1r1k2/2r1b1np/pp1pQ1p1/3P2P1/1PP2P2/7R/PB4BP/4R1K1 w - - 1 0",
            "solution": "1. Rxh7 Nxe6 2. Rh8+ Kf7 3. dxe6#"
        },
        {
            "fen": "6k1/pp3r2/2p4q/3p2p1/3Pp1b1/4P1P1/PP4RP/2Q1RrNK b - - 0 1",
            "solution": "1... Qxh2+ 2. Rxh2 Bf3+ 3. Rg2 Rh7#"
        },
        {
            "fen": "1k5r/pP3ppp/3p2b1/1BN1n3/1Q2P3/P1B5/KP3P1P/7q w - - 1 0",
            "solution": "1. Na6+ Kxb7 2. Bd7+ Kxa6 3. Qb5#"
        },
        {
            "fen": "r1qr2k1/2p3b1/1p2P2R/2pPp3/2P3PQ/pPN5/P1B3K1/8 w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Qh7+ Kf8 3. Qf7#"
        },
        {
            "fen": "2r3k1/p4p2/3Rp2p/1p2P1pK/8/1P4P1/P3Q2P/1q6 b - - 0 1",
            "solution": "1... Qg6+ 2. Kg4 Qf5+ 3. Kh5 Qh3#"
        },
        {
            "fen": "r1b1r1kq/pppnpp1p/1n4pB/8/4N2P/1BP5/PP2QPP1/R3K2R w - - 1 0",
            "solution": "1. Bxf7+ Kxf7 2. Ng5+ Kg8 3. Qe6#"
        },
        {
            "fen": "R3Q3/5r1k/4p3/3p2n1/1P1P2p1/2P1p1Pq/3N3P/6K1 b - - 0 1",
            "solution": "1... Rf1+ 2. Nxf1 Nf3+ 3. Kh1 Qxf1#"
        },
        {
            "fen": "r1b1rk2/pp1nbNpB/2p1p2p/q2nB3/3P3P/2N1P3/PPQ2PP1/2KR3R w - - 1 0",
            "solution": "1. Bxg7+ Kxg7 2. Qg6+ Kf8 3. Qg8#"
        },
        {
            "fen": "rnbq1b1r/pp4kp/5np1/4p2Q/2BN1R2/4B3/PPPN2PP/R5K1 w - - 1 0",
            "solution": "1. Qh6+ Kxh6 2. Rh4+ Kg7 3. Bh6#"
        },
        {
            "fen": "2r1b2k/pp2P1p1/6Pn/2p1P1N1/2P5/8/PP6/5RK1 w - - 1 0",
            "solution": "1. Rf8+ Ng8 2. Rxe8 Rxe8 3. Nf7#"
        },
        {
            "fen": "r3r2k/4b2B/pn3p2/q1p4R/6b1/4P3/PPQ1NPPP/5RK1 w - - 1 0",
            "solution": "1. Bg8+ Kxg8 2. Qg6+ Kf8 3. Rh8#"
        },
        {
            "fen": "4N1nk/p5R1/4b2p/3pPp1Q/2pB1P1K/2P3PP/7r/2q5 w - - 1 0",
            "solution": "1. Rxg8+ Bxg8 2. Qxh6+ Bh7 3. Qg7#"
        },
        {
            "fen": "7R/5rp1/2p1r1k1/2q5/4pP1Q/4P3/5PK1/7R w - - 1 0",
            "solution": "1. Rh6+ gxh6 2. Qxh6+ Kf5 3. Qg5#"
        },
        {
            "fen": "1k1r2r1/ppq4p/4Q3/1B2np2/2P1p3/P7/2P1RPPR/2B1K3 b - - 0 1",
            "solution": "1... Nf3+ 2. Kf1 Rd1+ 3. Re1 Rxe1#"
        },
        {
            "fen": "5r1k/2p1b1pp/pq1pB3/8/2Q1P3/5pP1/RP3n1P/1R4K1 b - - 0 1",
            "solution": "1... Nh3+ 2. Kh1 Qg1+ 3. Rxg1 Nf2#"
        },
        {
            "fen": "r4r1k/p5Rp/1p3pb1/2P4N/2B5/P7/6PP/B2n2K1 w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Bxf6+ Rg7 3. Bxg7#"
        },
        {
            "fen": "r6r/pp1Q2pp/2p4k/4R3/5P2/2q5/P1P3PP/R5K1 w - - 1 0",
            "solution": "1. Rh5+ Kxh5 2. Qf5+ Kh6 3. Qg5#"
        },
        {
            "fen": "4r1k1/5bpp/2p5/3pr3/8/1B3pPq/PPR2P2/2R2QK1 b - - 0 1",
            "solution": "1... Re1 2. Rxe1 Rxe1 3. Qxe1 Qg2#"
        },
        {
            "fen": "8/4k1p1/2p5/2NpK2p/1P3P2/2P3PP/3n4/8 b - - 0 1",
            "solution": "1... Nf3+ 2. Kf5 Kf7 3. Ne6 g6#"
        },
        {
            "fen": "r3br1k/pp5p/4B1p1/4NpP1/P2Pn3/q1PQ3R/7P/3R2K1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh3+ Kg7 3. Qh6#"
        },
        {
            "fen": "kb5r/1p6/8/p3qQ2/4P3/6P1/P6P/5R1K b - - 0 1",
            "solution": "1... Rxh2+ 2. Kxh2 Qxg3+ 3. Kh1 Qh2#"
        },
        {
            "fen": "6k1/pp1q1ppp/2p5/3n4/Q2P4/PPr4P/3NnBPK/5R2 b - - 0 1",
            "solution": "1... Rxh3+ 2. gxh3 Ndf4 3. Qxa7 Qxh3#"
        },
        {
            "fen": "5rk1/2pb1ppp/p2r4/1p1Pp3/4Pn1q/1B1PNP2/PP1Q1P1P/R5RK b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Rh6+ 3. Kg3 Rh3#"
        },
        {
            "fen": "8/4R1pk/p5p1/8/1pB1n1b1/1P2b1P1/P4r1P/5R1K b - - 0 1",
            "solution": "1... Bf3+ 2. Kg1 Rg2+ 3. Kh1 Rg1#"
        },
        {
            "fen": "R6R/1r3pp1/4p1kp/3pP3/1r2qPP1/7P/1P1Q3K/8 w - - 1 0",
            "solution": "1. f5+ exf5 2. Qxh6+ gxh6 3. Rag8#"
        },
        {
            "fen": "r3kr2/6Qp/1Pb2p2/pB3R2/3pq2B/4n3/1P4PP/4R1K1 w - - 1 0",
            "solution": "1. Re5+ Qxe5 2. Bxc6+ Kd8 3. Qd7#"
        },
        {
            "fen": "6rk/5p2/2p1p2p/2PpP1q1/3PnQn1/8/4P2P/1N2BR1K b - - 0 1",
            "solution": "1... Ngf2+ 2. Qxf2 Nxf2+ 3. Bxf2 Qg2#"
        },
        {
            "fen": "4r1k1/1p3q1p/p1pQ4/2P1R1p1/5n2/2B5/PP5P/6K1 b - - 0 1",
            "solution": "1... Nh3+ 2. Kg2 Qf2+ 3. Kxh3 Qf3#"
        },
        {
            "fen": "5qr1/pr3p1k/1n1p2p1/2pPpP1p/P3P2Q/2P1BP1R/7P/6RK w - - 1 0",
            "solution": "1. Qxh5+ gxh5 2. Rxh5+ Qh6 3. Rxh6#"
        },
        {
            "fen": "1r1b1n2/1pk3p1/4P2p/3pP3/3N4/1p2B3/6PP/R5K1 w - - 1 0",
            "solution": "1. Nb5+ Kc6 2. Na7+ Kc7 3. Rc1#"
        },
        {
            "fen": "2r1r1k1/p2n1p1p/5pp1/qQ1P1b2/N7/5N2/PP3RPP/3K1B1R b - - 0 1",
            "solution": "1... Rc1+ 2. Kxc1 Re1+ 3. Nxe1 Qxe1#"
        },
        {
            "fen": "r3nrk1/1p1b2pp/3p2n1/3PpNP1/3Q4/1q5P/3N1R2/1B3RK1 w - - 1 0",
            "solution": "1. Ne7+ Kh8 2. Rxf8+ Nxf8 3. Rxf8#"
        },
        {
            "fen": "r5rk/ppq2p2/2pb1P1B/3n4/3P4/2PB3P/PP1QNP2/1K6 w - - 1 0",
            "solution": "1. Bg7+ Rxg7 2. Qh6+ Rh7 3. Qxh7#"
        },
        {
            "fen": "7k/5p2/2b2p1B/1pn1p2p/4P3/q1P2PPB/3Q1K1P/8 w - - 1 0",
            "solution": "1. Qd8+ Kh7 2. Bf5+ Kxh6 3. Qxf6#"
        },
        {
            "fen": "2Q1N1k1/5p2/1b2p2p/3bN1p1/nq4P1/6BP/5P2/6K1 w - - 1 0",
            "solution": "1. Nf6+ Kg7 2. Qg8+ Kxf6 3. Qxf7#"
        },
        {
            "fen": "7r/6kr/p5p1/1pNb1pq1/PPpPp3/4P1b1/R3R1Q1/2B2BK1 b - - 0 1",
            "solution": "1... Rh1+ 2. Qxh1 Bh2+ 3. Kf2 Qg3#"
        },
        {
            "fen": "3r1rk1/2qP1p2/p2R2pp/6b1/6P1/2pQR2P/P1B2P2/6K1 w - - 1 0",
            "solution": "1. Rxg6+ Kh8 2. Rxh6+ Bxh6 3. Qh7#"
        },
        {
            "fen": "r3q1rk/1pp3pb/pb5Q/3pB3/3P4/2P2N1P/PP1N2P1/7K w - - 1 0",
            "solution": "1. Ng5 Qg6 2. Qxh7+ Qxh7 3. Nf7#"
        },
        {
            "fen": "6qk/4rRn1/1p3NQp/p3P3/8/1P2b2P/PB4PK/3r4 w - - 1 0",
            "solution": "1. Qh7+ Qxh7 2. Rf8+ Qg8 3. Rxg8#"
        },
        {
            "fen": "3rk3/1b4BR/3p2p1/3P4/1r4n1/1P6/6BP/5RK1 w - - 1 0",
            "solution": "1. Rf8+ Kd7 2. Bf6+ Kc8 3. Rxd8#"
        },
        {
            "fen": "r5k1/1b1r1p1p/ppq1nBpQ/2p1P3/5p2/2PB2R1/P1P3PP/R5K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Kg8 3. Rh8#"
        },
        {
            "fen": "6k1/5p1p/2Q1p1p1/5n1r/N7/1B3P1P/1PP3PK/4q3 b - - 0 1",
            "solution": "1... Rxh3+ 2. gxh3 Qf2+ 3. Kh1 Ng3#"
        },
        {
            "fen": "2k4r/pp3pQ1/2q5/2n5/8/N3pPP1/P3r3/R1R3K1 b - - 0 1",
            "solution": "1... Rh1+ 2. Kxh1 Qxf3+ 3. Kg1 Qg2#"
        },
        {
            "fen": "2b2rk1/2q2pp1/1p1R3p/8/1PBQ4/7P/5PP1/6K1 w - - 1 0",
            "solution": "1. Rg6 Qe5 2. Qxe5 Be6 3. Qxg7#"
        },
        {
            "fen": "4r1k1/pR3pp1/1n3P1p/q2p4/5N1P/P1rQpP2/8/2B2RK1 w - - 1 0",
            "solution": "1. Qg6 fxg6 2. Rxg7+ Kf8 3. Nxg6#"
        },
        {
            "fen": "3rkb1r/ppn2pp1/1qp1p2p/4P3/2P4P/3Q2N1/PP1B1PP1/1K1R3R w - - 1 0",
            "solution": "1. Qxd8+ Kxd8 2. Bg5+ Ke8 3. Rd8#"
        },
        {
            "fen": "2r3k1/1p1r1p1p/pnb1pB2/5p2/1bP5/1P2QP2/P1B3PP/4RK2 w - - 1 0",
            "solution": "1. Qh6 Bf8 2. Qg5+ Bg7 3. Qxg7#"
        },
        {
            "fen": "5Q2/6r1/6pp/7k/2pq1P2/P5RP/1P4PK/8 w - - 1 0",
            "solution": "1. Rg5+ hxg5 2. Qh8+ Rh7 3. Qxh7#"
        },
        {
            "fen": "2bqQ3/p2n1pk1/2p2b2/6p1/P1PP2P1/1P3R2/6K1/7R w - - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Qxf7+ Bg7 3. Rh3#"
        },
        {
            "fen": "3Q3R/4rqp1/6k1/p3Pp1p/Pp3P1P/1Pp4K/2P5/8 w - - 1 0",
            "solution": "1. Qd1 Rxe5 2. fxe5 Qe6 3. Qxh5#"
        },
        {
            "fen": "6k1/5pp1/1pq4p/p3P3/P4P2/2P1Q1PK/7P/R1Br3r b - - 0 1",
            "solution": "1... Rxh2+ 2. Kg4 h5+ 3. Kg5 Qg6#"
        },
        {
            "fen": "rq2r1k1/1b3pp1/p3p1n1/1p4BQ/8/7R/PP3PPP/4R1K1 w - - 1 0",
            "solution": "1. Qh7+ Kf8 2. Qh8+ Nxh8 3. Rxh8#"
        },
        {
            "fen": "r3kb1r/1b1n2pp/pq1pN3/1p1Q2B1/4P3/8/PPP2PPP/R4RK1 w kq - 1 0",
            "solution": "1. Nc7+ Qxc7 2. Qe6+ Be7 3. Qxe7#"
        },
        {
            "fen": "5rk1/ppR2p1p/q2p2pB/P2pb3/1P1n2P1/5Q1P/6B1/7K w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Rc8+ Rf8 3. Rxf8#"
        },
        {
            "fen": "4r3/2p5/2p1q1kp/p1r1p1pN/P5P1/1P3P2/4Q3/3RB1K1 w - - 1 0",
            "solution": "1. Qe4+ Kf7 2. Qh7+ Kf8 3. Qg7#"
        },
        {
            "fen": "1k1r4/1b1p2pp/PQ2p3/nN6/P3P3/8/6PP/2q2BK1 w - - 1 0",
            "solution": "1. Qa7+ Kc8 2. axb7+ Nxb7 3. Qa8#"
        },
        {
            "fen": "5r2/pp2R3/1q1p3Q/2pP1b2/2Pkrp2/3B4/PPK2PP1/R7 w - - 1 0",
            "solution": "1. Rxe4+ Bxe4 2. Qg7+ Rf6 3. Qxf6#"
        },
        {
            "fen": "8/6pB/7p/2p4k/3b4/1P3RP1/r4PKP/8 w - - 1 0",
            "solution": "1. Rf5+ g5 2. Kh3 Rxf2 3. g4#"
        },
        {
            "fen": "5qr1/kp2R3/5p2/1b1N1p2/5Q2/P5P1/6BP/6K1 w - - 1 0",
            "solution": "1. Rxb7+ Kxb7 2. Qc7+ Ka8 3. Nb6#"
        },
        {
            "fen": "7r/1qr1nNp1/p1k4p/1pB5/4P1Q1/8/PP3PPP/6K1 w - - 1 0",
            "solution": "1. Qe6+ Kxc5 2. Qd6+ Kc4 3. Ne5#"
        },
        {
            "fen": "2r2qk1/r4p1p/b3pBpQ/n3P2P/p2p3R/P5P1/2p2PB1/R5K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. hxg6+ Kxg6 3. Be4#"
        },
        {
            "fen": "b2k3r/1q4p1/p2p4/1p1N1Q2/4P3/P7/1PR4P/1K6 w - - 1 0",
            "solution": "1. Qg5+ Ke8 2. Rc8+ Qxc8 3. Qe7#"
        },
        {
            "fen": "4r1k1/5ppp/p2p4/4r3/1pNn4/1P6/1PPK2PP/R3R3 b - - 0 1",
            "solution": "1... Nf3+ 2. gxf3 Rd5+ 3. Kc1 Rxe1#"
        },
        {
            "fen": "k2r3r/p3Rppp/1p4q1/1P1b4/3Q1B2/6N1/PP3PPP/6K1 w - - 1 0",
            "solution": "1. Rxa7+ Kxa7 2. Qa4+ Kb7 3. Qa6#"
        },
        {
            "fen": "r1b5/5p2/5Npk/p1pP2q1/4P2p/1PQ2R1P/6P1/6K1 w - - 1 0",
            "solution": "1. Ng8+ Kh7 2. Rxf7+ Kxg8 3. Qg7#"
        },
        {
            "fen": "r1b2rk1/1p3pb1/2p3p1/p1B5/P3N3/1B1Q1Pn1/1PP3q1/2KR3R w - - 1 0",
            "solution": "1. Nf6+ Bxf6 2. Qxg6+ Bg7 3. Qh7#"
        },
        {
            "fen": "r1bq1rk1/p3b1np/1pp2ppQ/3nB3/3P4/2NB1N1P/PP3PP1/3R1RK1 w - - 1 0",
            "solution": "1. Ng5 Re8 2. Qxh7+ Kf8 3. Qh8#"
        },
        {
            "fen": "rk5r/2p3pp/p1p5/4N3/4P3/2q4P/P4PP1/R2Q2K1 w - - 1 0",
            "solution": "1. Rb1+ Ka7 2. Qd4+ Qxd4 3. Nxc6#"
        },
        {
            "fen": "r3kb1r/1b4p1/pq2pn1p/1N2p3/8/3B2Q1/PPP2PPP/2KRR3 w kq - 1 0",
            "solution": "1. Bg6+ Ke7 2. Qa3+ Qd6 3. Qxd6#"
        },
        {
            "fen": "4rk2/5p1b/1p3R1K/p6p/2P2P2/1P6/2q4P/Q5R1 w - - 1 0",
            "solution": "1. Rxf7+ Kxf7 2. Rg7+ Ke6 3. Qe5#"
        },
        {
            "fen": "8/6pk/pb5p/8/1P2qP2/P3p3/2r2PNP/1QR3K1 b - - 0 1",
            "solution": "1... exf2+ 2. Kh1 f1=Q+ 3. Rxf1 Qxg2#"
        },
        {
            "fen": "2bkr3/5Q1R/p2pp1N1/1p6/8/2q3P1/P4P1K/8 w - - 1 0",
            "solution": "1. Ne5 dxe5 2. Qf6+ Re7 3. Qxe7#"
        },
        {
            "fen": "r1b2nrk/1p3p1p/p2p1P2/5P2/2q1P2Q/8/PpP5/1K1R3R w - - 1 0",
            "solution": "1. Qxh7+ Nxh7 2. Rxh7+ Kxh7 3. Rh1#"
        },
        {
            "fen": "2r5/1Nr1kpRp/p3b3/N3p3/1P3n2/P7/5PPP/K6R b - - 0 1",
            "solution": "1... Rc1+ 2. Rxc1 Rxc1+ 3. Kb2 Nd3#"
        },
        {
            "fen": "r5k1/2p2ppp/p1P2n2/8/1pP2bbQ/1B3PP1/PP1Pq2P/RNB3K1 b - - 0 1",
            "solution": "1... Qe1+ 2. Kg2 Bxf3+ 3. Kxf3 Qf1#"
        },
        {
            "fen": "1k6/b2q1r2/p2PQ1p1/4Bp1p/3P3P/6PK/6B1/8 w - - 1 0",
            "solution": "1. Qe8+ Qxe8 2. d7+ Qxe5 3. d8=Q#"
        },
        {
            "fen": "3rn2r/3kb2p/p4ppB/1q1Pp3/8/3P1N2/1P2Q1PP/R1R4K w - - 1 0",
            "solution": "1. Nxe5+ fxe5 2. Qg4+ Kd6 3. Qe6#"
        },
        {
            "fen": "2bqr2k/1r1n2bp/pp1pBp2/2pP1PQ1/P3PN2/1P4P1/1B5P/R3R1K1 w - - 1 0",
            "solution": "1. Ng6+ hxg6 2. Qh4+ Bh6 3. Qxh6#"
        },
        {
            "fen": "rn1q3r/pp2kppp/3Np3/2b1n3/3N2Q1/3B4/PP4PP/R1B2RK1 w - - 1 0",
            "solution": "1. Rxf7+ Nxf7 2. Qxe6+ Kf8 3. Qxf7#"
        },
        {
            "fen": "rn2k2r/ppp1bppp/5p2/3N1b2/1q6/5p2/PPP1QPPP/2KR1B1R w kq - 1 0",
            "solution": "1. Nxc7+ Kf8 2. Rd8+ Bxd8 3. Qe8#"
        },
        {
            "fen": "4nrk1/rR5p/4pnpQ/4p1N1/2p1N3/6P1/q4P1P/4R1K1 w - - 1 0",
            "solution": "1. Nxf6+ Rxf6 2. Qxh7+ Kf8 3. Qh8#"
        },
        {
            "fen": "3rk2r/Qp1b1pp1/3q3p/2p5/2P1N3/P3PN2/1P3PPP/2n1KB1R b Kk - 0 1",
            "solution": "1... Qd1+ 2. Kxd1 Ba4+ 3. Kxc1 Rd1#"
        },
        {
            "fen": "r5k1/q4ppp/rnR1pb2/1Q1p4/1P1P4/P4N1P/1B3PP1/2R3K1 w - - 1 0",
            "solution": "1. Rc8+ Rxc8 2. Rxc8+ Nxc8 3. Qe8#"
        },
        {
            "fen": "6k1/5p2/p5n1/8/1p1p2P1/1Pb2B1r/P3KPN1/2RQ3q b - - 0 1",
            "solution": "1... Nf4+ 2. Nxf4 Qxf3+ 3. Kf1 Rh1#"
        },
        {
            "fen": "1r2r3/1n3Nkp/p2P2p1/3B4/1p5Q/1P5P/6P1/2b4K w - - 1 0",
            "solution": "1. Qd4+ Re5 2. Qxe5+ Kf8 3. Qh8#"
        },
        {
            "fen": "r1n1kbr1/ppq1pN2/2p1Pn1p/2Pp3Q/3P3P/8/PP3P2/R1B1K2R w - - 1 0",
            "solution": "1. Nd6+ Kd8 2. Qe8+ Nxe8 3. Nf7#"
        },
        {
            "fen": "1r2bk2/1p3ppp/p1n2q2/2N5/1P6/P3R1P1/5PBP/4Q1K1 w - - 1 0",
            "solution": "1. Rxe8+ Rxe8 2. Nd7+ Kg8 3. Qxe8#"
        },
        {
            "fen": "R7/3nbpkp/4p1p1/3rP1P1/P2B1Q1P/3q1NK1/8/8 w - - 1 0",
            "solution": "1. Qf6+ Bxf6 2. exf6+ Nxf6 3. Bxf6#"
        },
        {
            "fen": "r4k1r/p1q2P1p/1pnb2p1/2p5/8/2P1BN2/PP4PP/R2QR1K1 w - - 1 0",
            "solution": "1. Bh6+ Kxf7 2. Qd5+ Kf6 3. Qe6#"
        },
        {
            "fen": "8/7R/2r5/8/P3n3/8/3nk1PP/R5K1 b - - 0 1",
            "solution": "1... Nf3+ 2. gxf3 Rg6+ 3. Kh1 Nf2#"
        },
        {
            "fen": "2rn2k1/1q1N1pbp/4pB1P/pp1pPn2/3P4/1Pr2N2/P2Q1P1K/6R1 w - - 1 0",
            "solution": "1. Rxg7+ Nxg7 2. Qg5 Qxd7 3. Qxg7#"
        },
        {
            "fen": "r4b1r/pp2kbp1/3R2B1/4P2p/2p2N1P/P4Pn1/1P1B2P1/R3K3 w - - 1 0",
            "solution": "1. Nd5+ Ke8 2. Nc7+ Ke7 3. Bg5#"
        },
        {
            "fen": "6k1/5pp1/8/1bBn1q1p/1P5P/5PP1/3Qp1B1/4K3 b - - 0 1",
            "solution": "1... Qb1+ 2. Kf2 Qf1+ 3. Bxf1 exf1=Q#"
        },
        {
            "fen": "5rrk/5pb1/p1pN3p/7Q/1p2PP1R/1q5P/6P1/6RK w - - 1 0",
            "solution": "1. Qxh6+ Bxh6 2. Rxh6+ Kg7 3. Nf5#"
        },
        {
            "fen": "5qk1/1p4b1/p1p2pQn/3p1N2/3P2P1/1PP2PK1/1P2r3/7R w - - 1 0",
            "solution": "1. Nxh6+ Kh8 2. Nf7+ Kg8 3. Rh8#"
        },
        {
            "fen": "r5k1/p1p3bp/1p1p4/2PP2qp/1P6/1Q1bP3/PB3rPP/R2N2RK b - - 0 1",
            "solution": "1... Qxg2+ 2. Rxg2 Rf1+ 3. Rg1 Be4#"
        },
        {
            "fen": "3q2rn/pp3rBk/1npp1p2/5P2/2PPP1RP/2P2B2/P5Q1/6RK w - - 1 0",
            "solution": "1. Rg6 Rgf8 2. Rh6+ Kg8 3. Rxh8#"
        },
        {
            "fen": "3r1r1k/1p3p1p/p2p4/4n1NN/6bQ/1BPq4/P3p1PP/1R5K w - - 1 0",
            "solution": "1. Nxf7+ Nxf7 2. Qf6+ Kg8 3. Qg7#"
        },
        {
            "fen": "2r1qr1k/7p/7P/p2pPpR1/3N1P1Q/P2b4/6R1/7K w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Qf6+ Rg7 3. Qxg7#"
        },
        {
            "fen": "k1br4/ppQ5/8/2PB3p/7b/8/PP6/7K w - - 1 0",
            "solution": "1. c6 b6 2. Qxc8+ Rxc8 3. c7#"
        },
        {
            "fen": "rr6/p1n4k/1p1NqBp1/2p1P2p/4P3/6R1/bP1Q2PP/4R1K1 w - - 1 0",
            "solution": "1. Rxg6 Kxg6 2. Qg5+ Kh7 3. Qg7#"
        },
        {
            "fen": "3r2qk/p2Q3p/1p3R2/2pPp3/1nb5/6N1/PB4PP/1B4K1 w - - 1 0",
            "solution": "1. Bxe5 Rxd7 2. Rf7+ Qg7 3. Rf8#"
        },
        {
            "fen": "2R5/4k1p1/nr2P2p/3PK3/4N1PP/8/1p6/8 w - - 1 0",
            "solution": "1. d6+ Rxd6 2. Nxd6 b1=Q 3. Re8#"
        },
        {
            "fen": "r5rR/3Nkp2/4p3/1Q4q1/np1N4/8/bPPR2P1/2K5 w - - 1 0",
            "solution": "1. Nc6+ Ke8 2. Qxg5 Rxh8 3. Qe7#"
        },
        {
            "fen": "5bk1/1Q3p2/1Np4p/6p1/8/1P2P1PK/4q2P/8 b - - 0 1",
            "solution": "1... f5 2. Qxc6 g4+ 3. Kh4 Qxh2#"
        },
        {
            "fen": "r1b3r1/1p3p1p/1q2pQ2/1Bk5/4p3/8/P1P3PP/3R3K w - - 1 0",
            "solution": "1. Qe5+ Kb4 2. Rb1+ Ka5 3. Qc3#"
        },
        {
            "fen": "2r1k2r/pR2p1bp/2n1P1p1/8/2QP4/q2b1N2/P2B1PPP/4K2R w - - 1 0",
            "solution": "1. Qxc6+ Rxc6 2. Rb8+ Rc8 3. Rxc8#"
        },
        {
            "fen": "n7/pk3pp1/1rR3p1/QP1pq3/4n3/6PB/4PP1P/2R3K1 w - - 1 0",
            "solution": "1. Qa6+ Rxa6 2. bxa6+ Kb8 3. Rc8#"
        },
        {
            "fen": "r2q1rk1/p4p1p/3p1Q2/2n3B1/B2R4/8/PP3PPP/5bK1 w - - 1 0",
            "solution": "1. Rg4 Be2 2. Bh6+ Bxg4 3. Qg7#"
        },
        {
            "fen": "r1b1nb1r/3pk1pp/p2N1pn1/Q1Bp4/8/8/PP2BP1P/2K1R3 w - - 1 0",
            "solution": "1. Bh5+ Ne5 2. Nf5+ Ke6 3. Nd4#"
        },
        {
            "fen": "6rk/p1pb1p1p/2pp1P2/2b1n2Q/4PR2/3B4/PPP1K2P/RNB3q1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh4+ Kg6 3. Rh6#"
        },
        {
            "fen": "3r3k/7p/pp2B1p1/3N2P1/P2qPQ2/8/1Pr4P/5R1K w - - 1 0",
            "solution": "1. Qf8+ Rxf8 2. Rxf8+ Kg7 3. Rg8#"
        },
        {
            "fen": "2r2bk1/pb3ppp/1p6/n7/q2P4/P1P1R2Q/B2B1PPP/R5K1 w - - 1 0",
            "solution": "1. Bxf7+ Kh8 2. Qxh7+ Kxh7 3. Rh3#"
        },
        {
            "fen": "8/1p2p1kp/2rRB3/pq2n1Pp/4P3/8/PPP2Q2/2K5 w - - 1 0",
            "solution": "1. Qf8+ Kxf8 2. Rd8+ Kg7 3. Rg8#"
        },
        {
            "fen": "r1b3r1/ppp1R2p/3p3k/1q2B1p1/5Q2/8/PPP2PPP/6K1 w - - 1 0",
            "solution": "1. Qf6+ Rg6 2. Rxh7+ Kxh7 3. Qh8#"
        },
        {
            "fen": "3r3r/p1pqppbp/1kN3p1/2pnP3/Q5b1/1NP5/PP3PPP/R1B2RK1 w - - 1 0",
            "solution": "1. Qxa7+ Kxc6 2. Na5+ Kb5 3. a4#"
        },
        {
            "fen": "r4r2/p1p4p/1p2R3/5p2/2B2K2/7k/PPP2P2/8 w - - 1 0",
            "solution": "1. Bd5 Rf6 2. Re1 Re6 3. Rh1#"
        },
        {
            "fen": "1rb2RR1/p1p3p1/2p3k1/5p1p/8/3N1PP1/PP5r/2K5 w - - 1 0",
            "solution": "1. Ne5+ Kh6 2. Rh8+ Kg5 3. f4#"
        },
        {
            "fen": "8/R4R1p/4p1p1/r3p3/1b2PnkP/6P1/5PK1/8 w - - 1 0",
            "solution": "1. Rxf4+ exf4 2. f3+ Kh5 3. Rxh7#"
        },
        {
            "fen": "3r1q1k/6bp/p1p5/1p2B1Q1/P1B5/3P4/5PPP/4R1K1 w - - 1 0",
            "solution": "1. Bxg7+ Qxg7 2. Qxd8+ Qg8 3. Qxg8#"
        },
        {
            "fen": "2k5/p1p4R/P3r1p1/2r2p2/8/1R6/8/5K2 w - - 1 0",
            "solution": "1. Rb8+ Kxb8 2. Rh8+ Re8 3. Rxe8#"
        },
        {
            "fen": "kr6/pR5R/1q1pp3/8/1Q6/2P5/PKP5/5r2 w - - 1 0",
            "solution": "1. Qxb6 Rb1+ 2. Kxb1 axb6 3. Ra7#"
        },
        {
            "fen": "r1b2rk1/1p2nppp/p2R1b2/4qP1Q/4P3/1B2B3/PPP2P1P/2K3R1 w - - 1 0",
            "solution": "1. Qxf7+ Kh8 2. Qxf8+ Ng8 3. Qxg8#"
        },
        {
            "fen": "7r/1Q6/pp1pkPn1/6B1/2qP2P1/3p4/P7/1K4R1 w - - 1 0",
            "solution": "1. Re1+ Ne5 2. d5+ Qxd5 3. Qe7#"
        },
        {
            "fen": "8/5k2/6pQ/1p5p/2pqN3/1p3P1P/1r4P1/4R2K w - - 1 0",
            "solution": "1. Ng5+ Kf6 2. Nh7+ Kf7 3. Qf8#"
        },
        {
            "fen": "3qrk2/p1r2pp1/1p2pb2/nP1bN2Q/3PN3/P6R/5PPP/R5K1 w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Ng6+ Kg8 3. Rh8#"
        },
        {
            "fen": "3r1r1k/p4p1p/1pp2p2/2b2P1Q/3q1PR1/1PN2R1P/1P4P1/7K w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh4+ Kg7 3. Rg3#"
        },
        {
            "fen": "R2Q4/6k1/3p1qp1/3n2p1/1p1r1p2/3B1P2/2P3PK/8 w - - 1 0",
            "solution": "1. Qh8+ Kf7 2. Qg8+ Ke7 3. Qe8#"
        },
        {
            "fen": "4r2k/4R1pp/7N/p6n/qp6/6QP/5PPK/8 w - - 1 0",
            "solution": "1. Qb3 gxh6 2. Qf7 Rxe7 3. Qf8#"
        },
        {
            "fen": "4b1k1/2r2p2/1q1pnPpQ/7p/p3P2P/pN5B/P1P5/1K1R2R1 w - - 1 0",
            "solution": "1. Rxg6+ fxg6 2. Bxe6+ Rf7 3. Qg7#"
        },
        {
            "fen": "r3k2r/1ppq1ppp/1p2P3/n3Pb2/1bP2Q2/2N2N1P/PP4P1/2KR1B1R b - - 0 1",
            "solution": "1... Nb3+ 2. axb3 Ra1+ 3. Nb1 Rxb1#"
        },
        {
            "fen": "1r2nr2/2q3kp/p2pQ1pR/4n1P1/Np2P3/1B6/PPP4P/2KR4 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh3+ Kg7 3. Qh6#"
        },
        {
            "fen": "3r4/7p/2RN2k1/4n2q/P2p4/3P2P1/4p1P1/5QK1 w - - 1 0",
            "solution": "1. Ne8+ Rd6 2. Rxd6+ Kg5 3. Qf4#"
        },
        {
            "fen": "r1b2rk1/pp1p1p1p/2n3pQ/5qB1/8/2P5/P4PPP/4RRK1 w - - 1 0",
            "solution": "1. Qxf8+ Kxf8 2. Bh6+ Kg8 3. Re8#"
        },
        {
            "fen": "r3q2k/p2n1r2/2bP1ppB/b3p2Q/N1Pp4/P5R1/5PPP/R5K1 w - - 1 0",
            "solution": "1. Bg7+ Kxg7 2. Rxg6+ Kf8 3. Qh8#"
        },
        {
            "fen": "6r1/pp3N1k/1q2bQpp/3pP3/8/6RP/PP3PP1/6K1 w - - 1 0",
            "solution": "1. Rxg6 Qxf2+ 2. Kxf2 Rxg6 3. Qh8#"
        },
        {
            "fen": "r1bqn1rk/1p1np1bp/p1pp2p1/6P1/2PPP3/2N1BPN1/PP1Q4/2KR1B1R w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh2+ Bh6 3. Qxh6#"
        },
        {
            "fen": "r1k2r2/p5Rp/3R4/3p3p/3B4/3B4/PP1q3P/7K w - - 1 0",
            "solution": "1. Ba6+ Kb8 2. Rb6+ axb6 3. Be5#"
        },
        {
            "fen": "r4r1k/1pqb1B1p/p3p2B/2bpP2Q/8/1NP5/PP4PP/5R1K w - - 1 0",
            "solution": "1. Bg7+ Kxg7 2. Qg5+ Kh8 3. Qf6#"
        },
        {
            "fen": "rn4k1/pp1r1pp1/1q1b4/5QN1/5N2/4P3/PP3PPP/3R1RK1 w - - 1 0",
            "solution": "1. Qh7+ Kf8 2. Qh8+ Ke7 3. Nd5#"
        },
        {
            "fen": "b4rk1/p4p2/1p4Pq/4p3/8/P1N2PQ1/BP3PK1/8 w - - 1 0",
            "solution": "1. gxf7+ Kh7 2. Qg8+ Rxg8+ 3. fxg8=Q#"
        },
        {
            "fen": "1rb1kb1r/5pp1/p4q1p/3Q4/5P2/8/PPP3PP/2KR1B1R w k - 1 0",
            "solution": "1. Bb5+ axb5 2. Rhe1+ Be7 3. Qd8#"
        },
        {
            "fen": "2q1n3/1p1bppkp/p2p2p1/3P4/P2N4/1PQ3PP/4PPB1/6K1 w - - 1 0",
            "solution": "1. Nf5+ Kg8 2. Nh6+ Kf8 3. Qh8#"
        },
        {
            "fen": "r4rk1/p4ppp/Pp4n1/4BN2/1bq5/7Q/2P2PPP/3RR1K1 w - - 1 0",
            "solution": "1. Qh6 Qf1+ 2. Kxf1 gxh6 3. Nxh6#"
        },
        {
            "fen": "1r3k2/3Rnp2/6p1/6q1/p1BQ1p2/P1P5/1P3PP1/6K1 w - - 1 0",
            "solution": "1. Qh8+ Ng8 2. Rxf7+ Ke8 3. Qxg8#"
        },
        {
            "fen": "8/2Q5/2P1p2k/3p1p1p/4brq1/2R5/3R3K/8 b - - 0 1",
            "solution": "1... Rf2+ 2. Rxf2 Qh4+ 3. Kg1 Qh1#"
        },
        {
            "fen": "5rk1/pp2p2p/3p2pb/2pPn2P/2P2q2/2N4P/PP3BR1/R2BK1N1 b - - 0 1",
            "solution": "1... Nd3+ 2. Ke2 Qd2+ 3. Kf1 Qe1#"
        },
        {
            "fen": "3R4/6rk/1p4p1/p2Q1p2/P1B1p2p/1n2P1P1/5PKP/2q5 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qd8+ Kh7 3. Qxh4#"
        },
        {
            "fen": "6rk/1pqbbp1p/p3p2Q/6R1/4N1nP/3B4/PPP5/2KR4 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Nf6+ Kh8 3. Rxg8#"
        },
        {
            "fen": "2rb3r/3N1pk1/p2pp2p/qp2PB1Q/n2N1P2/6P1/P1P4P/1K1RR3 w - - 1 0",
            "solution": "1. Nxe6+ Kg8 2. Qg4+ Bg5 3. Nf6#"
        },
        {
            "fen": "5q2/1ppr1br1/1p1p1knR/1N4R1/P1P1PP2/1P6/2P4Q/2K5 w - - 1 0",
            "solution": "1. Qh4 Bg8 2. Rf5+ Ke6 3. Nd4#"
        },
        {
            "fen": "6k1/pp1Q4/6Bb/2p1P1qP/4P3/1P1P1rPK/P7/8 w - - 1 0",
            "solution": "1. Qh7+ Kf8 2. Qh8+ Ke7 3. Qe8#"
        },
        {
            "fen": "r1b2r2/p1q1npkB/1pn1p1p1/2ppP1N1/3P4/P1P2Q2/2P2PPP/R1B2RK1 w - - 1 0",
            "solution": "1. Qf6+ Kh6 2. Nxe6+ Kxh7 3. Qg7#"
        },
        {
            "fen": "4r1k1/pR3pp1/7p/3n1b1N/2pP4/2P2PQ1/3B1KPP/q7 b - - 0 1",
            "solution": "1... Re2+ 2. Kxe2 Bd3+ 3. Kf2 Qf1#"
        },
        {
            "fen": "2b2r1k/1p2R3/2n2r1p/p1P1N1p1/2B3P1/P6P/1P3R2/6K1 w - - 1 0",
            "solution": "1. Ng6+ Rxg6 2. Rxf8+ Rg8 3. Rxg8#"
        },
        {
            "fen": "1rr4k/7p/p3Qpp1/3p1P2/8/1P1q3P/PK4P1/3B3R b - - 0 1",
            "solution": "1... Qc3+ 2. Ka3 Qc5+ 3. Kb2 Qc1#"
        },
        {
            "fen": "2q1rnk1/p4r2/1p3pp1/3P3Q/2bPp2B/2P4R/P1B3PP/4R1K1 w - - 1 0",
            "solution": "1. Qh8+ Kxh8 2. Bxf6+ Kg8 3. Rh8#"
        },
        {
            "fen": "2rr2k1/1b3p1p/1p1b2p1/p1qP3Q/3R4/1P6/PB3PPP/1B2R1K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh4+ Kg8 3. Rh8#"
        },
        {
            "fen": "r3k2r/6pp/p1b1Pp2/q1bN1Q2/8/1p6/PPP3PP/2KR1B1R w kq - 0 1",
            "solution": "1. Nxf6+ gxf6 2. Qh5+ Ke7 3. Qf7#"
        },
        {
            "fen": "2rk4/5R2/3pp1Q1/pb2q2N/1p2P3/8/PPr5/1K1R4 w - - 1 0",
            "solution": "1. Rxd6+ Qxd6 2. Qf6+ Ke8 3. Ng7#"
        },
        {
            "fen": "r1b1r3/qp1n1pk1/2pp2p1/p3n3/N1PNP1P1/1P3P2/P6Q/1K1R1B1R w - - 1 0",
            "solution": "1. Nf5+ gxf5 2. Qh6+ Kg8 3. Qh8#"
        },
        {
            "fen": "8/2k2r2/pp6/2p1R1Np/6pn/8/Pr4B1/3R3K w - - 1 0",
            "solution": "1.Ne6+ Kb8 2.Rd8+ Ka7 3.Ra8#"
        },
        {
            "fen": "2bq1k1r/r5pp/p2b1Pn1/1p1Q4/3P4/1B6/PP3PPP/2R1R1K1 w - - 1 0",
            "solution": "1.Qxd6+ Qxd6 2.Rxc8+ Qd8 3.Rxd8#"
        },
        {
            "fen": "3r2k1/5p2/2b2Bp1/7p/4p3/5PP1/P3Bq1P/Q3R2K b - - 0 1",
            "solution": "1... exf3 2. Bf1 Qxf1+ 3. Rxf1 f2#"
        },
        {
            "fen": "1r3r1k/6p1/p6p/2bpNBP1/1p2n3/1P5Q/PBP1q2P/1K5R w - - 1 0",
            "solution": "1. Qxh6+ gxh6 2. Nf7+ Kg8 3. Nxh6#"
        },
        {
            "fen": "r5k1/pp2ppb1/3p4/q3P1QR/6b1/r2B1p2/1PP5/1K4R1 w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rxg4+ Kf8 3. Rh8#"
        },
        {
            "fen": "3r4/p4Q1p/1p2P2k/2p3pq/2P2B2/1P2p2P/P5P1/6K1 w - - 1 0",
            "solution": "1. Qf6+ Qg6 2. Bxg5+ Kh5 3. g4#"
        },
        {
            "fen": "4r1k1/pp3p2/3p1P1p/3PbR2/1P1p2PQ/P2P3P/2q5/5RK1 w - - 1 0",
            "solution": "1. Rg5+ hxg5 2. Qxg5+ Kh8 3. Qg7#"
        },
        {
            "fen": "3Q1R2/pp4bk/6p1/6p1/2B1b1q1/P7/1P4P1/6K1 w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Qg8+ Kh6 3. Qxh8#"
        },
        {
            "fen": "nr2kb1r/1p3p1p/p2p1q2/P2Pp3/2N2p2/2P3PB/1P3P1P/R2QK2R w - - 1 0",
            "solution": "1. Qa4+ b5 2. axb6+ Ke7 3. Qd7#"
        },
        {
            "fen": "r2r4/1b3k2/3Pq3/pBp1p2p/Pp6/6R1/1P3P2/R2Q2K1 w - - 1 0",
            "solution": "1. Qxh5+ Kf8 2. Qh8+ Kf7 3. Qg7#"
        },
        {
            "fen": "4r3/pp1nr3/2p4p/4p1b1/4kPP1/1PBN4/P1P1K3/3R4 w - - 1 0",
            "solution": "1. Nf2+ Kxf4 2. Rg1 e4 3. Nh3#"
        },
        {
            "fen": "3k4/1R6/3N2n1/p2Pp3/2P1N3/3n2Pp/q6P/5RK1 w - - 1 0",
            "solution": "1. Rf8+ Nxf8 2. Nf7+ Kc8 3. Ned6#"
        },
        {
            "fen": "6k1/5p2/4nQ1P/p4N2/1p1b4/7K/PP3r2/8 w - - 1 0",
            "solution": "1. h7+ Kxh7 2. Qh6+ Kg8 3. Ne7#"
        },
        {
            "fen": "7k/1p6/p2p4/2pN1b2/P1P5/2N2nr1/1P6/R6K b - - 0 1",
            "solution": "1... Bh3 2. Nf4 Bg2+ 3. Nxg2 Rh3#"
        },
        {
            "fen": "2rr1k2/pb4p1/1p1qpp2/4R2Q/3n4/P1N5/1P3PPP/1B2R1K1 w - - 1 0",
            "solution": "1. Qh8+ Kf7 2. Bg6+ Ke7 3. Qxg7#"
        },
        {
            "fen": "5r1k/7p/8/4NP2/8/3p2R1/2r3PP/2n1RK2 w - - 1 0",
            "solution": "1. Nf7+ Rxf7 2. Re8+ Rf8 3. Rxf8#"
        },
        {
            "fen": "r3r3/ppp4p/2bq2Nk/8/1PP5/P1B3Q1/6PP/4R1K1 w - - 1 0",
            "solution": "1. Qh4+ Kxg6 2. Qg4+ Kh6 3. Bg7#"
        },
        {
            "fen": "3r3k/1p3Rpp/p2nn3/3N4/8/1PB1PQ1P/q4PP1/6K1 w - - 1 0",
            "solution": "1. Bxg7+ Nxg7 2. Rf8+ Rxf8 3. Qxf8#"
        },
        {
            "fen": "6kr/p1Q3pp/3Bbbq1/8/5R2/5P2/PP3P1P/4KB1R w - - 1 0",
            "solution": "1. Qd8+ Kf7 2. Qe7+ Kg8 3. Qf8#"
        },
        {
            "fen": "rq2r2k/pp2p2p/3p1pp1/6R1/4P3/4B3/PPP1Q3/2K4R w - - 1 0",
            "solution": "1. Rxg6 Qc8 2. Rxh7+ Kxh7 3. Qh5#"
        },
        {
            "fen": "r5k1/3npp1p/2b3p1/1pn5/2pRP3/2P1BPP1/r1P4P/1NKR1B2 b - - 0 1",
            "solution": "1... Rxc2+ 2. Kxc2 Ra2+ 3. Kc1 Nb3#"
        },
        {
            "fen": "7r/2pk2p1/p2p1b2/1p6/4P3/1PN1Bb2/RPP2P2/4K3 b - - 0 1",
            "solution": "1... Bxc3+ 2. bxc3 Rh1+ 3. Kd2 Rd1#"
        },
        {
            "fen": "r1bq2rk/pp1n1p1p/5P1Q/1B3p2/3B3b/P5R1/2P3PP/3K3R w - - 1 0",
            "solution": "1. Rg7 Nf8 2. Rxg8+ Kxg8 3. Qg7#"
        },
        {
            "fen": "r1n1qnr1/2p3k1/1pP1p1pp/bP1pPp2/3P1P1Q/BR3NR1/4BP1P/7K w - - 1 0",
            "solution": "1. Qf6+ Kh7 2. Ng5+ hxg5 3. Rh3#"
        },
        {
            "fen": "4r2k/4Q1bp/4B1p1/1q2n3/4pN2/P1B3P1/4pP1P/4R1K1 w - - 1 0",
            "solution": "1. Nxg6+ hxg6 2. Qh4+ Bh6 3. Qxh6#"
        },
        {
            "fen": "r1b1r3/ppq2pk1/2n1p2p/b7/3PB3/2P2Q2/P2B1PPP/1R3RK1 w - - 1 0",
            "solution": "1. Bxh6+ Kxh6 2. Qf6+ Kh5 3. Bf3#"
        },
        {
            "fen": "r2r1b1k/pR6/6pp/5Q2/3qB3/6P1/P3PP1P/6K1 w - - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Qxg6+ Kh8 3. Qh7#"
        },
        {
            "fen": "4r1r1/pb1Q2bp/1p1Rnkp1/5p2/2P1P3/4BP2/qP2B1PP/2R3K1 w - - 1 0",
            "solution": "1. e5+ Kxe5 2. Rxe6+ Rxe6 3. Qd4#"
        },
        {
            "fen": "1r2qrk1/p4p1p/bp1p1Qp1/n1ppP3/P1P5/2PB1PN1/6PP/R4RK1 w - - 1 0",
            "solution": "1. Nf5 gxf5 2. Qxf5 dxe5 3. Qxh7#"
        },
        {
            "fen": "r1q2b2/p4p1k/1p1r3p/3B1P2/3B2Q1/4P3/P5PP/5RK1 w - - 1 0",
            "solution": "1. Bxf7 h5 2. Bg8+ Kh6 3. Qf4#"
        },
        {
            "fen": "r5rk/pp2qb1p/2p2pn1/2bp4/3pP1Q1/1B1P1N1R/PPP3PP/R1B3K1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh5+ Kg7 3. Qh6#"
        },
        {
            "fen": "2r5/p1qp1kpp/b4p2/3P4/2nQ1P2/3p2N1/PP4PP/1K1RN3 b - - 0 1",
            "solution": "1... Nd2+ 2. Ka1 Qc1+ 3. Rxc1 Rxc1#"
        },
        {
            "fen": "r1bq1rk1/ppp2p1p/2np2pb/4p3/2N1P1P1/P2P1P1P/2P1N3/1R1QKB1R b - - 0 1",
            "solution": "1... Qh4+ 2. Ng3 Qxg3+ 3. Ke2 Nd4#"
        },
        {
            "fen": "r1bnrn2/ppp1k2p/4p3/3PNp1P/5Q2/3B2R1/PPP2PP1/2K1R3 w - - 1 0",
            "solution": "1. Qb4+ c5 2. dxc6+ Kf6 3. Qh4#"
        },
        {
            "fen": "2rnk3/pq3p2/3P1Q1R/1p6/3P4/5P2/P1b1N1P1/5K2 w - - 1 0",
            "solution": "1. d7+ Kxd7 2. Qd6+ Ke8 3. Rh8#"
        },
        {
            "fen": "2r3k1/ppq3p1/2n2p1p/2pr4/5P1N/6QP/PP2R1P1/4R2K w - - 1 0",
            "solution": "1. Re8+ Rxe8 2. Rxe8+ Kf7 3. Qg6#"
        },
        {
            "fen": "3r2k1/1b2Qp2/pqnp3b/1pn5/3B3p/1PR4P/P4PP1/1B4K1 w - - 1 0",
            "solution": "1. Bh7+ Kxh7 2. Qxf7+ Bg7 3. Qxg7#"
        },
        {
            "fen": "2kr3r/1pp2ppp/pbp4n/5q2/1PP5/2Q5/PB3PPP/RN3RK1 b - - 0 1",
            "solution": "1... Qxf2+ 2. Rxf2 Rd1+ 3. Qe1 Rxe1#"
        },
        {
            "fen": "r1bn1b2/ppk1n2r/2p3pp/5p2/N1PNpPP1/2B1P3/PP2B2P/2KR2R1 w - - 1 0",
            "solution": "1. Nb5+ cxb5 2. Be5+ Kc6 3. cxb5#"
        },
        {
            "fen": "1qr1k3/pb2p3/1p2N3/1NpPp3/8/7Q/PPP5/2K1R3 w - - 1 0",
            "solution": "1. Rf1 Bxd5 2. Ng7+ Kd8 3. Rf8#"
        },
        {
            "fen": "1k5r/3R1pbp/1B2p3/2NpPn2/5p2/8/1PP3PP/6K1 w - - 1 0",
            "solution": "1. Rc7 Ka8 2. Nd7 Bxe5 3. Ra7#"
        },
        {
            "fen": "3r4/4RRpk/5n1N/8/p1p2qPP/P1Qp1P2/1P4K1/3b4 w - - 1 0",
            "solution": "1. Rxg7+ Kxh6 2. Rh7+ Nxh7 3. Qg7#"
        },
        {
            "fen": "r1bq2r1/ppnn1pk1/2p3pR/2B1p1P1/2P1P1P1/2N2P2/PP1Q4/R3KB2 w Q - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Qh2+ Kg7 3. Qh6#"
        },
        {
            "fen": "7k/pb4rp/2qp1Q2/1p3pP1/np3P2/3PrN1R/P1P4P/R3N1K1 w - - 1 0",
            "solution": "1. Qf8+ Rg8 2. Rxh7+ Kxh7 3. Qh6#"
        },
        {
            "fen": "r4r1k/5p2/3P4/4pP1N/b5P1/b1p2B2/p1P1R2P/K2R4 b - - 0 1",
            "solution": "1... Bb2+ 2. Kxa2 Bxc2+ 3. Bxa8 Rxa8#"
        },
        {
            "fen": "r2q1rk1/pp3pp1/2n5/3p1b2/2P4R/2B1Q1P1/PP2P3/R3K3 w Q - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qh6+ Bh7 3. Qxg7#"
        },
        {
            "fen": "5rk1/1p1n2bp/p7/P2P2p1/4R3/4N1Pb/2QB1q1P/4R2K b - - 0 1",
            "solution": "1... Bg2+ 2. Nxg2 Qf1+ 3. Rxf1 Rxf1#"
        },
        {
            "fen": "2kr3r/1p3ppp/p3pn2/2b1B2q/Q1N5/2P5/PP3PPP/R2R2K1 w - - 1 0",
            "solution": "1. Nb6+ Bxb6 2. Qc4+ Bc7 3. Qxc7#"
        },
        {
            "fen": "r1b3k1/p1p1n1pp/2pp1r2/2b5/4Pp1q/2NB1P2/PPP1Q1PP/R3BR1K b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Rh6+ 3. Bh4 Rxh4#"
        },
        {
            "fen": "r1b2rk1/1p3ppp/p2p4/3NnQ2/2B1R3/8/PqP3PP/5RK1 w - - 1 0",
            "solution": "1. Ne7+ Kh8 2. Qxh7+ Kxh7 3. Rh4#"
        },
        {
            "fen": "2r3r1/7p/b3P2k/p1bp1p1B/P2N1P2/1P4Q1/2P4P/7K w - - 1 0",
            "solution": "1. Nxf5+ Kxh5 2. Qh4+ Kg6 3. Qg5#"
        },
        {
            "fen": "rnbqr1k1/ppp3p1/4pR1p/4p2Q/3P4/B1PB4/P1P3PP/R5K1 w - - 1 0",
            "solution": "1. Qf7+ Kh8 2. Rxh6+ gxh6 3. Qh7#"
        },
        {
            "fen": "4rk2/p5p1/1p2P2N/7R/nP5P/5PQ1/b6K/q7 w - - 1 0",
            "solution": "1. Qd6+ Re7 2. Qd8+ Re8 3. e7#"
        },
        {
            "fen": "3R4/p1r3rk/1q2P1p1/5p1p/1n6/1B5P/P2Q2P1/3R3K w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qh6+ Kg8 3. Rd8#"
        },
        {
            "fen": "4q2r/5npr/1R1Qpkb1/3p1pR1/2pP1P1P/2P1KB2/2P3N1/8 w - - 1 0",
            "solution": "1. Rxg6+ Kxg6 2. Qxe6+ Qxe6+ 3. Rxe6#"
        },
        {
            "fen": "r3Rnkr/1b5p/p3NpB1/3p4/1p6/8/PPP3P1/2K2R2 w - - 1 0",
            "solution": "1. Rxf6 hxg6 2. Rfxf8+ Kh7 3. Rxh8#"
        },
        {
            "fen": "4B3/6R1/1p5k/p2r3N/Pn1p2P1/7P/1P3P2/6K1 w - - 1 0",
            "solution": "1. Rg6+ Kh7 2. Nf6+ Kh8 3. Rg8#"
        },
        {
            "fen": "r1bqrnk1/ppp3pp/2nbpp2/3pN2Q/3P1P2/2PBP1B1/PP4PP/RN2K2R w KQ - 1 0",
            "solution": "1. Bxh7+ Nxh7 2. Qf7+ Kh8 3. Ng6#"
        },
        {
            "fen": "3Rrk2/1p1R1pr1/2p1p2Q/2q1P1p1/5P2/8/1PP5/1K6 w - - 1 0",
            "solution": "1. Qh8+ Rg8 2. Rxf7+ Kxf7 3. Qf6#"
        },
        {
            "fen": "1r1rb3/p1q2pkp/Pnp2np1/4p3/4P3/Q1N1B1PP/2PRBP2/3R2K1 w - - 1 0",
            "solution": "1. Bh6+ Kxh6 2. Qf8+ Kg5 3. h4#"
        },
        {
            "fen": "2r1r3/p5q1/1p2k1p1/4p2p/2P5/1P1QR1P1/P6P/5RK1 w - - 1 0",
            "solution": "1. Qd5+ Ke7 2. Rxe5+ Qxe5 3. Rf7#"
        },
        {
            "fen": "7k/1ppq4/1n1p2Q1/1P4Np/1P3p1B/3B4/7P/rn5K w - - 1 0",
            "solution": "1. Nf7+ Qxf7 2. Bf6+ Qxf6 3. Qh7#"
        },
        {
            "fen": "r1b2rk1/pp2b1pp/q3pn2/3nN1N1/3p4/P2Q4/1P3PPP/RBB1R1K1 w - - 1 0",
            "solution": "1. Qxh7+ Nxh7 2. Bxh7+ Kh8 3. Ng6#"
        },
        {
            "fen": "3r1k2/r1q2p1Q/pp2B3/4P3/1P1p4/2N5/P1P3PP/5R1K w - - 1 0",
            "solution": "1. Qh8+ Ke7 2. Rxf7+ Kxe6 3. Qf6#"
        },
        {
            "fen": "2rq1r1k/1b2bp1p/p1nppp1Q/1p3P2/4P1PP/2N2N2/PPP5/1K1R1B1R w - - 1 0",
            "solution": "1. Ng5 fxg5 2. hxg5 Bxg5 3. Qxh7#"
        },
        {
            "fen": "r2q3k/ppb3pp/2p1B3/2P1RQ2/8/6P1/PP1r3P/5RK1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh5+ Kg6 3. Bf7#"
        },
        {
            "fen": "r3kb1r/1p3ppp/p1n2n2/4p1N1/2B3b1/1P2P3/P4PPP/RNBR2K1 w kq - 1 0",
            "solution": "1. Bxf7+ Ke7 2. Ba3+ Nb4 3. Bxb4#"
        },
        {
            "fen": "r4k2/6pp/p1n1p2N/2p5/1q6/6QP/PbP2PP1/1K1R1B2 w - - 1 0",
            "solution": "1. Qd6+ Ke8 2. Qxe6+ Ne7 3. Qf7#"
        },
        {
            "fen": "6k1/3q1ppp/p2r4/1p6/4Q3/8/PPP3PP/3R3K w - - 1 0",
            "solution": "1. Qa8+ Qd8 2. Qxd8+ Rxd8 3. Rxd8#"
        },
        {
            "fen": "2n2rk1/5p1p/6p1/1pQ5/2q5/2N1B1P1/1b3P1P/4R1K1 w - - 1 0",
            "solution": "1. Qxf8+ Kxf8 2. Bh6+ Kg8 3. Re8#"
        },
        {
            "fen": "5rk1/pp3ppp/7r/6n1/NB1P3q/PQ3P2/1P4P1/R4RK1 b - - 0 1",
            "solution": "1... Nh3+ 2. gxh3 Qg3+ 3. Kh1 Rxh3#"
        },
        {
            "fen": "2r4b/pp1kprNp/3pNp1P/q2P2p1/2n5/4B2Q/PPP3R1/1K1R4 w - - 1 0",
            "solution": "1. Nc5+ Kc7 2. Qd7+ Kb6 3. Qxb7#"
        },
        {
            "fen": "4R3/p2r1q1k/5B1P/6P1/2p4K/3b4/4Q3/8 w - - 1 0",
            "solution": "1. g6+ Kxg6 2. Qh5+ Kxf6 3. Qg5#"
        },
        {
            "fen": "r1bqr1k1/pp3pbR/2n1p1p1/4PnN1/2Bp1P2/2N4Q/PP4P1/R1B1K3 w Q - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Qh7+ Kf8 3. Qxf7#"
        },
        {
            "fen": "r2r2k1/p3bppp/3p4/q2p3n/3QP3/1P4R1/PB3PPP/R5K1 w - - 1 0",
            "solution": "1. Rxg7+ Kf8 2. Rg8+ Kxg8 3. Qh8#"
        },
        {
            "fen": "Q7/1R5p/2kqr2n/7p/5Pb1/8/P1P2BP1/6K1 w - - 1 0",
            "solution": "1. Qa6+ Kd5 2. Qd3+ Kc6 3. Qb5#"
        },
        {
            "fen": "r2q1r2/pppb1pkn/3p1np1/3Pp3/2P1P1PB/2N3P1/PP1QB3/R3K2R w KQ - 1 0",
            "solution": "1. Qh6+ Kg8 2. Bxf6 Nxf6 3. Qh8#"
        },
        {
            "fen": "8/5kB1/3p4/1p3q1p/7P/KPPn2Q1/P7/8 b - - 0 1",
            "solution": "1... Qc5+ 2. b4 Qa7+ 3. Kb3 Qa4#"
        },
        {
            "fen": "5rn1/1q1r3k/7p/3N1p2/P1p1pP2/2Q5/1P4RP/6RK w - - 1 0",
            "solution": "1. Rxg8 Qxb2 2. Rh8+ Rxh8 3. Nf6#"
        },
        {
            "fen": "r3rk2/5pn1/pb1nq1pR/1p2p1P1/2p1P3/2P2QN1/PPBB1P2/2K4R w - - 1 0",
            "solution": "1. Qf6 Qxf6 2. gxf6 Nxe4 3. Rh8#"
        },
        {
            "fen": "4r1k1/1b5p/p5p1/1p3P2/5Q2/PNP5/4q1PP/6RK b - - 0 1",
            "solution": "1... Qxg2+ 2. Rxg2 Re1+ 3. Qf1 Rxf1#"
        },
        {
            "fen": "6k1/5p2/R5p1/P6n/8/5PPp/2r3rP/R4N1K b - - 0 1",
            "solution": "1... Rxh2+ 2. Nxh2 Nxg3+ 3. Kg1 Rg2#"
        },
        {
            "fen": "8/7p/4Nppk/R7/6PP/3n2K1/Pr6/8 w - - 1 0",
            "solution": "1. g5+ fxg5 2. hxg5+ Kh5 3. Ng7#"
        },
        {
            "fen": "r3rnk1/pp6/1q3B1p/3pP2Q/8/8/PP4PP/1B3b1K w - - 1 0",
            "solution": "1. Bh7+ Nxh7 2. Qg6+ Kf8 3. Qg7#"
        },
        {
            "fen": "2r2b1k/p2Q3p/b1n2PpP/2p5/3r1BN1/3q2P1/P4PB1/R3R1K1 w - - 1 0",
            "solution": "1. Qg7+ Bxg7 2. hxg7+ Kg8 3. Nh6#"
        },
        {
            "fen": "2r1n1k1/1q1r1p1p/pp1ppBp1/8/P1P2PP1/1P1R3Q/7P/5RK1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Kg8 3. Rh8#"
        },
        {
            "fen": "k7/4rp1p/p1q3p1/Q1r2p2/1R6/8/P5PP/1R5K w - - 1 0",
            "solution": "1. Qd8+ Qc8 2. Rb8+ Ka7 3. Qb6#"
        },
        {
            "fen": "5n2/2B4k/ppb3p1/2p2N1p/P1r5/7P/1P4P1/4R1K1 w - - 1 0",
            "solution": "1. Re7+ Kh8 2. Be5+ Kg8 3. Nh6#"
        },
        {
            "fen": "2b1r2r/2q1p1kn/pN1pPp2/P2P1RpQ/3p4/3B4/1P4PP/R6K w - - 1 0",
            "solution": "1. Qf7+ Kh6 2. Rxf6+ Nxf6 3. Qg6#"
        },
        {
            "fen": "rq2kb1r/1p1n1pp1/p3p1b1/1B1pP1Bp/NP1P3P/P7/5PP1/2RQK2R w - - 1 0",
            "solution": "1. Bxd7+ Kxd7 2. Nb6+ Ke8 3. Qa4#"
        },
        {
            "fen": "8/6bk/1p6/5pBp/1P2b3/6QP/P5PK/5q2 b - - 0 1",
            "solution": "1... Be5 2. Bf4 Bxf4 3. Qxf4 Qxg2#"
        },
        {
            "fen": "2B5/7p/3p2p1/8/1R2n1P1/1P2k3/1P5r/5K2 b - - 0 1",
            "solution": "1... Nd2+ 2. Kg1 Nf3+ 3. Kf1 Rf2#"
        },
        {
            "fen": "3r3k/pp4p1/3qQp1p/P1p5/7R/3rN1PP/1B3P2/6K1 w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Bxf6+ Kh7 3. Qf7#"
        },
        {
            "fen": "r2q1r1k/pppb2pp/2np4/5p2/5N2/1B1Q4/PPP1RPPP/R5K1 w - - 1 0",
            "solution": "1. Ng6+ hxg6 2. Qh3+ Qh4 3. Qxh4#"
        },
        {
            "fen": "8/6pk/4Q3/p3P1Pp/1p3P1K/8/1P4q1/8 b - - 0 1",
            "solution": "1... Qh2+ 2. Qh3 Qxf4+ 3. Kxh5 g6#"
        },
        {
            "fen": "4n3/p3N1rk/5Q2/2q4p/2p5/1P3P1P/P1P2P2/6RK w - - 1 0",
            "solution": "1. Rxg7+ Nxg7 2. Qg6+ Kh8 3. Qh6#"
        },
        {
            "fen": "8/5p1k/3p2q1/3Pp3/4Pn1r/R4Qb1/1P5B/5B1K b - - 0 1",
            "solution": "1... Rxh2+ 2. Kg1 Bf2+ 3. Kxh2 Qg1#"
        },
        {
            "fen": "5rk1/pR4pp/4p2r/2p1n2q/2P1p3/P1Q1P1P1/1P3P1P/R1B2NK1 b - - 0 1",
            "solution": "1... Nf3+ 2. Kh1 Qxh2+ 3. Nxh2 Rxh2#"
        },
        {
            "fen": "r1b4r/1p2kpp1/p3p3/4P2n/2qN4/2N5/PPPQ3P/2KR3R w - - 1 0",
            "solution": "1. Nf5+ exf5 2. Qd6+ Ke8 3. Qd8#"
        },
        {
            "fen": "2Q5/p4qk1/1p3p2/1P2n1pP/4B1P1/6K1/5P2/8 w - - 1 0",
            "solution": "1. h6+ Kxh6 2. Qh8+ Qh7 3. Qxh7#"
        },
        {
            "fen": "1k5r/pp1Q1pp1/2p4r/b4Pn1/3NPp2/2P2P2/1q4B1/1R2R1K1 b - - 0 1",
            "solution": "1... Rh1+ 2. Bxh1 Nh3+ 3. Kf1 Qf2#"
        },
        {
            "fen": "3b2r1/5Rn1/2qP2pk/p1p1B3/2P1N3/1P3Q2/6K1/8 w - - 1 0",
            "solution": "1. Bxg7+ Rxg7 2. Qh3+ Bh4 3. Qxh4#"
        },
        {
            "fen": "5r2/6k1/p2p4/6n1/P3p3/8/5P2/2q2QKR b - - 0 1",
            "solution": "1... Nf3+ 2. Kg2 Qg5+ 3. Kh3 Rh8#"
        },
        {
            "fen": "1R6/5qpk/4p2p/1Pp1Bp1P/r1n2QP1/5PK1/4P3/8 w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh8+ Kg5 3. f4#"
        },
        {
            "fen": "rn1k3r/1b1q1ppp/p2P4/2B2p2/8/1QNBR3/PP3PPP/2R3K1 w - - 1 0",
            "solution": "1. Qb6+ Kc8 2. Bxf5 Bc6 3. Qc7#"
        },
        {
            "fen": "r6k/pb4bp/5Q2/2p1Np2/1qB5/8/P4PPP/4RK2 w - - 1 0",
            "solution": "1. Ng6+ hxg6 2. Qh4+ Bh6 3. Qxh6#"
        },
        {
            "fen": "5rk1/pbppq1bN/1pn1p1Q1/6N1/3P4/8/PPP2PP1/2K4R w - - 1 0",
            "solution": "1. Nf6+ Rxf6 2. Rh8+ Kxh8 3. Qh7#"
        },
        {
            "fen": "3n2b1/1pr1r2k/p1p1pQpp/P1P5/2BP1PP1/5K2/1P5R/8 w - - 1 0",
            "solution": "1. Bd3 Bf7 2. Rxh6+ Kxh6 3. Qh8#"
        },
        {
            "fen": "3R4/2Q5/4qppk/pp2B3/8/P7/8/7K w - - 1 0",
            "solution": "1. Rh8+ Kg5 2. Qc1+ Kf5 3. Qf4#"
        },
        {
            "fen": "rn3k2/pR2b3/4p1Q1/2q1N2P/3R2P1/3K4/P3Br2/8 w - - 1 0",
            "solution": "1. Rxb8+ Bd8 2. Rdxd8+ Ke7 3. Rd7#"
        },
        {
            "fen": "8/1p2pQnp/2r2q2/3p2k1/1P4B1/6P1/5PK1/7R w - - 1 0",
            "solution": "1. Rh5+ Kxg4 2. f3+ Qxf3+ 3. Qxf3#"
        },
        {
            "fen": "r7/3bb1kp/q4p1N/1pnPp1np/2p4Q/2P5/1PB3P1/2B2RK1 w - - 1 0",
            "solution": "1. Qxg5+ fxg5 2. Rf7+ Kxh6 3. Rxh7#"
        },
        {
            "fen": "r1b1r1k1/ppp1np1p/2np2pQ/5qN1/1bP5/6P1/PP2PPBP/R1B2RK1 w - - 1 0",
            "solution": "1. Qxh7+ Kf8 2. Ne6+ fxe6 3. Bh6#"
        },
        {
            "fen": "8/1p6/8/2P3pk/3R2n1/7p/2r5/4R2K b - - 0 1",
            "solution": "1... Rh2+ 2. Kg1 Rg2+ 3. Kf1 Nh2#"
        },
        {
            "fen": "4k2r/1b2ppb1/p3Nnp1/qp2p2p/7P/2rB1P2/PPPQ2P1/1K1R3R w - - 1 0",
            "solution": "1. Bxb5+ axb5 2. Qd8+ Qxd8 3. Rxd8#"
        },
        {
            "fen": "r4r2/1pp5/1bnp3p/p2B1Pnk/P5p1/2PP2K1/1P6/R1B2R2 w - - 1 0",
            "solution": "1. Rh1+ Nh3 2. Rxh3+ gxh3 3. Bf3#"
        },
        {
            "fen": "2qr2k1/4rppN/ppnp4/2pR3Q/2P2P2/1P4P1/PB5P/6K1 w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Rg5+ fxg5 3. Qh8#"
        },
        {
            "fen": "5kr1/pp4p1/3b1rb1/2Bp2NQ/1q6/8/PP3PPP/R3R1K1 w - - 1 0",
            "solution": "1. Nh7+ Kf7 2. Qxd5+ Re6 3. Qxe6#"
        },
        {
            "fen": "7R/3Q2p1/2p2nk1/pp4P1/3P2r1/2P5/4q3/5R1K w - - 1 0",
            "solution": "1. Rxf6+ gxf6 2. Rg8+ Kh5 3. Qh7#"
        },
        {
            "fen": "1r2r1k1/5p2/5Rp1/4Q2p/P2B2qP/1NP5/1KP5/8 w - - 1 0",
            "solution": "1. Rxg6+ Kf8 2. Bc5+ Re7 3. Qxe7#"
        },
        {
            "fen": "r5k1/2p3pp/3p4/1p1Pp3/5q1P/1QP2r2/P1R2P2/3K3R b - - 0 1",
            "solution": "1... Rd3+ 2. Ke1 Qe4+ 3. Re2 Qxh1#"
        },
        {
            "fen": "6k1/5rb1/p7/1p4Q1/3q4/P3p3/1PP3R1/4K3 b - - 0 1",
            "solution": "1... Rf1+ 2. Ke2 Qd2+ 3. Kxf1 Qd1#"
        },
        {
            "fen": "r1b1nn1k/p3p1b1/1qp1B1p1/1p1p4/3P3N/2N1B3/PPP3PP/R2Q1K2 w - - 1 0",
            "solution": "1. Nxg6+ Nxg6 2. Qh5+ Bh6 3. Qxh6#"
        },
        {
            "fen": "r3n2R/pp2n3/3p1kp1/1q1Pp1N1/6P1/2P1BP2/PP6/2KR4 w - - 1 0",
            "solution": "1. Rf8+ Kg7 2. Ne6+ Kh7 3. Rh1#"
        },
        {
            "fen": "3br3/pp2r3/2p4k/4N1pp/3PP3/P1N5/1P2K3/6RR w - - 1 0",
            "solution": "1. Rxh5+ Kg7 2. Rgxg5+ Kf6 3. Rg6#"
        },
        {
            "fen": "3kr3/p1r1bR2/4P2p/1Qp5/3p3p/8/PP4PP/6K1 w - - 1 0",
            "solution": "1. Qb8+ Rc8 2. Qd6+ Bxd6 3. Rd7#"
        },
        {
            "fen": "r3b3/4R3/2p3p1/pp1k2Np/4NP2/P5P1/1PP4P/2K2n2 w - - 1 0",
            "solution": "1. Re5+ Kd4 2. Nd6 Nxh2 3. Ne6#"
        },
        {
            "fen": "4k3/4n3/3R2P1/7N/5P2/2r5/5K2/8 w - - 1 0",
            "solution": "1. Ng7+ Kf8 2. Ne6+ Kg8 3. Rd8#"
        },
        {
            "fen": "5b2/8/2p1b3/2p1Pp2/p1P2P2/k1B5/1NK5/8 w - - 1 0",
            "solution": "1. Nd3 Bxc4 2. Bb2+ Ka2 3. Nc1#"
        },
        {
            "fen": "rn1r4/pp2p1b1/5kpp/q1PQ1b2/6n1/2N2N2/PPP3PP/R1B2RK1 w - - 1 0",
            "solution": "1. Ne4+ Bxe4 2. Nd4+ Bf5 3. Qe6#"
        },
        {
            "fen": "4q2k/3R2bp/8/pQ1N1pp1/8/1P4K1/P3r1PP/8 b - - 0 1",
            "solution": "1... Be5+ 2. Kf3 Qh5+ 3. g4 Qxg4#"
        },
        {
            "fen": "8/kp1R4/2q2p1p/3Qb2P/p7/P5P1/KP6/N1r5 b - - 0 1",
            "solution": "1... Rxa1+ 2. Kxa1 Qc1+ 3. Ka2 Qxb2#"
        },
        {
            "fen": "1rb2k2/1pq3pQ/pRpNp3/P1P2n2/3P1P2/4P3/6PP/6K1 w - - 1 0",
            "solution": "1. Qh8+ Ke7 2. Qe8+ Kf6 3. Ne4#"
        },
        {
            "fen": "7k/2R5/pp1p1r1p/3B1P2/P1n3pN/2p5/1b5P/7K w - - 1 0",
            "solution": "1. Ng6+ Rxg6 2. fxg6 g3 3. Rh7#"
        },
        {
            "fen": "r3k2r/pR2ppbp/2p2np1/8/4N3/3PB1QP/q4PP1/5RK1 w kq - 1 0",
            "solution": "1. Rb8+ Rxb8 2. Qxb8+ Kd7 3. Nc5#"
        },
        {
            "fen": "r2r2k1/1q2bpB1/pp1p1PBp/8/P7/7Q/1PP3PP/R6K w - - 1 0",
            "solution": "1. Bh7+ Kxh7 2. Qxh6+ Kg8 3. Qh8#"
        },
        {
            "fen": "b3n1k1/5pP1/2N5/pp1P4/4Bb2/qP4QP/5P1K/8 w - - 1 0",
            "solution": "1. Bh7+ Kxh7 2. g8=Q+ Kh6 3. Qh8#"
        },
        {
            "fen": "b5r1/2r5/2pk4/2N1R1p1/1P4P1/4K2p/4P2P/R7 w - - 1 0",
            "solution": "1. Re6+ Kd5 2. Kd3 Rd8 3. e4#"
        },
        {
            "fen": "1r2r2k/5p1p/ppbp1P1B/5PR1/2P3Rp/3n4/PP1N3P/6K1 w - - 1 0",
            "solution": "1. Bg7+ Kg8 2. Bf8+ Kxf8 3. Rg8#"
        },
        {
            "fen": "q2rrk2/1b4pQ/p7/3pP3/1b3P2/3B3R/6PP/2R3K1 w - - 1 0",
            "solution": "1. Qf5+ Kg8 2. Rh8+ Kxh8 3. Qh7#"
        },
        {
            "fen": "5rkr/1p2Qpbp/pq1P4/2nB4/5p2/2N5/PPP4P/1K1RR3 w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Re8+ Bf8 3. Rg1#"
        },
        {
            "fen": "r1bq1r1k/pp4pp/2pp4/2b2p2/4PN2/1BPP1Q2/PP3PPP/R4RK1 w - - 1 0",
            "solution": "1. Ng6+ hxg6 2. Qh3+ Qh4 3. Qxh4#"
        },
        {
            "fen": "3r1k2/1pr2pR1/p1bq1n1Q/P3pP2/3pP3/3P4/1P2N2P/6RK w - - 1 0",
            "solution": "1. Qh8+ Ke7 2. Rxf7+ Kxf7 3. Rg7#"
        },
        {
            "fen": "5q2/7k/1Q3B1p/1P3P2/2P5/1KN2p2/8/r7 w - - 1 0",
            "solution": "1. Qc7+ Kg8 2. Qg3+ Kh7 3. Qg6#"
        },
        {
            "fen": "4r1k1/pp1q3p/2n1NBb1/3pP1Q1/2pP2P1/2P2P2/5K2/7R w - - 1 0",
            "solution": "1. Qxg6+ hxg6 2. Rh8+ Kf7 3. Ng5#"
        },
        {
            "fen": "1r2r3/2p2p2/5Bpk/3pP1Rp/pp3P1Q/7P/qPP3PK/8 w - - 1 0",
            "solution": "1. Rxh5+ gxh5 2. Qg5+ Kh7 3. Qg7#"
        },
        {
            "fen": "3q1r2/p2nr3/1k1NB1pp/1Pp5/5B2/1Q6/P5PP/5RK1 w - - 1 0",
            "solution": "1. Nc4+ Kb7 2. Qf3+ Kc8 3. Qa8#"
        },
        {
            "fen": "6k1/8/3q1p2/p5p1/P1b1P2p/R1Q4P/5KN1/3r4 b - - 0 1",
            "solution": "1... Rf1+ 2. Ke3 Rf3+ 3. Kxf3 Qg3#"
        },
        {
            "fen": "2q4r/R7/5p1k/2BpPn2/6Qp/6PN/5P1K/8 w - - 1 0",
            "solution": "1. Be3+ Nxe3 2. Qg7+ Kh5 3. Nf4#"
        },
        {
            "fen": "r5k1/2Rb3r/p2p3b/P2Pp3/4P1pq/5p2/1PQ2B1P/2R2BKN b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Bf4+ 3. Kg1 Bh2#"
        },
        {
            "fen": "1k1r4/1p5p/1P3pp1/b7/P3K3/1B3rP1/2N1bP1P/RR6 b - - 0 1",
            "solution": "1... Bc3 2. Be6 f5+ 3. Bxf5 gxf5#"
        },
        {
            "fen": "r2Q1q1k/pp5r/4B1p1/5p2/P7/4P2R/7P/1R4K1 w - - 1 0",
            "solution": "1. Rxb7 Rxh3 2. Qd4+ Qg7 3. Qxg7#"
        },
        {
            "fen": "6k1/p1q3pp/7P/1p3P2/4N1P1/3P1K2/4Q3/2b5 w - - 1 0",
            "solution": "1. Nf6+ Kf7 2. Qe6+ Kf8 3. Nxh7#"
        },
        {
            "fen": "r1b1kb1r/1p1n1p2/p1n1N2p/4P1p1/q3N2B/8/P1PQB1PP/1R2K2R w Kkq - 1 0",
            "solution": "1. Nf6+ Nxf6 2. Nc7+ Ke7 3. Qd6#"
        },
        {
            "fen": "3RQn2/2r1q1k1/4Bppp/3p3P/3p4/4P1P1/5PK1/8 w - - 1 0",
            "solution": "1. Qxg6+ Nxg6 2. Rg8+ Kh7 3. hxg6#"
        },
        {
            "fen": "3Q1rk1/8/7R/p1N1p1Bp/P1q5/7b/3Q1PPK/1r6 b - - 0 1",
            "solution": "1... Rh1+ 2. Kxh1 Qf1+ 3. Kh2 Qxg2#"
        },
        {
            "fen": "3r4/p1rk4/1p2p1q1/3PQp2/5P2/2P3PR/3K4/2R5 w - - 1 0",
            "solution": "1. Rh7+ Ke8 2. Qh8+ Qg8 3. Qxg8#"
        },
        {
            "fen": "4r2k/2pb1R2/2p4P/3pr1N1/1p6/7P/P1P5/2K4R w - - 1 0",
            "solution": "1. Rh7+ Kg8 2. Rg7+ Kf8 3. Nh7#"
        },
        {
            "fen": "3rk2b/5R1P/6B1/8/1P3pN1/7P/P2pbP2/6K1 w - - 1 0",
            "solution": "1. Nf6+ Bxf6 2. Rg7+ Kf8 3. h8=Q#"
        },
        {
            "fen": "r1b4r/1k2bppp/p1p1p3/8/Np2nB2/3R4/PPP1BPPP/2KR4 w - - 1 0",
            "solution": "1. Rd7+ Bxd7 2. Rxd7+ Kc8 3. Nb6#"
        },
        {
            "fen": "r3r1k1/7p/2pRR1p1/p7/2P5/qnQ1P1P1/6BP/6K1 w - - 1 0",
            "solution": "1. Rxg6+ hxg6 2. Rxg6+ Kh7 3. Qg7#"
        },
        {
            "fen": "4k3/p5p1/2p4r/2NPb3/4p1pr/1P4q1/P1QR1R1P/7K b - - 0 1",
            "solution": "1... Rxh2+ 2. Rxh2 Qe1+ 3. Kg2 Rxh2#"
        },
        {
            "fen": "7k/1p2b2p/1qp2r2/p3pPQ1/8/P2P3P/1P4B1/6RK w - - 1 0",
            "solution": "1. Qg8+ Kxg8 2. Bd5+ Kf8 3. Rg8#"
        },
        {
            "fen": "1r4k1/5bp1/pr1P2p1/1np1p3/2B1P2R/2P2PN1/6K1/R7 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Bxf7 g5 3. Rh1#"
        },
        {
            "fen": "8/pR6/2rp4/2k5/4Q3/5P2/q1PK4/8 w - - 1 0",
            "solution": "1. Qe3+ Kd5 2. Rb5+ Rc5 3. Qe4#"
        },
        {
            "fen": "r4qk1/2p4p/p1p1N3/2bpQ3/4nP2/8/PPP3PP/5R1K b - - 0 1",
            "solution": "1... Ng3+ 2. hxg3 Qh6+ 3. Qh5 Qxh5#"
        },
        {
            "fen": "1R4nr/p1k1ppb1/2p4p/4Pp2/3N1P1B/8/q1P3PP/3Q2K1 w - - 1 0",
            "solution": "1. Ne6+ Kxb8 2. Qd8+ Kb7 3. Nc5#"
        },
        {
            "fen": "5rk1/2R4p/3QP1p1/3p4/4p3/1P5P/q7/2R3K1 w - - 1 0",
            "solution": "1. Qxf8+ Kxf8 2. Rf7+ Ke8 3. Rc8#"
        },
        {
            "fen": "8/7k/1p6/5p2/1P6/4QKPN/2q5/2r5 b - - 0 1",
            "solution": "1... Rf1+ 2. Nf2 Rxf2+ 3. Qxf2 Qe4#"
        },
        {
            "fen": "2q1rb1k/prp3pp/1pn1p3/5p1N/2PP3Q/6R1/PP3PPP/R5K1 w - - 1 0",
            "solution": "1. Nf6 h6 2. Qxh6+ gxh6 3. Rg8#"
        },
        {
            "fen": "2q1b1k1/p5pp/n2R4/1p2P3/2p5/B1P5/5QPP/6K1 w - - 1 0",
            "solution": "1. Qf8+ Kxf8 2. Rf6+ Kg8 3. Rf8#"
        },
        {
            "fen": "1r4k1/1r2ppb1/4bPp1/3pP3/2qB2P1/p7/1PP4Q/2KR3R w - - 1 0",
            "solution": "1. Qh7+ Kf8 2. Qh8+ Bxh8 3. Rxh8#"
        },
        {
            "fen": "4N1k1/1p2qrb1/p1p1np2/2P5/8/4B3/Pp5Q/1K1R3R w - - 1 0",
            "solution": "1. Qh7+ Kf8 2. Qh8+ Bxh8 3. Rxh8#"
        },
        {
            "fen": "r4b2/p5pk/6rn/2n2N1Q/5PP1/2Bq4/PP6/K1R4R b - - 0 1",
            "solution": "1... Nb3+ 2. axb3 Ra6+ 3. Ba5 Rxa5#"
        },
        {
            "fen": "6k1/6p1/4R2p/5R2/1P3PK1/5QP1/6rq/8 w - - 1 0",
            "solution": "1. Rf8+ Kxf8 2. Qa8+ Kf7 3. Qe8#"
        },
        {
            "fen": "2Q5/6pk/5b1p/5P2/3p4/1Rr2qNK/7P/8 b - - 0 1",
            "solution": "1... Qf1+ 2. Kg4 h5+ 3. Nxh5 Qf3#"
        },
        {
            "fen": "3rbk2/2q2p2/p4P1p/1p6/4BP2/P6P/1P1Q3K/6R1 w - - 1 0",
            "solution": "1. Rg8+ Kxg8 2. Qg2+ Kf8 3. Qg7#"
        },
        {
            "fen": "2k5/1b1r1Rbp/p3p3/Bp4P1/3p1Q1P/P7/1PP1q3/1K6 w - - 1 0",
            "solution": "1. Rf8+ Bxf8 2. Qxf8+ Rd8 3. Qxd8#"
        },
        {
            "fen": "8/6k1/3p1rp1/3Bp1p1/1pP1P1K1/4bPR1/P5Q1/4q3 b - - 0 1",
            "solution": "1... Rf4+ 2. Kxg5 Bb6 3. c5 Bd8#"
        },
        {
            "fen": "r2k1r2/3b2pp/p5p1/2Q1R3/1pB1Pq2/1P6/PKP4P/7R w - - 1 0",
            "solution": "1. Qb6+ Kc8 2. Rc5+ Bc6 3. Be6#"
        },
        {
            "fen": "5rk1/4Rp1p/1q1pBQp1/5r2/1p6/1P4P1/2n2P2/3R2K1 w - - 1 0",
            "solution": "1. Bxf7+ Rxf7 2. Re8+ Rf8 3. Rxf8#"
        },
        {
            "fen": "7r/1k3p2/1q1B4/p2pPp2/p1n2P2/2RQ2K1/2P1B1P1/7r b - - 0 1",
            "solution": "1... R1h3+ 2. gxh3 Qg1+ 3. Kf3 Rxh3#"
        },
        {
            "fen": "q1r2b1k/rb4np/1p2p2N/pB1n4/6Q1/1P2P3/PB3PPP/2RR2K1 w - - 1 0",
            "solution": "1. Qxe6 Ne7 2. Qg8+ Nxg8 3. Nf7#"
        },
        {
            "fen": "1Q6/1P2pk1p/5ppB/3q4/P5PK/7P/5P2/6r1 b - - 0 1",
            "solution": "1... Qh5+ 2. gxh5 g5+ 3. Bxg5 fxg5#"
        },
        {
            "fen": "r1r2k1b/pp1n1p1p/4p2P/2Pp4/2P3Q1/BP2P3/P2N1PP1/R3K3 w Q - 1 0",
            "solution": "1. c6+ Ke8 2. Qg8+ Nf8 3. Qxf8#"
        },
        {
            "fen": "6k1/2rB1p2/RB1p2pb/3Pp2p/4P3/3K2NQ/5Pq1/8 b - - 0 1",
            "solution": "1... Qf3+ 2. Be3 Qd1+ 3. Bd2 Qxd2#"
        },
        {
            "fen": "b3r1k1/p4RbN/P3P1p1/1p6/1qp4P/4Q1P1/5P2/5BK1 w - - 1 0",
            "solution": "1. Nf6+ Bxf6 2. Qh6 Rxe6 3. Qh7#"
        },
        {
            "fen": "2q3k1/1p4pp/3R1r2/p2bQ3/P7/1N2B3/1PP3rP/R3K3 b - - 0 1",
            "solution": "1... Rf1+ 2. Kxf1 Qc4+ 3. Ke1 Qe2#"
        },
        {
            "fen": "2r1k3/3n1p2/6p1/1p1Qb3/1B2N1q1/2P1p3/P4PP1/2KR4 w - - 1 0",
            "solution": "1. Qxe5+ Kd8 2. Be7+ Ke8 3. Nd6#"
        },
        {
            "fen": "2B4k/1b4rp/1p6/2p5/2Ppr3/1P2bN1Q/P6P/7K b - - 0 1",
            "solution": "1... Rg1+ 2. Nxg1 Rg4+ 3. Bxb7 Rxg1#"
        },
        {
            "fen": "3R4/1r3pkp/3Np1bp/n3P3/2B5/7P/6P1/6K1 w - - 1 0",
            "solution": "1. Ne8+ Kf8 2. Nf6+ Ke7 3. Re8#"
        },
        {
            "fen": "1n1N2rk/2Q2pb1/p3p2p/Pq2P3/3R4/6B1/1P3P1P/6K1 w - - 1 0",
            "solution": "1. Nxf7+ Kh7 2. Qc2+ Qd3 3. Qxd3#"
        },
        {
            "fen": "6k1/2r4p/p3b1PP/1pq5/4P3/P5Q1/1P2B3/1K3R2 b - - 0 1",
            "solution": "1... Qc2+ 2. Ka1 Qc1+ 3. Rxc1 Rxc1#"
        },
        {
            "fen": "6k1/5pp1/p3p2p/3bP2P/6QN/8/rq4P1/2R4K w - - 1 0",
            "solution": "1. Rc8+ Kh7 2. Qg6+ fxg6 3. hxg6#"
        },
        {
            "fen": "r6r/pp3pk1/2p2Rp1/2p1P2B/3bQ3/6PK/7P/6q1 w - - 1 0",
            "solution": "1. Rxf7+ Kxf7 2. Qxg6+ Ke7 3. Qd6#"
        },
        {
            "fen": "8/8/p3B1bk/b1P3pp/3QP3/1KN3q1/8/8 w - - 1 0",
            "solution": "1. Qh8+ Bh7 2. Qf8+ Kg6 3. Bf5#"
        },
        {
            "fen": "3r1q1r/1p4k1/1pp2pp1/4p3/4P2R/1nP3PQ/PP3PK1/7R w - - 1 0",
            "solution": "1. Rh7+ Kg8 2. Qe6+ Qf7 3. Qxf7#"
        },
        {
            "fen": "7k/1pqr2p1/1R2Q2p/r2p4/6R1/4P2P/5PP1/6K1 w - - 1 0",
            "solution": "1. Qe8+ Kh7 2. Rxh6+ Kxh6 3. Qh8#"
        },
        {
            "fen": "2r3k1/p6R/1p2p1p1/nK4N1/P4P2/3n4/4r1P1/7R b - - 0 1",
            "solution": "1... Rb2+ 2. Ka6 Nc5+ 3. Kxa7 Nc6#"
        },
        {
            "fen": "r6k/1p5p/2p1b1pB/7B/p1P1q2r/8/P5QP/3R2RK b - - 0 1",
            "solution": "1... Rxh2+ 2. Kxh2 Qh4+ 3. Qh3 Qxh3#"
        },
        {
            "fen": "3r1b1k/1p3R2/7p/2p4N/p4P2/2K3R1/PP6/3r4 w - - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Nf6+ Kh8 3. Rg8#"
        },
        {
            "fen": "r5k1/1b2q1p1/p2bp1Qp/1pp5/P5P1/3B4/1PP2P1P/R4RK1 b - - 0 1",
            "solution": "1... Bxh2+ 2. Kxh2 Qh4+ 3. Kg1 Qh1#"
        },
        {
            "fen": "4Q3/p2r2pk/1n5p/8/8/5N1P/q4PP1/4R1K1 w - - 1 0",
            "solution": "1. Ng5+ hxg5 2. Qh5+ Kg8 3. Re8#"
        },
        {
            "fen": "b4rk1/6p1/4p1N1/q3P1Q1/1p1R4/1P5r/P4P2/3R2K1 w - - 1 0",
            "solution": "1. Ne7+ Kf7 2. Qg6+ Kxe7 3. Rd7#"
        },
        {
            "fen": "6k1/pR2p2p/q5p1/3P1p2/6b1/5N2/5PPP/B2B2K1 w - - 1 0",
            "solution": "1. Rb8+ Qc8 2. Rxc8+ Kf7 3. Ng5#"
        },
        {
            "fen": "5r1k/1q4b1/p1b3Qp/1pPNp3/1P2p3/PB5R/6PP/6K1 w - - 1 0",
            "solution": "1. Nf6 Rxf6 2. Rxh6+ Bxh6 3. Qg8#"
        },
        {
            "fen": "1Q1R4/5k2/6pp/2N1bp2/1Bn5/2P2P1P/1r3PK1/8 b - - 0 1",
            "solution": "1... Ne3+ 2. Kg1 Rb1+ 3. Rd1 Rxd1#"
        },
        {
            "fen": "3r2kq/1p2r3/3p1R2/p4Q2/2Pp4/6P1/PPB2PK1/8 w - - 1 0",
            "solution": "1. Qd5+ Re6 2. Qxe6+ Kg7 3. Qf7#"
        },
        {
            "fen": "4kq1Q/p2b3p/1pR5/3B2p1/5Pr1/8/PP5P/7K w - - 1 0",
            "solution": "1. Bf7+ Kxf7 2. Rf6+ Ke8 3. Qxf8#"
        },
        {
            "fen": "r6r/1p2pp1k/p1b2q1p/4pP2/6QR/3B2P1/P1P2K2/7R w - - 1 0",
            "solution": "1. Rxh6+ Qxh6 2. f6+ e4 3. Qg7#"
        },
        {
            "fen": "2rr2k1/1b1q2p1/p2Pp1Qp/1pn1P2P/2p5/8/PP3PP1/1BR2RK1 w - - 1 0",
            "solution": "1. Qh7+ Kf7 2. Bg6+ Kf8 3. Qh8#"
        },
        {
            "fen": "r4rk1/3R3p/1q2pQp1/p7/P7/8/1P5P/4RK2 w - - 1 0",
            "solution": "1. Rg7+ Kh8 2. Rf7+ Kg8 3. Qg7#"
        },
        {
            "fen": "8/5Q2/p1nq3k/1p4pp/1Pn2PP1/P6B/5N1P/6K1 w - - 1 0",
            "solution": "1. fxg5+ Kxg5 2. Ne4+ Kh6 3. g5#"
        },
        {
            "fen": "3r1r2/ppb1qBpk/2pp1R1p/7Q/4P3/2PP2P1/PP4KP/5R2 w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. Qg6+ Kh8 3. Qxh6#"
        },
        {
            "fen": "3rk2r/pQR1np1p/1n4p1/8/3PN2b/1B1qB2P/P4PP1/4K2R w Kk - 1 0",
            "solution": "1. Rxe7+ Bxe7 2. Nf6+ Bxf6 3. Qxf7#"
        },
        {
            "fen": "8/ppp5/6Np/7k/8/1Br1nP1n/P4B1P/1K4R1 w - - 1 0",
            "solution": "1. Nf4+ Nxf4 2. Bf7+ Ng6 3. Bxg6#"
        },
        {
            "fen": "3k4/2p1q1p1/8/1QPPp2p/4Pp2/7P/6P1/7K w - - 1 0",
            "solution": "1. Qb8+ Kd7 2. c6+ Kd6 3. Qb4#"
        },
        {
            "fen": "6r1/r5PR/2p3R1/2Pk1n2/3p4/1P1NP3/4K3/8 w - - 1 0",
            "solution": "1. e4+ Kxe4 2. Re6+ Kd5 3. Re5#"
        },
        {
            "fen": "7k/1b1n1q1p/1p1p4/pP2pP1N/P6b/3pB2P/8/1R1Q2K1 b - - 0 1",
            "solution": "1... Qd5 2. Qf3 Qxf3 3. Nf4 Qh1#"
        },
        {
            "fen": "3Q4/p4p2/4p1bk/4P2p/1p2P2B/7P/6PK/1Brq4 w - - 1 0",
            "solution": "1. Qh8+ Bh7 2. Bg5+ Kxg5 3. Qf6#"
        },
        {
            "fen": "5rk1/1p1r2pp/p2p3q/3P2b1/PP1pP3/5Pp1/4B1P1/2RRQNK1 b - - 0 1",
            "solution": "1... Be3+ 2. Nxe3 Qh2+ 3. Kf1 Qh1#"
        },
        {
            "fen": "5rk1/p1pQ3R/1p4pp/2q1b3/8/2pB3P/PP2N1P1/7K w - - 1 0",
            "solution": "1. Qe6+ Kxh7 2. Qxg6+ Kh8 3. Qh7#"
        },
        {
            "fen": "r4rk1/pp4b1/6pp/2pP4/5pKn/P2B2N1/1PQP1Pq1/1RB2R2 b - - 0 1",
            "solution": "1... Nf3 2. Bxg6 Ne5+ 3. Kh4 Qh2#"
        },
        {
            "fen": "4r1k1/5p1p/p4PpQ/4q3/P6P/6P1/3p3K/8 b - - 0 1",
            "solution": "1... Qe2+ 2. Kh3 Qf1+ 3. Kg4 Qf5#"
        },
        {
            "fen": "r2qr3/p4pk1/1pp3p1/n1Pp2P1/3P1Q2/1P1B4/P4PK1/2R4R w - - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Qxf7+ Kh8 3. Rh1#"
        },
        {
            "fen": "1R1n3k/6pp/2Nr4/P4p2/r7/8/4PPBP/6K1 b - - 0 1",
            "solution": "1... Rd1+ 2. Bf1 Rg4+ 3. Kh1 Rxf1#"
        },
        {
            "fen": "4k1r1/pp2bp2/2p5/3PPP2/1q6/7r/1P2Q2P/2RR3K b - - 0 1",
            "solution": "1... Rxh2+ 2. Qxh2 Qe4+ 3. Qg2 Qxg2#"
        },
        {
            "fen": "1k2r3/pp6/3b4/3P2Q1/8/6P1/PP3q1P/2R4K b - - 0 1",
            "solution": "1... Qf3+ 2. Kg1 Bc5+ 3. Rxc5 Re1#"
        },
        {
            "fen": "rnb1qr2/ppp1Nkp1/3p4/4P1B1/7Q/5N2/PPP3PP/R3K2n w Q - 1 0",
            "solution": "1. Qc4+ d5 2. e6+ Bxe6 3. Ne5#"
        },
        {
            "fen": "5rk1/1bR2pbp/4p1p1/8/1p1P1PPq/1B2P2r/P2NQ2P/5RK1 b - - 0 1",
            "solution": "1... Rg3+ 2. hxg3 Qxg3+ 3. Qg2 Qxg2#"
        },
        {
            "fen": "3R4/r6p/Pkp1N1p1/3p1n2/1P3P2/2P2K2/7P/8 w - - 1 0",
            "solution": "1. Rb8+ Rb7 2. Rxb7+ Kxa6 3. Nc5#"
        },
        {
            "fen": "6k1/p2p3p/2p1p1p1/2Pn2K1/4B1P1/1N3P2/P6r/R4b2 b - - 0 1",
            "solution": "1... Kg7 2. Bxd5 e5 3. Rxf1 h6#"
        },
        {
            "fen": "4k1r1/5p2/p1q5/1p2p2p/6n1/P4bQ1/1P4RP/3NR1BK b - - 0 1",
            "solution": "1... Bxg2+ 2. Qxg2 Nf2+ 3. Nxf2 Qxg2#"
        },
        {
            "fen": "6k1/2P2p2/6p1/4p1Kp/p1R1Pn1P/5P1r/P4P2/8 b - - 0 1",
            "solution": "1... Kg7 2. Rc6 Rg3+ 3. fxg3 Nh3#"
        },
        {
            "fen": "6k1/4R3/p5q1/2pP1Q2/3bn1r1/P7/6PP/5R1K b - - 0 1",
            "solution": "1... Ng3+ 2. hxg3 Qh6+ 3. Qh5 Qxh5#"
        },
        {
            "fen": "3r3k/1b2b1pp/3pp3/p3n1P1/1pPqP2P/1P2N2R/P1QB1r2/2KR3B b - - 0 1",
            "solution": "1... Qa1+ 2. Qb1 Nd3+ 3. Kc2 Qc3#"
        },
        {
            "fen": "r1b1k2r/p5pp/2n1p3/q2pP1B1/n2P1N2/1p1R3Q/PpP1B1PP/1K5R b kq - 0 1",
            "solution": "1... Nc3+ 2. Kxb2 Qxa2+ 3. Kxc3 Qxc2#"
        },
        {
            "fen": "6k1/5p2/3P1Bpp/2b1P3/b1p2p2/p1P5/R5rP/2N1K3 b - - 0 1",
            "solution": "1... Rg1+ 2. Ke2 Bd1+ 3. Kd2 Be3#"
        },
        {
            "fen": "2b2rk1/5qp1/2p4p/8/p3Q1PK/Pn6/1P4BP/3R3R b - - 0 1",
            "solution": "1... g5+ 2. Kh3 Qh5+ 3. Kg3 Qh4#"
        },
        {
            "fen": "k7/p1Qnr2p/b1pB1p2/3p3q/N1p5/3P3P/PPP3P1/6K1 w - - 1 0",
            "solution": "1. Qd8+ Kb7 2. Nc5+ Nxc5 3. Qb8#"
        },
        {
            "fen": "4r1k1/Q4bpp/p7/5N2/1P3qn1/2P5/P1B3PP/R5K1 b - - 0 1",
            "solution": "1... Qxh2+ 2. Kf1 Bc4+ 3. Bd3 Bxd3#"
        },
        {
            "fen": "4r1k1/1b1p1pp1/p1q4p/1p4PQ/2ppr3/P5R1/BPPB1P1P/R4K2 b - - 0 1",
            "solution": "1... Re1+ 2. Rxe1 Qh1+ 3. Rg1 Bg2#"
        },
        {
            "fen": "6k1/p1p3pp/6q1/3pr3/3Nn3/1QP1B1Pb/PP3r1P/R3R1K1 b - - 0 1",
            "solution": "1... Qxg3+ 2. hxg3 Rg2+ 3. Kf1 Nxg3#"
        },
        {
            "fen": "b1r3k1/pq2b1r1/1p3R1p/5Q2/2P5/P4N1P/5PP1/1B2R1K1 w - - 1 0",
            "solution": "1. Qe6+ Kh8 2. Rxh6+ Rh7 3. Rxh7#"
        },
        {
            "fen": "r5k1/p1p3pp/b1p5/3p4/3Nnr2/2P5/PP3qPP/RNQ1R2K b - - 0 1",
            "solution": "1... Bf1 2. Rxf1 Qxf1+ 3. Qxf1 Rxf1#"
        },
        {
            "fen": "7k/1R6/5pP1/1p1Np3/1P2P3/6r1/2PK4/5b2 w - - 1 0",
            "solution": "1. Rh7+ Kg8 2. Nxf6+ Kf8 3. Rf7#"
        },
        {
            "fen": "4r1k1/pb4pp/1p2p3/4Pp2/1P3N2/P2Qn2P/3n1qPK/RBB1R3 b - - 0 1",
            "solution": "1... Nf3+ 2. Kh1 Qxe1+ 3. Qf1 Qxf1#"
        },
        {
            "fen": "8/p2pQ2p/2p1p2k/4Bqp1/2P2P2/P6P/6PK/3r4 w - - 1 0",
            "solution": "1. Qg7+ Kh5 2. g4+ Qxg4 3. Qxh7#"
        },
    ],
    "Мат в 4 хода": [
        {
            "fen": "r5rk/2p1Nppp/3p3P/pp2p1P1/4P3/2qnPQK1/8/R6R w - - 1 0",
            "solution": "1. hxg7+ Rxg7 2. Rxh7+ Rxh7 3. Qf6+ Rg7 4. Rh1#"
        },
        {
            "fen": "1r2k1r1/pbppnp1p/1b3P2/8/Q7/B1PB1q2/P4PPP/3R2K1 w - - 1 0",
            "solution": "1. Qxd7+ Kxd7 2. Bf5+ Ke8 3. Bd7+ Kf8 4. Bxe7#"
        },
        {
            "fen": "Q7/p1p1q1pk/3p2rp/4n3/3bP3/7b/PP3PPK/R1B2R2 b - - 0 1",
            "solution": "1... Bxg2 2. Qh8+ Kxh8 3. Bg5 Qxg5 4. Rfe1 Nf3#"
        },
        {
            "fen": "r1bqr3/ppp1B1kp/1b4p1/n2B4/3PQ1P1/2P5/P4P2/RN4K1 w - - 1 0",
            "solution": "1. Qe5+ Kh6 2. g5+ Kh5 3. Bf3+ Bg4 4. Qh2#"
        },
        {
            "fen": "r1b3kr/3pR1p1/ppq4p/5P2/4Q3/B7/P5PP/5RK1 w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Qe7+ Kg8 3. Qf8+ Kh7 4. Qf7#"
        },
        {
            "fen": "2k4r/1r1q2pp/QBp2p2/1p6/8/8/P4PPP/2R3K1 w - - 1 0",
            "solution": "1. Qa8+ Rb8 2. Rxc6+ Qc7 3. Rxc7+ Kd8 4. Qxb8#"
        },
        {
            "fen": "2r1r3/p3P1k1/1p1pR1Pp/n2q1P2/8/2p4P/P4Q2/1B3RK1 w - - 1 0",
            "solution": "1. f6+ Kh8 2. g7+ Kg8 3. f7+ Kxg7 4. Qf6#"
        },
        {
            "fen": "r1bk3r/pppq1ppp/5n2/4N1N1/2Bp4/Bn6/P4PPP/4R1K1 w - - 1 0",
            "solution": "1. Nexf7+ Qxf7 2. Nxf7+ Kd7 3. Bb5+ c6 4. Re7#"
        },
        {
            "fen": "6kr/pp2r2p/n1p1PB1Q/2q5/2B4P/2N3p1/PPP3P1/7K w - - 1 0",
            "solution": "1. Qg7+ Rxg7 2. e7+ Rf7 3. e8=Q+ Qf8 4. Bxf7#"
        },
        {
            "fen": "r3k3/pbpqb1r1/1p2Q1p1/3pP1B1/3P4/3B4/PPP4P/5RK1 w - - 1 0",
            "solution": "1. Bxg6+ Rxg6 2. Qxg6+ Kd8 3. Rf8+ Qe8 4. Qxe8#"
        },
        {
            "fen": "rnb3kr/ppp4p/3b3B/3Pp2n/2BP4/4KRp1/PPP3q1/RN1Q4 w - - 1 0",
            "solution": "1. Rf8+ Bxf8 2. d6+ Qd5 3. Bxd5+ Be6 4. Bxe6#"
        },
        {
            "fen": "4r3/p4pkp/q7/3Bbb2/P2P1ppP/2N3n1/1PP2KPR/R1BQ4 b - - 0 1",
            "solution": "1... Qf1+ 2. Qxf1 Bxd4+ 3. Be3 Rxe3 4. Bxf7 Re2#"
        },
        {
            "fen": "2r2b2/p2q1P1p/3p2k1/4pNP1/4P1RQ/7K/2pr4/5R2 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. g6+ Kh8 3. Rh4+ Bh6 4. Rxh6#"
        },
        {
            "fen": "rnbk2r1/ppp2Q1p/8/1B1Pp1q1/8/2N3B1/PPP3P1/R5K1 w - - 1 0",
            "solution": "1. Qxg8+ Ke7 2. Qxg5+ Kd6 3. Ne4+ Kxd5 4. Qxe5#"
        },
        {
            "fen": "r1bnk2r/pppp1ppp/1b4q1/4P3/2B1N3/Q1Pp1N2/P4PPP/R3R1K1 w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. exf6+ Qe4 3. Rxe4+ Ne6 4. Qe7#"
        },
        {
            "fen": "8/6pk/3pp2p/4p1nP/1P2P3/3P1rP1/4qPK1/2QN3R b - - 0 1",
            "solution": "1... Rxg3+ 2. Kxg3 Qf3+ 3. Kh4 Qxh1+ 4. Kg3 Qh3#"
        },
        {
            "fen": "6rk/7p/pp3b2/2pbqP2/5Q2/5R1P/P6P/2B2R1K b - - 0 1",
            "solution": "1... Qe2 2. Rg1 Bxf3+ 3. Qxf3 Qxf3+ 4. Rg2 Qxg2#"
        },
        {
            "fen": "r2r4/p1p2p1p/n5k1/1p5N/2p2R2/5N2/P1K3PP/5R2 w - - 1 0",
            "solution": "1. Rf6+ Kxh5 2. g4+ Kxg4 3. Rg1+ Kh5 4. Rg5#"
        },
        {
            "fen": "r1qbr2k/1p2n1pp/3B1n2/2P1Np2/p4N2/PQ4P1/1P3P1P/3RR1K1 w - - 1 0",
            "solution": "1. Nf7+ Kg8 2. Nh6+ Kh8 3. Qg8+ Nexg8 4. Nf7#"
        },
        {
            "fen": "k1K5/7r/8/4B3/1RP5/8/8/8 w - - 1 0",
            "solution": "1. Rb8+ Ka7 2. Bd4+ Ka6 3. Ra8+ Ra7 4. Rxa7#"
        },
        {
            "fen": "2q2r2/5rk1/4pNpp/p2pPn2/P1pP2QP/2P2R2/2B3P1/6K1 w - - 1 0",
            "solution": "1. Qxg6+ Kh8 2. Bxf5 exf5 3. Qxh6+ Rh7 4. Qxh7#"
        },
        {
            "fen": "qr6/1b1p1krQ/p2Pp1p1/4PP2/1p1B1n2/3B4/PP3K1P/2R2R2 w - - 1 0",
            "solution": "1. fxg6+ Kf8 2. Qh8+ Rg8 3. Qf6+ Ke8 4. Qe7#"
        },
        {
            "fen": "r6k/pppb1B2/6Q1/8/3P4/2P1q3/PKP3PP/7R w - - 1 0",
            "solution": "1. Qf6+ Kh7 2. Bg6+ Kg8 3. Qf7+ Kh8 4. Qh7#"
        },
        {
            "fen": "rnb3kr/ppp2ppp/1b6/3q4/3pN3/Q4N2/PPP2KPP/R1B1R3 w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Qf8+ Kxf8 3. Bh6+ Kg8 4. Re8#"
        },
        {
            "fen": "3q1rk1/4bp1p/1n2P2Q/1p1p1p2/6r1/Pp2R2N/1B1P2PP/7K w - - 1 0",
            "solution": "1. Ng5 Rxg5 2. Rh3 Re8 3. Qxh7+ Kf8 4. Qxf7#"
        },
        {
            "fen": "3r1r1k/q2n3p/b1p2ppQ/p1n1p3/Pp2P3/1B1PBR2/1PPN2PP/R5K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Kg7 3. Bh6+ Kh7 4. Bxf8#"
        },
        {
            "fen": "1rb2r1k/pp1p2pp/5n1N/8/P7/1Q6/1PP3PP/4R2K w - - 1 0",
            "solution": "1. Re8 g6 2. Qf7 Ng8 3. Qxg8+ Rxg8 4. Rxg8#"
        },
        {
            "fen": "5rbk/2pq3p/5PQR/p7/3p3R/1P4N1/P5PP/6K1 w - - 1 0",
            "solution": "1. Nf5 Rf7 2. Rg4 Qe8 3. Qg7+ Rxg7 4. fxg7#"
        },
        {
            "fen": "r2q1rk1/ppp1n1p1/1b1p1p2/1B1N2BQ/3pP3/2P3P1/PP3P2/R5K1 w - - 1 0",
            "solution": "1. Bc4 Nxd5 2. Bxd5+ Rf7 3. Qxf7+ Kh7 4. Qh5#"
        },
        {
            "fen": "r2q3r/ppp5/2n4p/4Pbk1/2BP1Npb/P2QB3/1PP3P1/R5K1 w - - 1 0",
            "solution": "1. Qxf5+ Kxf5 2. Bd3+ Kg5 3. Ne6+ Kh5 4. Ng7#"
        },
        {
            "fen": "1rb3k1/ppN2R1p/2n1P1p1/6p1/6B1/8/PPP3PP/6K1 w - - 1 0",
            "solution": "1. Nd5 Bxe6 2. Bxe6 Kh8 3. Nf6 Ne5 4. Rxh7#"
        },
        {
            "fen": "3k1r2/2pb4/2p3P1/2Np1p2/1P6/4nN1R/2P1q3/Q5K1 w - - 1 0",
            "solution": "1. Nb7+ Ke7 2. Qg7+ Ke8 3. Qe5+ Be6 4. Qxe6#"
        },
        {
            "fen": "2k5/p1p1q3/2P3p1/3QP3/7p/7P/1PK3P1/8 w - - 1 0",
            "solution": "1. Qg8+ Qd8 2. Qe6+ Kb8 3. Qb3+ Kc8 4. Qb7#"
        },
        {
            "fen": "2k4r/ppp2p2/2b2B2/7p/6pP/2P1q1bP/PP3N2/R4QK1 b - - 0 1",
            "solution": "1... Bh2+ 2. Kxh2 Qf4+ 3. Kg1 Qg3+ 4. Qg2 Qxg2#"
        },
        {
            "fen": "rnbq1rk1/pp2bp1p/4p1p1/2pp2Nn/5P1P/1P1BP3/PBPP2P1/RN1QK2R w - - 1 0",
            "solution": "1. Qxh5 Bxg5 2. Qxh7+ Kxh7 3. hxg5+ Kg8 4. Rh8#"
        },
        {
            "fen": "2r2r2/7k/5pRp/5q2/3p1P2/6QP/P2B1P1K/6R1 w - - 1 0",
            "solution": "1. Rxh6+ Kxh6 2. Qh4+ Qh5 3. f5+ Kh7 4. Qxh5#"
        },
        {
            "fen": "5r2/pq4k1/1pp1Qn2/2bp1PB1/3R1R2/2P3P1/P6P/6K1 w - - 1 0",
            "solution": "1. Bxf6+ Rxf6 2. Rg4+ Kh7 3. Qg8+ Kh6 4. Rh4#"
        },
        {
            "fen": "3nbr2/4q2p/r3pRpk/p2pQRN1/1ppP2p1/2P5/PPB4P/6K1 w - - 1 0",
            "solution": "1. Nf7+ Rxf7 2. Rh5+ Kg7 3. Rxg6+ Kf8 4. Qh8#"
        },
        {
            "fen": "2rr1k2/5pp1/p2bp3/1p1B4/1PnP2Pq/P1B2P2/2Q1N1P1/R3R1K1 b - - 0 1",
            "solution": "1... Bh2+ 2. Kh1 Bg3+ 3. Kg1 Qh2+ 4. Kf1 Ne3#"
        },
        {
            "fen": "5r1k/3q3p/p1pP4/2p2pQ1/r1P3R1/3P4/6PP/1R4K1 w - - 1 0",
            "solution": "1. Qf6+ Rxf6 2. Rb8+ Qe8 3. Rxe8+ Rf8 4. Rxf8#"
        },
        {
            "fen": "r1b2r2/p2p1pk1/1qp1pN1p/3nP1p1/2B4Q/3R4/PPP2PPP/2K4R w - - 1 0",
            "solution": "1. Qxh6+ Kxh6 2. Rh3+ Kg6 3. Bd3+ Kg7 4. Rh7#"
        },
        {
            "fen": "8/k2r4/p7/2b1Bp2/P3p3/qp4R1/4QP2/1K6 b - - 0 1",
            "solution": "1... Rd1+ 2. Qxd1 Qa2+ 3. Kc1 Ba3+ 4. Bb2 Qxb2#"
        },
        {
            "fen": "rnb2b1r/ppp1n1kp/3p1q2/7Q/4PB2/2N5/PPP3PP/R4RK1 w - - 1 0",
            "solution": "1. Bh6+ Kg8 2. Rxf6 Ng6 3. Qd5+ Be6 4. Qxe6#"
        },
        {
            "fen": "r3r3/3R1Qp1/pqb1p2k/1p4N1/8/4P3/Pb3PPP/2R3K1 w - - 1 0",
            "solution": "1. g4 g6 2. h4 Rh8 3. Qh7+ Rxh7 4. Rxh7#"
        },
        {
            "fen": "r3k2r/pp3p2/2pQ1Pnp/2P1nqp1/8/1B6/PP3PPP/3RR1K1 w - - 1 0",
            "solution": "1. Rxe5+ Qe6 2. Rxe6+ fxe6 3. Qxe6+ Kf8 4. Qf7#"
        },
        {
            "fen": "3rkq1r/1pQ2p1p/p3bPp1/3pR3/8/8/PPP2PP1/1K1R4 w - - 1 0",
            "solution": "1. Rdxd5 Rxd5 2. Rxd5 Qd6 3. Qxd6 Bxd5 4. Qe7#"
        },
        {
            "fen": "r2qrk2/p5b1/2b1p1Q1/1p1pP3/2p1nB2/2P1P3/PP3P2/2KR3R w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Bh6+ Ke7 3. Qh7+ Bg7 4. Qxg7#"
        },
        {
            "fen": "4b3/pkb5/1pp1Bp2/4pPp1/PP2P2r/2PQBq2/8/2KR4 w - - 1 0",
            "solution": "1. Qa6+ Ka8 2. Rd8+ Bb8 3. Rxb8+ Kxb8 4. Qc8#"
        },
        {
            "fen": "2r3k1/4p1nR/p3p1p1/4N3/1p2Q3/1P6/P1Pq4/1K6 w - - 1 0",
            "solution": "1. Rxg7+ Kh8 2. Rh7+ Kxh7 3. Qxg6+ Kh8 4. Nf7#"
        },
        {
            "fen": "r1r3k1/pp1q1p1p/4nBpQ/3pP3/1b5P/3B4/P1P3P1/R2K3R w - - 1 0",
            "solution": "1. h5 Bc3 2. Qxh7+ Kxh7 3. hxg6+ Kg8 4. Rh8#"
        },
        {
            "fen": "R7/8/2p4k/3pqr1p/6pK/3P4/P5B1/6Q1 b - - 0 1",
            "solution": "1... Qf6+ 2. Kg3 Rf3+ 3. Bxf3 Qxf3+ 4. Kh4 Qh3#"
        },
        {
            "fen": "rnbq1bnr/pp1p1p1p/3pk3/3NP1p1/5p2/5N2/PPP1Q1PP/R1B1KB1R w - - 1 0",
            "solution": "1. Nd4+ Kxd5 2. Qb5+ Kxd4 3. c3+ Ke4 4. Bd3#"
        },
        {
            "fen": "4r3/6kp/ppr3P1/3p4/3Pq3/3nBR2/PP4QP/5R1K w - - 1 0",
            "solution": "1. Bh6+ Kxh6 2. Qh3+ Kxg6 3. Rg1+ Qg4 4. Rxg4#"
        },
        {
            "fen": "8/2Q2pk1/3Pp1p1/1b5p/1p3P1P/1P2PK2/6RP/7q b - - 0 1",
            "solution": "1... Qd1+ 2. Re2 Bxe2+ 3. Kg2 Qf1+ 4. Kg3 Qf3#"
        },
        {
            "fen": "rnbq1bkr/pp3p1p/2p3pQ/3N2N1/2B2p2/8/PPPP2PP/R1B1R1K1 w - - 1 0",
            "solution": "1. Re8 Nd7 2. Rxd8 cxd5 3. Bxd5 f3 4. Bxf7#"
        },
        {
            "fen": "r2q2rk/ppp2p1p/3b1pn1/5R1Q/3P4/2P4N/PP4PP/R1B3K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh5+ Kg7 3. Bh6+ Kh7 4. Bf8#"
        },
        {
            "fen": "r4b1r/pppq2pp/2n1b1k1/3n4/2Bp4/5Q2/PPP2PPP/RNB1R1K1 w - - 1 0",
            "solution": "1. Rxe6+ Nf6 2. Qe4+ Kh5 3. Be2+ Ng4 4. Qxg4#"
        },
        {
            "fen": "rnbq1b1r/ppp1pQ1p/1n1p2p1/4P2k/3P4/8/PPP2PPP/RNB1K2R w - - 1 0",
            "solution": "1. Qf4 h6 2. g3 Bg4 3. h3 Qd7 4. hxg4#"
        },
        {
            "fen": "r3rk2/5pR1/pp1q1P1p/8/3p3P/P2B4/1P1Q2b1/1K6 w - - 1 0",
            "solution": "1. Rg8+ Kxg8 2. Qxg2+ Qg3 3. Qxg3+ Kf8 4. Qg7#"
        },
        {
            "fen": "rk6/N4ppp/Qp2q3/3p4/8/8/5PPP/2R3K1 w - - 1 0",
            "solution": "1. Rc8+ Qxc8 2. Qxb6+ Qb7 3. Nc6+ Kc8 4. Qd8#"
        },
        {
            "fen": "4q1rk/pb2bpnp/2r4Q/1p1p1pP1/4NP2/1P3R2/PBn4P/RB4K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Nh5 3. Rxh5+ Kg6 4. Rh6#"
        },
        {
            "fen": "r2Nqb1r/pQ1bp1pp/1pn1p3/1k1p4/2p2B2/2P5/PPP2PPP/R3KB1R w - - 1 0",
            "solution": "1. a4+ Ka5 2. Nxc6+ Bxc6 3. b4+ cxb3 4. Qa6#"
        },
        {
            "fen": "2r3k1/pp3ppp/1qr2n2/3p1Q2/1P6/P2BP2P/5PP1/2R2RK1 w - - 1 0",
            "solution": "1. Qxc8+ Rxc8 2. Rxc8+ Qd8 3. Rxd8+ Ne8 4. Rxe8#"
        },
        {
            "fen": "r1b1rk2/ppq3p1/2nbpp2/3pN1BQ/2PP4/7R/PP3PPP/R5K1 w - - 1 0",
            "solution": "1. Bxf6 gxf6 2. Ng6+ Kg8 3. Qh8+ Kf7 4. Qh7#"
        },
        {
            "fen": "3r1bN1/3p1p1p/pp6/5k2/5P2/P7/1P2PPBq/R2R1K2 w - - 1 0",
            "solution": "1. Rd5+ Kxf4 2. e3+ Kg4 3. Nf6+ Kh4 4. Rh5#"
        },
        {
            "fen": "5rk1/p3R2p/3p2p1/1p1P1P2/2p4q/P1Pn1P2/6P1/R2Q1K1N b - - 0 1",
            "solution": "1... Qxh1+ 2. Ke2 Qxg2+ 3. Ke3 Qf2+ 4. Ke4 gxf5#"
        },
        {
            "fen": "2bk4/6b1/2pNp3/r1PpP1P1/P1pP1Q2/2rq4/7R/6RK w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Qf8+ Kd7 3. Qxc8+ Ke7 4. Qe8#"
        },
        {
            "fen": "4r2k/pp2q2b/2p2p1Q/4rP2/P7/1B5P/1P2R1R1/7K w - - 1 0",
            "solution": "1. Rxe5 fxe5 2. f6 Qd7 3. Qg7+ Qxg7 4. fxg7#"
        },
        {
            "fen": "7k/6p1/2p3pp/1p4qn/4r3/2Pr2P1/PP2BP1K/1Q3R2 b - - 0 1",
            "solution": "1... Rh4+ 2. gxh4 Rh3+ 3. Kxh3 Nf4+ 4. Kh2 Qg2#"
        },
        {
            "fen": "2r2rk1/1b3pp1/4p3/p3P1Q1/1pqP1R2/2P5/PP1B1K1P/R7 w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rg1+ Bg2 3. Rxg2+ Kh7 4. Rh4#"
        },
        {
            "fen": "2q2rk1/4r1bp/bpQp2p1/p2Pp3/P3P2P/1NP1B1K1/1P6/R2R4 b - - 0 1",
            "solution": "1... Rf3+ 2. Kxf3 Qh3+ 3. Kf2 Qh2+ 4. Kf3 Be2#"
        },
        {
            "fen": "3kn3/p1p2Rp1/1p2q3/7p/7P/5QP1/P6K/8 w - - 1 0",
            "solution": "1. Qa8+ Qc8 2. Qd5+ Nd6 3. Qg5+ Ke8 4. Qe7#"
        },
        {
            "fen": "4r3/p1r2p1k/1p2pPpp/2qpP3/3R2P1/1PPQ3R/1P5P/7K w - - 1 0",
            "solution": "1. Rxh6+ Kxh6 2. Qh3+ Kg5 3. Qe3+ Kh4 4. Qh6#"
        },
        {
            "fen": "6rk/Q2n2rp/5p2/3P4/4P3/2q4P/P5P1/5RRK b - - 0 1",
            "solution": "1... Rxg2 2. Qxd7 Qg3 3. Qg7+ Rxg7 4. Rxg2 Qxg2#"
        },
        {
            "fen": "8/Q7/5pkp/2n1q3/8/1B5P/5PP1/6K1 w - - 1 0",
            "solution": "1. Qf7+ Kf5 2. Qh5+ Ke4 3. Qe2+ Kf4 4. Qg4#"
        },
        {
            "fen": "rq3kB1/pp1b1p2/4pB1p/4P3/3P3Q/P1n5/5PPP/R5K1 w - - 1 0",
            "solution": "1. Qxh6+ Ke8 2. Bxf7+ Kxf7 3. Qg7+ Ke8 4. Qe7#"
        },
        {
            "fen": "3r1k1r/p1q2p2/1pp2N1p/n3RQ2/3P4/2p1PR2/PP4PP/6K1 w - - 1 0",
            "solution": "1. Nh7+ Rxh7 2. Qxh7 f5 3. Rexf5+ Ke8 4. Rf8#"
        },
        {
            "fen": "r3r1k1/ppp2p1p/1b3Bp1/4P3/3P1n2/2PB1N2/PP6/2KR3R w - - 1 0",
            "solution": "1. Rxh7 Kxh7 2. Rh1+ Nh5 3. Rxh5+ Kg8 4. Rh8#"
        },
        {
            "fen": "7R/r1p1q1pp/3k4/1p1n1Q2/3N4/8/1PP2PPP/2B3K1 w - - 1 0",
            "solution": "1. Rd8+ Qxd8 2. Qe6+ Kc5 3. Nb3+ Kb4 4. Qe4#"
        },
        {
            "fen": "3rb1k1/ppq3p1/2p1p1p1/6P1/2Pr3R/1P1Q4/P1B4P/5RK1 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Rf8+ Kh7 3. Qh3+ Rh4 4. Qxh4#"
        },
        {
            "fen": "3r4/pk3pq1/Nb2p2p/3n4/2QP4/6P1/1P3PBP/5RK1 w - - 1 0",
            "solution": "1. Rc1 Bc5 2. Qb5+ Bb6 3. Rc7+ Ka8 4. Qc6#"
        },
        {
            "fen": "4r2r/5k2/2p2P1p/p2pP1p1/3P2Q1/6PB/1n5P/6K1 w - - 1 0",
            "solution": "1. Qd7+ Re7 2. Qxe7+ Kg6 3. Qg7+ Kh5 4. Qf7#"
        },
        {
            "fen": "4b3/k1r1q2p/p3p3/3pQ3/2pN4/1R6/P4PPP/1R4K1 w - - 1 0",
            "solution": "1. Nc6+ Bxc6 2. Qd4+ Qc5 3. Qxc5+ Ka8 4. Rb8#"
        },
        {
            "fen": "r7/p1n2p1R/qp1p1k2/3Pp3/bPp1P3/2P1BBN1/3Q2K1/8 w - - 1 0",
            "solution": "1. Bg5+ Kg6 2. Rh6+ Kg7 3. Bf6+ Kg8 4. Rh8#"
        },
        {
            "fen": "r3QnR1/1bk5/pp5q/2b5/2p1P3/P7/1BB4P/3R3K w - - 1 0",
            "solution": "1. Be5+ Bd6 2. Rg7+ Nd7 3. Qxd7+ Kb8 4. Qxb7#"
        },
        {
            "fen": "r5k1/1p4pp/2p1p2r/p2nRp2/P2P1P1P/1P3qP1/1BQ2P2/R5K1 b - - 0 1",
            "solution": "1... Nxf4 2. Qe4 fxe4 3. gxf4 Rxh4 4. Rh5 Qh1#"
        },
        {
            "fen": "5k2/p2Q1pp1/1b5p/1p2PB1P/2p2P2/8/PP3qPK/8 w - - 1 0",
            "solution": "1. Qd6+ Ke8 2. Bd7+ Kd8 3. Bxb5+ Kc8 4. Ba6#"
        },
        {
            "fen": "2br3k/pp3Pp1/1n2p3/1P2N1pr/2P2qP1/8/1BQ2P1P/4R1K1 w - - 1 0",
            "solution": "1. Ng6+ Kh7 2. Nf8+ Kh8 3. Qh7+ Rxh7 4. Ng6#"
        },
        {
            "fen": "3r4/6kp/1p1r1pN1/5Qq1/6p1/PB4P1/1P3P2/6KR w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Nf8+ Kg7 3. Qh7+ Kxf8 4. Qf7#"
        },
        {
            "fen": "5r1k/7p/p2b4/1pNp1p1q/3Pr3/2P2bP1/PP1B3Q/R3R1K1 b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Rh4+ 3. Kg1 Bxg3 4. Bf4 Rh1#"
        },
        {
            "fen": "5rk1/pR6/3Q4/2pPnp1p/P3p2q/4P1N1/5Pp1/6K1 b - - 0 1",
            "solution": "1... Nf3+ 2. Kxg2 Qh2+ 3. Kf1 Qg1+ 4. Ke2 Qe1#"
        },
        {
            "fen": "r4r1k/pp4R1/3pN1p1/3P2Qp/1q2Ppn1/8/6PP/5RK1 w - - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Qe7+ Rf7 3. Qxf7+ Kh6 4. Qg7#"
        },
        {
            "fen": "r7/1p3Q2/2kpr2p/p1p2Rp1/P3Pp2/1P3P2/1B2q1PP/3R3K w - - 1 0",
            "solution": "1. Rxc5+ Kb6 2. Qc7+ Ka7 3. Rxa5+ Qa6 4. Bd4#"
        },
        {
            "fen": "4r1k1/5pbp/3p2p1/1ppP4/pqP5/R4B2/1PQ3PP/1K6 b - - 0 1",
            "solution": "1... Re1+ 2. Bd1 Rxd1+ 3. Ka2 Qxa3+ 4. Kxa3 Ra1#"
        },
        {
            "fen": "4k3/R3n2p/4N3/3p1p2/2b2P2/5BP1/4P1K1/2r5 w - - 1 0",
            "solution": "1. Bh5+ Ng6 2. Rxh7 Rg1+ 3. Kxg1 Bxe2 4. Bxg6#"
        },
        {
            "fen": "1R4Q1/3nr1pp/3p1k2/5Bb1/4P3/2q1B1P1/5P1P/6K1 w - - 1 0",
            "solution": "1. Rf8+ Nxf8 2. Qxf8+ Ke5 3. f4+ Bxf4 4. gxf4#"
        },
        {
            "fen": "r1b2rk1/1p4qp/p5pQ/2nN1p2/2B2P2/8/PPP3PP/2K1R3 w - - 1 0",
            "solution": "1. Ne7+ Kh8 2. Nxg6+ Qxg6 3. Qxf8+ Qg8 4. Qxg8#"
        },
        {
            "fen": "2r2rk1/pp3nbp/2p1bq2/2Pp4/1P1P1PP1/P1NB4/1BQK4/7R w - - 1 0",
            "solution": "1. Bxh7+ Kh8 2. Bg8+ Qh6 3. Rxh6+ Bxh6 4. Qh7#"
        },
        {
            "fen": "r2r4/1p1R3p/5p1k/b1B1Pp2/p4P2/P7/1P5P/1K4R1 w - - 1 0",
            "solution": "1. Bf8+ Rxf8 2. Rd3 Be1 3. Rh3+ Bh4 4. Rxh4#"
        },
        {
            "fen": "R4rk1/4r1p1/1q2p1Qp/1pb5/1n5R/5NB1/1P3PPP/6K1 w - - 1 0",
            "solution": "1. Ng5 Bxf2+ 2. Kh1 Rxa8 3. Qh7+ Kf8 4. Qh8#"
        },
        {
            "fen": "8/4k3/1p2p1p1/pP1pPnP1/P1rPq2p/1KP2R1N/8/5Q2 b - - 0 1",
            "solution": "1... Nxd4+ 2. Ka3 Rxa4+ 3. Kxa4 Qc2+ 4. Ka3 Qb3#"
        },
        {
            "fen": "kb3R2/1p5r/5p2/1P1Q4/p5P1/q7/5P2/4RK2 w - - 1 0",
            "solution": "1. Rxb8+ Ka7 2. Qd4+ Kxb8 3. Re8+ Kc7 4. Qd8#"
        },
        {
            "fen": "8/1p5k/5pp1/7p/P3qP1K/2Q3PP/8/8 b - - 0 1",
            "solution": "1... g5+ 2. Kxh5 Qe2+ 3. Qf3 Qxf3+ 4. g4 Qxh3#"
        },
        {
            "fen": "6k1/pp3ppp/4p3/2P3b1/bPP3P1/3K4/P3Q1q1/1R5R b - - 0 1",
            "solution": "1... Qg3+ 2. Ke4 Bc6+ 3. Kd4 Bf6+ 4. Qe5 Bxe5#"
        },
        {
            "fen": "r7/2p2p2/3p3k/pR1P1Kb1/3P2pr/B1PB1b2/P4P2/1R6 b - - 0 1",
            "solution": "1... g3 2. Bxd6 Bg4+ 3. Ke5 Re8+ 4. Be7 Rxe7#"
        },
        {
            "fen": "r1bq3Q/pppnk1p1/2n1p1P1/3pPr2/1b1P4/1NP5/PP3PP1/R1B1K3 w Q - 0 1",
            "solution": "1. Bg5+ Rf6 2. Bxf6+ gxf6 3. Qg7+ Ke8 4. Qf7#"
        },
        {
            "fen": "2rqrb2/p2nk3/bp2pnQp/4B1p1/3P4/P1N5/1P3PPP/1B1RR1K1 w - - 1 0",
            "solution": "1. Nd5+ exd5 2. Bxf6+ Kd6 3. Be5+ Ke7 4. Bd6#"
        },
        {
            "fen": "2r1rk2/1p2qp1R/4p1p1/1b1pP1N1/p2P4/nBP1Q3/P4PPP/R5K1 w - - 1 0",
            "solution": "1. Rh8+ Kg7 2. Nxe6+ Kxh8 3. Qh6+ Kg8 4. Qg7#"
        },
        {
            "fen": "5nk1/2N2p2/2b2Qp1/p3PpNp/2qP3P/6P1/5P1K/8 w - - 1 0",
            "solution": "1. e6 Be8 2. Nxe8 Nxe6 3. Qxf7+ Kh8 4. Qh7#"
        },
        {
            "fen": "r2Bk2r/pb1n1pQ1/3np3/1p2P3/2p3K1/3p4/PP1b1PPP/R4B1R b - - 0 1",
            "solution": "1... f5+ 2. Kg3 Ne4+ 3. Kf3 Nef6+ 4. Kg3 f4#"
        },
        {
            "fen": "6k1/6p1/3r1n1p/p4p1n/P1N4P/2N5/Q2RK3/7q b - - 0 1",
            "solution": "1... Ng3+ 2. Ke3 Ng4+ 3. Kf4 Nh5+ 4. Kxf5 Qf3#"
        },
        {
            "fen": "8/p5Qp/1p2q2B/2p2rp1/2P3Pk/2P2P2/P6P/6K1 w - - 1 0",
            "solution": "1. Bxg5+ Rxg5 2. Qxh7+ Qh6 3. Qxh6+ Rh5 4. Qxh5#"
        },
        {
            "fen": "rq3rk1/1p1bpp1p/3p2pQ/p2N3n/2BnP1P1/5P2/PPP5/2KR3R w - - 1 0",
            "solution": "1. Nxe7+ Kh8 2. Rxh5 Nb3+ 3. axb3 gxh5 4. Qf6#"
        },
        {
            "fen": "r2r1n2/pp2bk2/2p1p2p/3q4/3PN1QP/2P3R1/P4PP1/5RK1 w - - 1 0",
            "solution": "1. Qg7+ Ke8 2. Qxe7+ Kxe7 3. Rg7+ Ke8 4. Nf6#"
        },
        {
            "fen": "1r4k1/3p3R/4p3/2p1P1qp/2P1Q3/1n1B4/6P1/7K w - - 1 0",
            "solution": "1. Rh8+ Kf7 2. Qh7+ Qg7 3. Bg6+ Ke7 4. Qxg7#"
        },
        {
            "fen": "r2r1k2/pbq2pp1/2p1p1p1/1pP1N1P1/6Q1/P6R/1P3P1P/4R1K1 w - - 1 0",
            "solution": "1. Nxg6+ Ke8 2. Rxe6+ fxe6 3. Qxe6+ Qe7 4. Qxe7#"
        },
        {
            "fen": "q5k1/1b2R1pp/1p3n2/4BQ2/8/7P/5PPK/4r3 w - - 1 0",
            "solution": "1. Rxg7+ Kh8 2. Rxh7+ Kg8 3. Qg6+ Kf8 4. Qf7#"
        },
        {
            "fen": "1R6/4r1pk/pp2N2p/4nP2/2p5/2P3P1/P2P1K2/8 w - - 1 0",
            "solution": "1. Nf8+ Kg8 2. Ng6+ Re8 3. Rxe8+ Kf7 4. Rf8#"
        },
        {
            "fen": "r4rk1/p4pp1/7P/2pp4/3Bn3/8/qPP1QP1P/2KR2R1 w - - 1 0",
            "solution": "1. h7+ Kh8 2. Bxg7+ Kxh7 3. Qh5+ Kg8 4. Qh8#"
        },
        {
            "fen": "r1r2bk1/p4pBp/1p6/3q1N2/n1P5/4R3/P3QPPP/6K1 w - - 1 0",
            "solution": "1. Nh6+ Kxg7 2. Qg4+ Kxh6 3. Rh3+ Qh5 4. Rxh5#"
        },
        {
            "fen": "3q1r2/2n5/p4pkp/3PrN1p/1pP2Q2/1P4BP/P4PP1/R5K1 w - - 1 0",
            "solution": "1. Qxh6+ Kf7 2. Qxh5+ Kg8 3. Qg6+ Kh8 4. Qg7#"
        },
        {
            "fen": "7R/2rr1kp1/p3p3/1p1q1p2/n4P1Q/P4P2/4B2P/6RK w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Qh6+ Kf7 3. Qf8+ Kg6 4. Rh6#"
        },
        {
            "fen": "r2q4/1p2N2k/1P3Qp1/pBnpp3/4b1P1/8/P6P/5RK1 w - - 1 0",
            "solution": "1. Rf3 Qf8 2. Rh3+ Qh6 3. Qf7+ Kh8 4. Rxh6#"
        },
        {
            "fen": "rn3k1r/pbpp1Bbp/1p4pN/4P1B1/3n4/2q3Q1/PPP2PPP/2KR3R w - - 1 0",
            "solution": "1. Be7+ Kxe7 2. Qg5+ Bf6 3. Qxf6+ Kf8 4. Bxg6#"
        },
        {
            "fen": "r1q5/2p2k2/p4Bp1/2Nb1N2/p6Q/7P/nn3PP1/R5K1 w - - 1 0",
            "solution": "1. Qh7+ Kxf6 2. Qe7+ Kxf5 3. g4+ Kf4 4. Qe3#"
        },
        {
            "fen": "r2r1k2/5pRp/pq2pBn1/1p2P2Q/2p4P/2Pn2P1/PP3Pb1/5RK1 w - - 1 0",
            "solution": "1. Rg8+ Kxg8 2. Qh6 Qxf2+ 3. Rxf2 Nxf2 4. Qg7#"
        },
        {
            "fen": "6rk/5p1p/5p2/1p2bP2/1P2R2Q/2q1BBPP/5PK1/r7 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh4+ Kg7 3. Bh6+ Kh7 4. Bf8#"
        },
        {
            "fen": "1qbk2nr/1pNp2Bp/2n1pp2/8/2P1P3/8/Pr3PPP/R2QKB1R w - - 1 0",
            "solution": "1. Nxe6+ Ke7 2. Bf8+ Kf7 3. Qh5+ Kxe6 4. Qd5#"
        },
        {
            "fen": "5Q1R/3qn1p1/p3p1k1/1pp1PpB1/3r3P/5P2/PPP3K1/8 w - - 1 0",
            "solution": "1. Rh6+ gxh6 2. Qf6+ Kh7 3. Qf7+ Kh8 4. Bf6#"
        },
        {
            "fen": "6rk/3b3p/p2b1p2/2pPpP2/2P1B3/1P4q1/P2BQ1PR/6K1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh5+ Kg7 3. Bh6+ Kh7 4. Bf8#"
        },
        {
            "fen": "5r1k/1p1b1p1p/p2ppb2/5P1B/1q6/1Pr3R1/2PQ2PP/5R1K w - - 1 0",
            "solution": "1. Qh6 Rxg3 2. Bg6 Rxg6 3. fxg6 fxg6 4. Qxf8#"
        },
        {
            "fen": "2R2bk1/5rr1/p3Q2R/3Ppq2/1p3p2/8/PP1B2PP/7K w - - 1 0",
            "solution": "1. Rxf8+ Kxf8 2. Rh8+ Rg8 3. Bxb4+ Kg7 4. Qh6#"
        },
        {
            "fen": "3rkb2/pp3R1R/8/2p1P3/3pKB2/6P1/PrP2P2/8 w - - 1 0",
            "solution": "1. Bh6 Bxh6 2. e6 Bf8 3. Rh8 Rxc2 4. Rhxf8#"
        },
        {
            "fen": "3q3r/r4pk1/pp2pNp1/3bP1Q1/7R/8/PP3PPP/3R2K1 w - - 1 0",
            "solution": "1. Ne8+ Kg8 2. Rxh8+ Kxh8 3. Qh6+ Kg8 4. Qg7#"
        },
        {
            "fen": "8/3P1pk1/8/1p5p/1N4p1/2P5/3qb1PP/2R1R1K1 b - - 0 1",
            "solution": "1... Bf3 2. gxf3 gxf3 3. Re2 Qxe2 4. d8=Q Qg2#"
        },
        {
            "fen": "rqr3k1/3bppBp/3p2P1/p7/1n2P3/1p3P2/1PPQ2P1/2KR3R w - - 1 0",
            "solution": "1. gxh7+ Kxg7 2. h8=Q+ Rxh8 3. Qg5+ Kf8 4. Rxh8#"
        },
        {
            "fen": "2k3rr/p4q1p/N2B4/p3PpQ1/3P2n1/8/2P2PPP/1R4K1 w - - 1 0",
            "solution": "1. Nc5 Qc7 2. Qxf5+ Kd8 3. Rb8+ Qxb8 4. Qd7#"
        },
        {
            "fen": "3q1r2/2rbnp2/p3pp1k/1p1p2N1/3P2Q1/P3P3/1P3PPP/5RK1 w - - 1 0",
            "solution": "1. Qh4+ Kg6 2. Qh7+ Kxg5 3. f4+ Kg4 4. Qh3#"
        },
        {
            "fen": "1R2R3/p1r2pk1/3b1pp1/8/2Pr4/4N1P1/P4PK1/8 w - - 1 0",
            "solution": "1. Nf5+ gxf5 2. Rg8+ Kh6 3. Rh8+ Kg5 4. Rbg8#"
        },
        {
            "fen": "r1bq2k1/pp2n1p1/5r2/2p2pNQ/3p4/3P4/PPP2PBP/R3R1K1 w - - 1 0",
            "solution": "1. Rxe7 Rg6 2. Qxg6 Qxe7 3. Qh7+ Kf8 4. Qh8#"
        },
        {
            "fen": "6rk/1b6/p5pB/1q2P2Q/4p2P/6R1/PP4PK/3r4 w - - 1 0",
            "solution": "1. Bg7+ Kxg7 2. Qxg6+ Kf8 3. Qxg8+ Ke7 4. Rg7#"
        },
        {
            "fen": "6r1/p5bk/4N1pp/2B1p3/4Q2N/8/2P2KPP/q7 w - - 1 0",
            "solution": "1. Ng5+ hxg5 2. Qxg6+ Kh8 3. Qh5+ Bh6 4. Qxh6#"
        },
        {
            "fen": "2rq2k1/3bb2p/n2p2pQ/p2Pp3/2P1N1P1/1P5P/6B1/2B2R1K w - - 1 0",
            "solution": "1. Rf7 Kxf7 2. Qxh7+ Ke8 3. Qxg6+ Kf8 4. Bh6#"
        },
        {
            "fen": "5rk1/ppp3pp/8/3pQ3/3P2b1/5rPq/PP1P1P2/R1BB1RK1 b - - 0 1",
            "solution": "1... Qxf1+ 2. Kxf1 Rxf2+ 3. Kg1 Rf1+ 4. Kg2 R8f2#"
        },
        {
            "fen": "r7/5pk1/2p4p/1p1p4/1qnP4/5QPP/2B1RP1K/8 w - - 1 0",
            "solution": "1. Qg4+ Kf8 2. Bh7 Ne3 3. Rxe3 Qxd4 4. Qg8#"
        },
        {
            "fen": "8/r7/3pNb2/3R3p/1p2p3/pPk5/P1P3PP/1K6 w - - 1 0",
            "solution": "1. Rd1 Be5 2. Ng5 d5 3. Rxd5 Bxh2 4. Nxe4#"
        },
        {
            "fen": "r1bqkb2/6p1/p1p4p/1p1N4/8/1B3Q2/PP3PPP/3R2K1 w - - 1 0",
            "solution": "1. Nc7+ Qxc7 2. Qh5+ g6 3. Qxg6+ Ke7 4. Qf7#"
        },
        {
            "fen": "5r1k/p5p1/1p3n1p/1Pp5/2RPp3/P3P2P/2Q3PK/2N1q3 b - d3 0 1",
            "solution": "1... Ng4+ 2. hxg4 Rf1 3. Qf2 Qxf2 4. d5 Qh4#"
        },
        {
            "fen": "r2r2k1/1q4p1/ppb3p1/2bNp3/P1Q5/1N5R/1P4BP/n6K w - - 1 0",
            "solution": "1. Ne7+ Kf8 2. Nxg6+ Ke8 3. Qe6+ Qe7 4. Rh8#"
        },
        {
            "fen": "2r1r3/pp1nbN2/4p3/q7/P1pP2nk/2P2P2/1PQ5/R3R1K1 w - - 1 0",
            "solution": "1. Re4 Kh5 2. Rxg4 Qf5 3. Qh2+ Bh4 4. Qxh4#"
        },
        {
            "fen": "r3r2k/pb1n3p/1p1q1pp1/4p1B1/2BP3Q/2P1R3/P4PPP/4R1K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Kg7 3. Bh6+ Kh7 4. Bf8#"
        },
        {
            "fen": "r1b2rk1/p3Rp1p/3q2pQ/2pp2B1/3b4/3B4/PPP2PPP/4R1K1 w - - 1 0",
            "solution": "1. Qxf8+ Kxf8 2. Bh6+ Kg8 3. Re8+ Qf8 4. Rxf8#"
        },
        {
            "fen": "r1b3kn/2p1q1p1/2p2rP1/p2p1p2/4pP2/1PN1P3/PKPPQ3/3R2NR w - - 1 0",
            "solution": "1. Rxh8+ Kxh8 2. Qh5+ Kg8 3. Qh7+ Kf8 4. Qh8#"
        },
        {
            "fen": "5r1k/2q1r1p1/1npbBpQB/1p1p3P/p2P2R1/P4PP1/1PR2PK1/8 w - - 1 0",
            "solution": "1. Bxg7+ Rxg7 2. Qh6+ Rh7 3. Qxf8+ Bxf8 4. Rg8#"
        },
        {
            "fen": "8/6R1/p2kp2r/qb5P/3p1N1Q/1p1Pr3/PP6/1K5R w - - 1 0",
            "solution": "1. Qe7+ Kc6 2. Rc1+ Bc4 3. Rxc4+ Kb6 4. Qb7#"
        },
        {
            "fen": "r5nr/6Rp/p1NNkp2/1p3b2/2p5/5K2/PP2P3/3R4 w - - 1 0",
            "solution": "1. Nxf5 Kxf5 2. e4+ Ke6 3. Rgd7 Ne7 4. Rxe7#"
        },
        {
            "fen": "2b2k2/2p2r1p/p2pR3/1p3PQ1/3q3N/1P6/2P3PP/5K2 w - - 1 0",
            "solution": "1. Ng6+ hxg6 2. Qd8+ Kg7 3. Rxg6+ Kh7 4. Qg8#"
        },
        {
            "fen": "1Qb2b1r/1p1k1p1p/3p1p2/3p4/p2NPP2/1R6/q1P3PP/4K2R w K - 0 1",
            "solution": "1. Rxb7+ Bxb7 2. Qxb7+ Kd8 3. Nc6+ Ke8 4. Qc8#"
        },
        {
            "fen": "3r2k1/3q2p1/1b3p1p/4p3/p1R1P2N/Pr5P/1PQ3P1/5R1K b - - 0 1",
            "solution": "1... Rxh3+ 2. gxh3 Qxh3+ 3. Qh2 Qxf1+ 4. Qg1 Qxg1#"
        },
        {
            "fen": "3r2k1/pp5p/6p1/2Ppq3/4Nr2/4B2b/PP2P2K/R1Q1R2B b - - 0 1",
            "solution": "1... Rf2+ 2. Kxh3 Rh2+ 3. Kg4 h5+ 4. Kf3 dxe4#"
        },
        {
            "fen": "1q1N4/3k1BQp/5r2/5p2/3P3P/8/3B1PPb/3n3K w - - 1 0",
            "solution": "1. Be6+ Ke8 2. Qd7+ Kf8 3. Bh6+ Rxh6 4. Qf7#"
        },
        {
            "fen": "3r1rk1/ppqn3p/1npb1P2/5B2/2P5/2N3B1/PP2Q1PP/R5K1 w - - 1 0",
            "solution": "1. Qg4+ Kf7 2. Be6+ Kxf6 3. Bh4+ Ke5 4. Qe4#"
        },
        {
            "fen": "2r1k3/2P3R1/3P2K1/6N1/8/8/8/3r4 w - - 1 0",
            "solution": "1. Re7+ Kf8 2. Nh7+ Kg8 3. Nf6+ Kf8 4. Rf7#"
        },
        {
            "fen": "r1b2k1r/pppp4/1bP2qp1/5pp1/4pP2/1BP5/PBP3PP/R2Q1R1K b - - 0 1",
            "solution": "1... Rxh2+ 2. Kxh2 Qh8+ 3. Qh5 Qxh5+ 4. Kg3 Qh4#"
        },
        {
            "fen": "rr2k3/5p2/p1bppPpQ/2p1n1P1/1q2PB2/2N4R/PP4BP/6K1 w - - 1 0",
            "solution": "1. Qf8+ Kd7 2. Qe7+ Kc8 3. Rh8+ Be8 4. Rxe8#"
        },
        {
            "fen": "2r1rk2/p1q3pQ/4p3/1pppP1N1/7p/4P2P/PP3P2/1K4R1 w - - 1 0",
            "solution": "1. Nxe6+ Ke7 2. Rxg7+ Kxe6 3. Qg6+ Kxe5 4. f4#"
        },
        {
            "fen": "r2r2k1/1p3pb1/q2p2p1/3PnN1R/p1P1p3/N6Q/PP5P/1K4R1 w - - 1 0",
            "solution": "1. Rh7 Bf6 2. Qh6 Nd3 3. Rg7+ Bxg7 4. Qxg7#"
        },
        {
            "fen": "6k1/6pp/p3p3/1pb5/5P2/PQ3RKP/1P3P1B/3r3q b - - 0 1",
            "solution": "1... Rg1+ 2. Bxg1 Qxg1+ 3. Kh4 Be7+ 4. Kh5 Qg6#"
        },
        {
            "fen": "5k2/6r1/p7/2p1P3/1p2Q3/8/1q4PP/3R2K1 w - - 1 0",
            "solution": "1. Rd8+ Ke7 2. Qh4+ Rg5 3. Qxg5+ Ke6 4. Qf6#"
        },
        {
            "fen": "k1b4r/1p6/pR3p2/P1Qp2p1/2pp4/6PP/2P2qBK/8 w - - 1 0",
            "solution": "1. Rxa6+ bxa6 2. Qxd5+ Kb8 3. Qd6+ Ka7 4. Qb6#"
        },
        {
            "fen": "4R3/2p2kpQ/3p3p/p2r2q1/8/1Pr2P2/P1P3PP/4R1K1 w - - 1 0",
            "solution": "1. Rf8+ Kxf8 2. Qh8+ Kf7 3. Qe8+ Kf6 4. Qe6#"
        },
        {
            "fen": "r1b4k/1p4qp/p7/4p2P/2B5/6Q1/PPP3P1/2K2R2 w - - 1 0",
            "solution": "1. Rf8+ Qxf8 2. Qxe5+ Qg7 3. Qe8+ Qg8 4. Qxg8#"
        },
        {
            "fen": "r1b2n2/2q3rk/p3p2n/1p3p1P/4N3/PN1B1P2/1PPQ4/2K3R1 w - - 1 0",
            "solution": "1. Nf6+ Kh8 2. Qxh6+ Nh7 3. Qxh7+ Rxh7 4. Rg8#"
        },
        {
            "fen": "r2qr1k1/1p3pP1/p2p1np1/2pPp1B1/2PnP1b1/2N2p2/PP1Q4/2KR1BNR w - - 1 0",
            "solution": "1. Bxf6 Bh5 2. Qh6 Nb3+ 3. axb3 Qxf6 4. Qh8#"
        },
        {
            "fen": "5k2/ppqrRB2/3r1p2/2p2p2/7P/P1PP2P1/1P2QP2/6K1 w - - 1 0",
            "solution": "1. Re8+ Kxf7 2. Qh5+ Kg7 3. Rh8 Rxd3 4. Qh7#"
        },
        {
            "fen": "4n3/pbq2rk1/1p3pN1/8/2p2Q2/Pn4N1/B4PP1/4R1K1 w - - 1 0",
            "solution": "1. Nf5+ Kxg6 2. Qh6+ Kxf5 3. Qh5+ Kf4 4. g3#"
        },
        {
            "fen": "r4k2/PR6/1b6/4p1Np/2B2p2/2p5/2K5/8 w - - 1 0",
            "solution": "1. Nh7+ Ke8 2. Nf6+ Kd8 3. Rd7+ Kc8 4. Ba6#"
        },
        {
            "fen": "8/5R1p/4p1p1/3pN1k1/1rnP4/p3P3/P1K2PPP/8 w - - 1 0",
            "solution": "1. f4+ Kh6 2. Ng4+ Kh5 3. Nf6+ Kh6 4. Rxh7#"
        },
        {
            "fen": "br1qr1k1/b1pnnp2/p2p2p1/P4PB1/3NP2Q/2P3N1/B5PP/R3R1K1 w - - 1 0",
            "solution": "1. Bxf7+ Kf8 2. Qh8+ Kxf7 3. Qh7+ Kf8 4. Bh6#"
        },
        {
            "fen": "6k1/ppR3pp/8/3Np3/1Q4bP/6P1/PP2qbK1/8 w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Qe7+ Kg6 3. Qf6+ Kh5 4. Qg5#"
        },
        {
            "fen": "r3r3/1q2Pk1p/pn1Q2p1/1p3pB1/8/5N2/P5PP/2R1b2K w - - 1 0",
            "solution": "1. Ne5+ Kg7 2. Qf6+ Kg8 3. Qf7+ Kh8 4. Bf6#"
        },
        {
            "fen": "1r3rk1/1nqb2n1/6R1/1p1Pp3/1Pp3p1/2P4P/2B2QP1/2B2RK1 w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Bh6+ Kxh6 3. Qh4+ Kg7 4. Qh7#"
        },
        {
            "fen": "n2q1r1k/4bp1p/4p3/4P1p1/2pPNQ2/2p4R/5PPP/2B3K1 w - - 1 0",
            "solution": "1. Nf6 Bxf6 2. Qe4 h5 3. Rxh5+ Kg8 4. Qh7#"
        },
        {
            "fen": "3r2k1/6p1/3Np2p/2P1P3/1p2Q1Pb/1P3R1P/1qr5/5RK1 w - - 1 0",
            "solution": "1. Rf8+ Rxf8 2. Rxf8+ Kxf8 3. Qa8+ Ke7 4. Qe8#"
        },
        {
            "fen": "1qr2bk1/pb3pp1/1pn3np/3N2NQ/8/P7/BP3PPP/2B1R1K1 w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Qxg6+ Bg7 3. Bxf7+ Kf8 4. Nh7#"
        },
        {
            "fen": "1r4k1/7R/p2p4/P5q1/1P2B3/5Pb1/2Q3K1/8 w - - 1 0",
            "solution": "1. Bd5+ Kf8 2. Rf7+ Ke8 3. Qc6+ Kd8 4. Qd7#"
        },
        {
            "fen": "3q4/8/r1b4Q/2P2kp1/p2p4/P7/1P5P/4R1K1 w - - 1 0",
            "solution": "1. Qe6+ Kf4 2. h3 Bd7 3. Qe5+ Kf3 4. Rf1#"
        },
        {
            "fen": "6k1/p2R1p1p/5bp1/8/Pn2R1K1/1r6/7P/8 b - - 0 1",
            "solution": "1... h5+ 2. Kf4 g5+ 3. Kf5 Rf3+ 4. Rf4 Rxf4#"
        },
        {
            "fen": "r1b2k1r/2q1b3/p3ppBp/2n3B1/1p6/2N4Q/PPP3PP/2KRR3 w - - 1 0",
            "solution": "1. Bxh6+ Rxh6 2. Qxh6+ Kg8 3. Qh7+ Kf8 4. Qf7#"
        },
        {
            "fen": "r4n1k/ppBnN1p1/2p1p3/6Np/q2bP1b1/3B4/PPP3PP/R4Q1K w - - 1 0",
            "solution": "1. Qf7 Nf6 2. e5 Bxe5 3. Qg8+ Nxg8 4. Nf7#"
        },
        {
            "fen": "r3k1r1/pp2bp1p/2ppb3/7P/3qP1n1/2N5/PPPQB1P1/R1B1KR2 b - - 0 1",
            "solution": "1... Bh4+ 2. g3 Bxg3+ 3. Rf2 Bxf2+ 4. Kd1 Ne3#"
        },
        {
            "fen": "6k1/1p5p/p2p1q2/3Pb3/1Q2P3/3b1BpP/PPr3P1/KRN5 b - - 0 1",
            "solution": "1... Bxb2+ 2. Qxb2 Qxb2+ 3. Rxb2 Rxc1+ 4. Rb1 Rxb1#"
        },
        {
            "fen": "5q2/p7/3R4/3Q2p1/5pk1/4p1P1/P6P/2r2NK1 w - - 1 0",
            "solution": "1. h3+ Kxh3 2. Qe6+ g4 3. Qh6+ Qxh6 4. Rxh6#"
        },
        {
            "fen": "5q1k/p3R1rp/2pr2p1/1pN2bP1/3Q1P2/1B6/PP5P/2K5 w - - 1 0",
            "solution": "1. Qxg7+ Qxg7 2. Re8+ Qf8 3. Rxf8+ Kg7 4. Rg8#"
        },
        {
            "fen": "6rk/2p2p1p/p2q1p1Q/2p1pP2/1nP1R3/1P5P/P5P1/2B3K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh4+ Kg7 3. Bh6+ Kh7 4. Bf8#"
        },
        {
            "fen": "4rbkr/3Q2pp/p7/1ppb4/8/1NP5/PP2qPPP/R1B2RK1 b - - 0 1",
            "solution": "1... Qxf1+ 2. Kxf1 Bc4+ 3. Qd3 Bxd3+ 4. Kg1 Re1#"
        },
        {
            "fen": "6k1/5pb1/3p1n2/q1pP2Q1/2P4p/1r2R2P/5PPB/4R1K1 w - - 1 0",
            "solution": "1. Re8+ Nxe8 2. Rxe8+ Kh7 3. Qf5+ Kh6 4. Bf4#"
        },
        {
            "fen": "r3rk2/6b1/q2pQBp1/1NpP4/1n2PP2/nP6/P3N1K1/R6R w - - 1 0",
            "solution": "1. Bxg7+ Kxg7 2. Rh7+ Kxh7 3. Qf7+ Kh8 4. Rh1#"
        },
        {
            "fen": "5r1k/7b/4B3/6K1/3R1N2/8/8/8 w - - 1 0",
            "solution": "1. Ng6+ Bxg6 2. Kxg6 Rg8+ 3. Bxg8 Kxg8 4. Rd8#"
        },
        {
            "fen": "2r3k1/pp4rp/1q1p2pQ/1N2p1PR/2nNP3/5P2/PPP5/2K4R w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rxh7+ Kf8 3. Rh8+ Ke7 4. R1h7#"
        },
        {
            "fen": "5n1k/rq4rp/p1bp1b2/2p1pP1Q/P1B1P2R/2N3R1/1P4PP/6K1 w - - 1 0",
            "solution": "1. Qxh7+ Nxh7 2. Rxh7+ Kxh7 3. Rh3+ Bh4 4. Rxh4#"
        },
        {
            "fen": "r5k1/pbpn2pp/1p1pp1r1/5p2/1PPP3q/P3P1P1/3Q1P1P/R1BB1RK1 b - - 0 1",
            "solution": "1... Qxh2+ 2. Kxh2 Rh6+ 3. Bh5 Rxh5+ 4. Kg1 Rh1#"
        },
        {
            "fen": "rnbqkb1r/np1p2pp/p1p1pp2/3PP3/2P2P2/P1NB4/1P4PP/R1BQK1NR w KQkq - 0 1",
            "solution": "1. Qh5+ g6 2. Bxg6+ hxg6 3. Qxg6+ Ke7 4. d6#"
        },
        {
            "fen": "3q1r2/6k1/p2pQb2/4pR1p/4B3/2P3P1/P4PK1/8 w - - 1 0",
            "solution": "1. Rg5+ Kh6 2. Qf5 Qe8 3. Rg6+ Kh7 4. Qxh5#"
        },
        {
            "fen": "rn2rk2/p1q1Nppp/1p4b1/2pP2Q1/2P5/6P1/PB3P1P/2R1R1K1 w - - 1 0",
            "solution": "1. Bxg7+ Kxg7 2. Nf5+ Kf8 3. Qh6+ Kg8 4. Rxe8#"
        },
        {
            "fen": "3q4/1p3p1k/1P1prPp1/P1rNn1Qp/8/7R/6PP/3R2K1 w - - 1 0",
            "solution": "1. Rxh5+ Kg8 2. Rh8+ Kxh8 3. Qh6+ Kg8 4. Qg7#"
        },
        {
            "fen": "2r2bk1/2qn1ppp/pn1p4/5N2/N3r3/1Q6/5PPP/BR3BK1 w - - 1 0",
            "solution": "1. Nh6+ gxh6 2. Qg3+ Rg4 3. Qxg4+ Bg7 4. Qxg7#"
        },
        {
            "fen": "3r1kbR/1p1r2p1/2qp1n2/p3pPQ1/P1P1P3/BP6/2B5/6RK w - - 1 0",
            "solution": "1. Qxf6+ Rf7 2. Rxg7 Qxe4+ 3. Bxe4 Ke8 4. Qxf7#"
        },
        {
            "fen": "rnb2rk1/ppp2qb1/6pQ/2pN1p2/8/1P3BP1/PB2PP1P/R4RK1 w - - 1 0",
            "solution": "1. Ne7+ Qxe7 2. Bd5+ Be6 3. Bxe6+ Rf7 4. Qxg7#"
        },
        {
            "fen": "2rqr1k1/1p2bp1p/pn4p1/3p1bP1/3B3Q/2NR2R1/PPP1NP1P/1K6 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Bxh3 3. Rxh3+ Kg8 4. Rh8#"
        },
        {
            "fen": "4rk2/pb1Q1p2/6p1/3p2p1/2pP4/2q1PPK1/Pr4P1/1B2R2R w - - 1 0",
            "solution": "1. Rh8+ Kg7 2. Rh7+ Kxh7 3. Qxf7+ Kh8 4. Rh1#"
        },
        {
            "fen": "r1b1r1k1/p1q3p1/1pp1pn1p/8/3PQ3/B1PB4/P5PP/R4RK1 w - - 1 0",
            "solution": "1. Rxf6 gxf6 2. Qg6+ Kh8 3. Qxe8+ Kg7 4. Qf8#"
        },
        {
            "fen": "2r2k2/pb4bQ/1p1qr1pR/3p1pB1/3Pp3/2P5/PPB2PP1/1K5R w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rh7+ Kg8 3. Rh8+ Kf7 4. R1h7#"
        },
        {
            "fen": "8/4k2p/5p1b/q2bpP2/4B3/8/1PK4P/3QR3 b - - 0 1",
            "solution": "1... Qa4+ 2. Kb1 Ba2+ 3. Ka1 Bb3+ 4. Kb1 Qa2#"
        },
        {
            "fen": "8/1p3pkp/6p1/6P1/5n2/p5q1/PP1Q2P1/3R2K1 w - - 1 0",
            "solution": "1. Qd4+ Kg8 2. Qd8+ Kg7 3. Qf6+ Kg8 4. Rd8#"
        },
        {
            "fen": "r1r3k1/3NQppp/q3p3/8/8/P1B1P1P1/1P1R1PbP/3K4 b - - 0 1",
            "solution": "1... Qf1+ 2. Kc2 Be4+ 3. Rd3 Qxd3+ 4. Kb3 Qc4#"
        },
        {
            "fen": "r3b3/1p3N1k/n4p2/p2PpP2/n7/6P1/1P1QB1P1/4K3 w - - 1 0",
            "solution": "1. Qh6+ Kg8 2. Qh8+ Kxf7 3. d6 Nb6 4. Bh5#"
        },
        {
            "fen": "5Q2/8/6p1/2p4k/p1Bpq2P/6PK/P2b4/8 w - - 1 0",
            "solution": "1. Qh8+ Bh6 2. Qe5+ g5 3. Bf7+ Qg6 4. g4#"
        },
        {
            "fen": "2Rr1qk1/5ppp/p2N4/P7/5Q2/8/1r4PP/5BK1 w - - 1 0",
            "solution": "1. Qxf7+ Qxf7 2. Rxd8+ Qf8 3. Bc4+ Kh8 4. Rxf8#"
        },
        {
            "fen": "2qk1r2/Q3pr2/3p2pn/7p/5P2/4B2P/P1P3P1/1R4K1 w - - 1 0",
            "solution": "1. Bb6+ Ke8 2. Qa4+ Qd7 3. Qa8+ Qd8 4. Qxd8#"
        },
        {
            "fen": "rnb3kb/pp5p/4p1pB/q1p2pN1/2r1PQ2/2P5/P4PPP/2R2RK1 w - - 1 0",
            "solution": "1. Qd6 Bg7 2. Qe7 Qc7 3. Qe8+ Bf8 4. Qxf8#"
        },
        {
            "fen": "3Q4/4r1pp/b6k/6R1/8/1qBn1N2/1P4PP/6KR w - - 1 0",
            "solution": "1. Bxg7+ Rxg7 2. Qf6+ Rg6 3. Qf8+ Rg7 4. Qxg7#"
        },
        {
            "fen": "2r5/1p5p/3p4/pP1P1R2/1n2B1k1/8/1P3KPP/8 w - - 1 0",
            "solution": "1. h3+ Kh4 2. g3+ Kxh3 3. Rh5+ Kg4 4. Bf3#"
        },
        {
            "fen": "8/5r1p/R3pk2/2NR1np1/2P2r2/1P5K/P6P/8 b - - 0 1",
            "solution": "1... g4+ 2. Kg2 Ne3+ 3. Kg3 Rf3+ 4. Kh4 Rh3#"
        },
        {
            "fen": "r1b1kr2/3q1p2/p1Q5/3p3p/8/3B4/PPP2PPP/R5K1 w q - 0 1",
            "solution": "1. Re1+ Kd8 2. Qb6+ Qc7 3. Qf6+ Qe7 4. Qxe7#"
        },
        {
            "fen": "5r2/R4Nkp/1p4p1/2nR2N1/5p2/7P/6PK/1r6 w - - 1 0",
            "solution": "1. Nh6+ Nb7 2. Rxb7+ Rf7 3. Rxf7+ Kxh6 4. Rxh7#"
        },
        {
            "fen": "8/8/5K2/6r1/8/8/5Q1p/7k w - - 1 0",
            "solution": "1. Qf1+ Rg1 2. Qf3+ Rg2 3. Qe4 Kg1 4. Qe1#"
        },
        {
            "fen": "6k1/4pp2/2q3pp/R1p1Pn2/2N2P2/1P4rP/1P3Q1K/8 b - - 0 1",
            "solution": "1... Rxh3+ 2. Kxh3 Qh1+ 3. Qh2 Qf3+ 4. Qg3 Qxg3#"
        },
        {
            "fen": "4kb1Q/5p2/1p6/1K1N4/2P2P2/8/q7/8 w - - 1 0",
            "solution": "1. Qe5+ Kd7 2. Qc7+ Ke6 3. Qc8+ Kd6 4. Qc6#"
        },
        {
            "fen": "q3r3/4b1pn/pNrp2kp/1p6/4P3/1Q2B3/PPP1B1PP/7K w - - 1 0",
            "solution": "1. Bh5+ Kxh5 2. Qf7+ g6 3. Qf3+ Kh4 4. Qh3#"
        },
        {
            "fen": "r4r1k/1p3p1p/pp1p1p2/4qN1R/PP2P1n1/6Q1/5PPP/R5K1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh4+ Nh6 3. Qxh6+ Kg8 4. Qg7#"
        },
        {
            "fen": "r3rn1k/4b1Rp/pp1p2pB/3Pp3/P2qB1Q1/8/2P3PP/5R1K w - - 1 0",
            "solution": "1. Rxf8+ Bxf8 2. Rxh7+ Kxh7 3. Qxg6+ Kh8 4. Qh7#"
        },
        {
            "fen": "r1r3k1/1bq2pbR/p5p1/1pnpp1B1/3NP3/3B1P2/PPPQ4/1K5R w - - 1 0",
            "solution": "1. Bf6 Bxf6 2. Qh6 Ne6 3. Rh8+ Bxh8 4. Qxh8#"
        },
        {
            "fen": "rk3q1r/pbp4p/1p3P2/2p1N3/3p2Q1/3P4/PPP3PP/R3R1K1 w - - 1 0",
            "solution": "1. Nd7+ Kc8 2. Nxf8+ Kb8 3. Re8+ Bc8 4. Qxc8#"
        },
        {
            "fen": "3r3k/6pp/p3Qn2/P3N3/4q3/2P4P/5PP1/6K1 w - - 1 0",
            "solution": "1.Nf7+ Kg8 2.Nh6+ Kh8 3.Qg8+ Rxg8 4.Nf7#"
        },
        {
            "fen": "4k3/2q2p2/4p3/3bP1Q1/p6R/r6P/6PK/5B2 w - - 1 0",
            "solution": "1. Bb5+ Bc6 2. Bxc6+ Qxc6 3. Rh8+ Kd7 4. Qd8#"
        },
        {
            "fen": "3r1b2/3P1p2/p3rpkp/2q2N2/5Q1R/2P3BP/P5PK/8 w - - 1 0",
            "solution": "1. Rxh6+ Bxh6 2. Qxh6+ Kxf5 3. Qh5+ Ke4 4. Qf3#"
        },
        {
            "fen": "r3kr2/ppq3bp/2np2p1/2pBp1B1/4P1Q1/2PP4/PP3PPP/R3K2R w KQq - 0 1",
            "solution": "1. Bxc6+ Kf7 2. Bd5+ Ke8 3. Qe6+ Qe7 4. Qxe7#"
        },
        {
            "fen": "r2qr1k1/1p1n2pp/2b1p3/p2pP1b1/P2P1Np1/3BPR2/1PQB3P/5RK1 w - - 1 0",
            "solution": "1. Bxh7+ Kh8 2. Ng6+ Kxh7 3. Nf8+ Kg8 4. Qh7#"
        },
        {
            "fen": "7r/pRpk4/2np2p1/5b2/2P4q/2b1BBN1/P4PP1/3Q1K2 b - - 0 1",
            "solution": "1... Bd3+ 2. Qxd3 Qh1+ 3. Nxh1 Rxh1+ 4. Ke2 Re1#"
        },
        {
            "fen": "1r3rk1/5p1p/pp2b1p1/4n3/4PP2/1BP1B1Pq/P6P/R1QR2K1 b - - 0 1",
            "solution": "1... Nf3+ 2. Kf2 Qxh2+ 3. Kxf3 Bg4+ 4. Kxg4 Qh5#"
        },
        {
            "fen": "2q2r1k/5Qp1/4p1P1/3p4/r6b/7R/5BPP/5RK1 w - - 1 0",
            "solution": "1. Bxh4 Rxf7 2. Be7+ Rh4 3. Rxh4+ Kg8 4. gxf7#"
        },
        {
            "fen": "1r2k3/2pn1p2/p1Qb3p/7q/3PP3/2P1BN1b/PP1N1Pr1/RR5K b - - 0 1",
            "solution": "1... Rg1+ 2. Nxg1 Bf1+ 3. Nh3 Qxh3+ 4. Kg1 Qg2#"
        },
        {
            "fen": "r1bqr3/4pkbp/2p1N2B/p2nP1Q1/2pP4/2N2P2/PP4P1/R3K2R w - - 1 0",
            "solution": "1. Qxg7+ Kxe6 2. Qg4+ Kf7 3. e6+ Bxe6 4. Qg7#"
        },
        {
            "fen": "3R4/rr2pp1k/1p1p1np1/1B1Pq2p/1P2P3/5P2/3Q2PP/2R3K1 w - - 1 0",
            "solution": "1. Rh8+ Kxh8 2. Qh6+ Kg8 3. Rc8+ Ne8 4. Rxe8#"
        },
        {
            "fen": "3Rr2k/pp4pb/2p4p/2P1n3/1P1Q3P/4r1q1/PB4B1/5RK1 b - - 0 1",
            "solution": "1... Nf3+ 2. Rxf3 Re1+ 3. Rf1 Rxf1+ 4. Kxf1 Qe1#"
        },
        {
            "fen": "5r2/1pP1b1p1/pqn1k2p/4p3/QP2BP2/P3P1PK/3R4/3R4 w - - 1 0",
            "solution": "1. Qb3+ Kf6 2. Rd6+ Bxd6 3. Rxd6+ Ke7 4. Qe6#"
        },
        {
            "fen": "4r3/2B4B/2p1b3/ppk5/5R2/P2P3p/1PP5/1K5R w - - 1 0",
            "solution": "1. b4+ axb4 2. axb4+ Kd5 3. c4+ bxc4 4. dxc4#"
        },
        {
            "fen": "1r3r1k/6R1/1p2Qp1p/p1p4N/3pP3/3P1P2/PP2q2P/5R1K w - - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Qe7+ Kg6 3. Qg7+ Kxh5 4. Qg4#"
        },
        {
            "fen": "r1bq1rk1/4np1p/1p3RpB/p1Q5/2Bp4/3P4/PPP3PP/R5K1 w - - 1 0",
            "solution": "1. Qe5 Nf5 2. Rxf5 Qf6 3. Qxf6 Bxf5 4. Qg7#"
        },
        {
            "fen": "2rr3k/1p1b1pq1/4pNp1/Pp2Q2p/3P4/7R/5PPP/4R1K1 w - - 1 0",
            "solution": "1. Rxh5+ Qh6 2. Rxh6+ Kg7 3. Rh7+ Kf8 4. Qd6#"
        },
        {
            "fen": "3rnn2/p1r2pkp/1p2pN2/2p1P3/5Q1N/2P3P1/PP2qPK1/R6R w - - 1 0",
            "solution": "1. Qg5+ Ng6 2. Nf5+ exf5 3. Qh6+ Kh8 4. Qxh7#"
        },
        {
            "fen": "r3r1n1/pp3pk1/2q2p1p/P2NP3/2p1QP2/8/1P5P/1B1R3K w - - 1 0",
            "solution": "1. Rg1+ Kf8 2. Rxg8+ Kxg8 3. Qh7+ Kf8 4. Qh8#"
        },
        {
            "fen": "4Br1k/p5pp/1n6/8/3PQbq1/6P1/PP5P/RNB3K1 b - - 0 1",
            "solution": "1... Be3+ 2. Qxe3 Qd1+ 3. Qe1 Qxe1+ 4. Kg2 Qf1#"
        },
        {
            "fen": "5rk1/pR4bp/6p1/6B1/5Q2/4P3/q2r1PPP/5RK1 w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Bh6+ Kh8 3. Qxf8+ Qg8 4. Bg7#"
        },
        {
            "fen": "1r2r3/2p2pkp/p1b2Np1/4P3/2p4P/qP4N1/2P2QP1/5RK1 w - - 1 0",
            "solution": "1. Nfh5+ gxh5 2. Nxh5+ Kh6 3. Qf6+ Kxh5 4. Qg5#"
        },
        {
            "fen": "1b4rk/4R1pp/p1b4r/2PB4/Pp1Q4/6Pq/1P3P1P/4RNK1 w - - 1 0",
            "solution": "1. Qxg7+ Rxg7 2. Re8+ Bxe8 3. Rxe8+ Rg8 4. Rxg8#"
        },
        {
            "fen": "4k2r/1R3R2/p3p1pp/4b3/1BnNr3/8/P1P5/5K2 w - - 1 0",
            "solution": "1. Rfe7+ Kd8 2. Nc6+ Kc8 3. Na7+ Kd8 4. Rbd7#"
        },
        {
            "fen": "1R2n1k1/r3pp1p/6p1/3P4/P1p2B2/6P1/5PKP/b7 w - - 1 0",
            "solution": "1. Bh6 Ra8 2. Rxa8 f5 3. Rxe8+ Kf7 4. Rf8#"
        },
        {
            "fen": "r1b1k2N/pppp2pp/2n5/2b1p3/2B1n2q/2N3P1/PPPP1P1P/R1BQK2R b KQq - 0 1",
            "solution": "1... Bxf2+ 2. Kf1 Qh3+ 3. Ke2 Nd4+ 4. Kd3 Nc5#"
        },
        {
            "fen": "2r4k/ppqbpQ1p/3p1bpB/8/8/1Nr2P2/PPP3P1/2KR3R w - - 1 0",
            "solution": "1. Bg7+ Bxg7 2. Rxh7+ Kxh7 3. Rh1+ Bh3 4. Rxh3#"
        },
        {
            "fen": "r1brn3/p1q4p/p1p2P1k/2PpPPp1/P7/1Q2B2P/1P6/1K1R1R2 w - - 1 0",
            "solution": "1. Bxg5+ Kxg5 2. Qg3+ Kh5 3. Qg4+ Kh6 4. Qh4#"
        },
        {
            "fen": "r1qr3k/3R2p1/p3Q3/1p2p1p1/3bN3/8/PP3PPP/5RK1 w - - 1 0",
            "solution": "1. Qh3+ Kg8 2. Nf6+ gxf6 3. Qh7+ Kf8 4. Qf7#"
        },
        {
            "fen": "r7/5B2/3npkP1/7K/1P3p2/5P2/p7/R7 b - - 0 1",
            "solution": "1... Rh8+ 2. Kg4 Nf5 3. Rh1 Rxh1 4. Kxf4 Rh4#"
        },
        {
            "fen": "2kr1b1r/pp1n1ppp/2n1p3/1N1pP3/QP1P4/P2q1N2/3B1PPP/2R1K2R w K - 0 1",
            "solution": "1. Rxc6+ bxc6 2. Qa6+ Kb8 3. Qxa7+ Kc8 4. Qc7#"
        },
        {
            "fen": "r1b1k2r/pp2bpp1/1np1p2p/8/4BB2/3R1N2/qPP1QPPP/2K4R b kq - 0 1",
            "solution": "1... Qa1+ 2. Kd2 Nc4+ 3. Kc3 Qxb2+ 4. Kxc4 b5#"
        },
        {
            "fen": "2r3k1/p4p2/1p2P1pQ/3bR2p/1q6/1B6/PP2RPr1/5K2 w - - 1 0",
            "solution": "1. exf7+ Bxf7 2. Re8+ Rxe8 3. Rxe8+ Qf8 4. Rxf8#"
        },
        {
            "fen": "r1bkr3/1p3ppp/p1p5/4P3/2B1n3/2P1B3/P1P3PP/R4RK1 w - - 1 0",
            "solution": "1. Bb6+ Kd7 2. Rad1+ Nd6 3. Rxd6+ Ke7 4. Rxf7#"
        },
        {
            "fen": "r4r1k/pppq1p1p/3p4/5p1Q/2B1Pp2/3P3P/PPn2P1K/R5R1 w - - 1 0",
            "solution": "1. Rg7 Kxg7 2. Qg5+ Kh8 3. Qf6+ Kg8 4. Rg1#"
        },
        {
            "fen": "2kr1b1r/ppq5/1np1pp2/P3Pn2/1P3P2/2P2Qp1/6P1/RNB1RBK1 b - - 0 1",
            "solution": "1... Rh1+ 2. Kxh1 Qh7+ 3. Qh5 Qxh5+ 4. Kg1 Qh2#"
        },
        {
            "fen": "2Q5/4ppbk/3p4/3P1NPp/4P3/5NB1/5PPK/rq6 w - - 1 0",
            "solution": "1. g6+ Kxg6 2. Nxe7+ Kh7 3. Qg8+ Kh6 4. Bf4#"
        },
        {
            "fen": "5r1k/p1p1q1pp/1p1p4/8/2PPn3/B1P1P3/P1Q1P2p/1R5K b - - 0 1",
            "solution": "1... Nf2+ 2. Kxh2 Qh4+ 3. Kg2 Qh3+ 4. Kg1 Qh1#"
        },
        {
            "fen": "2b5/3qr2k/5Q1p/P3B3/1PB1PPp1/4K1P1/8/8 w - - 1 0",
            "solution": "1. Bg8+ Kxg8 2. Qh8+ Kf7 3. Qg7+ Ke8 4. Qg8#"
        },
        {
            "fen": "r1bq1bkr/6pp/p1p3P1/1p1p3Q/4P3/8/PPP3PP/RNB2RK1 w - - 1 0",
            "solution": "1. gxh7+ Rxh7 2. Qf7+ Kh8 3. Qxf8+ Qxf8 4. Rxf8#"
        },
        {
            "fen": "rr4Rb/2pnqb1k/np1p1p1B/3PpP2/p1P1P2P/2N3R1/PP2BP2/1KQ5 w - - 1 0",
            "solution": "1. Bg7 Kxg8 2. Qh6 Bg6 3. Qxh8+ Kf7 4. fxg6#"
        },
        {
            "fen": "r4b1r/pp1n2k1/1qp1p2p/3pP1pQ/1P6/2BP2N1/P4PPP/R4RK1 w - - 1 0",
            "solution": "1. Nf5+ exf5 2. e6+ Kh7 3. Qf7+ Bg7 4. Qxg7#"
        },
        {
            "fen": "5k2/r3pp1p/6p1/q1pP3R/5B2/2b3PP/PQ3PK1/R7 w - - 1 0",
            "solution": "1. Qb8+ Qd8 2. Qxd8+ Kg7 3. Bh6+ Kf6 4. Qh8#"
        },
        {
            "fen": "r3r1k1/pp3pb1/3pb1p1/q5B1/1n2N3/3B1N2/PPP2PPQ/2K4R w - - 1 0",
            "solution": "1. Qh7+ Kf8 2. Qxg7+ Kxg7 3. Bf6+ Kg8 4. Rh8#"
        },
        {
            "fen": "4r1rk/pQ2P2p/P7/2pqb3/3p1p2/8/3B2PP/4RRK1 b - - 0 1",
            "solution": "1... Rxg2+ 2. Kh1 Rg1+ 3. Kxg1 Rg8+ 4. Kf2 Rg2#"
        },
        {
            "fen": "r6r/pp2pk1p/1n3b2/5Q1N/8/3B4/q4PPP/3RR1K1 w - - 1 0",
            "solution": "1. Rxe7+ Kxe7 2. Qxf6+ Kd7 3. Bf5+ Ke8 4. Ng7#"
        },
        {
            "fen": "3k4/1pp3b1/4b2p/1p3qp1/3Pn3/2P1RN2/r5P1/1Q2R1K1 b - - 0 1",
            "solution": "1... Rxg2+ 2. Kxg2 Qh3+ 3. Kg1 Qg3+ 4. Kh1 Nf2#"
        },
        {
            "fen": "r4k2/1pp3q1/3p1NnQ/p3P3/2P3p1/8/PP6/2K4R w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rh7+ Kf8 3. e6 Re8 4. Rf7#"
        },
        {
            "fen": "8/6R1/1p1p4/1P1Np2k/2P1N2p/3P1p1q/1B2PP2/6K1 w - - 1 0",
            "solution": "1. Nf4+ exf4 2. Rg5+ Kh6 3. Bg7+ Kh7 4. Nf6#"
        },
        {
            "fen": "4r1k1/1R4bp/pB2p1p1/P4p2/2r1pP1Q/2P4P/1q4P1/3R3K w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Rd7+ Kf8 3. Qf6+ Kg8 4. Qg7#"
        },
        {
            "fen": "r2r4/1bp2pk1/p3pNp1/4P1P1/2p2Q2/2P5/qP3PP1/2K4R w - - 1 0",
            "solution": "1. Rh7+ Kf8 2. Nd7+ Rxd7 3. Rh8+ Ke7 4. Qf6#"
        },
        {
            "fen": "r1kq1b1r/5ppp/p4n2/2pPR1B1/Q7/2P5/P4PPP/1R4K1 w - - 1 0",
            "solution": "1. Qc6+ Qc7 2. Re8+ Nxe8 3. Qxe8+ Qd8 4. Qxd8#"
        },
        {
            "fen": "1Q6/5pp1/1B2p1k1/3pPn1p/1b1P4/2r3PN/2q2PKP/R7 b - - 0 1",
            "solution": "1... Ne3+ 2. Kh1 Qe4+ 3. f3 Qxf3+ 4. Kg1 Qg2#"
        },
        {
            "fen": "8/pp2Q1p1/2p3kp/6q1/5n2/1B2R2P/PP1r1PP1/6K1 w - - 1 0",
            "solution": "1. Qe8+ Kh7 2. Bg8+ Kh8 3. Bf7+ Kh7 4. Qg8#"
        },
        {
            "fen": "5r1k/1p4pp/p2N4/3Qp3/P2n1bP1/5P1q/1PP2R1P/4R2K w - - 1 0",
            "solution": "1. Nf7+ Kg8 2. Nh6+ Kh8 3. Qg8+ Rxg8 4. Nf7#"
        },
        {
            "fen": "r1b1Q3/p1p3p1/1p3k1p/4N3/8/2P5/PP3PPP/2K4R w - - 1 0",
            "solution": "1. Qf7+ Kxe5 2. f4+ Kd6 3. Rd1+ Kc5 4. Qd5#"
        },
        {
            "fen": "3q1rk1/ppr1pp1p/n5pQ/2pP4/4PP1N/PP1n2PB/7P/1R3RK1 w - - 1 0",
            "solution": "1. Nf5 gxf5 2. Bxf5 Re8 3. Qxh7+ Kf8 4. Qh8#"
        },
        {
            "fen": "6k1/B2N1pp1/p6p/P3N1r1/4nb2/8/2R3B1/6K1 w - - 1 0",
            "solution": "1. Rc8+ Kh7 2. Nf8+ Kg8 3. Nfg6+ Kh7 4. Rh8#"
        },
        {
            "fen": "4kr2/3rn2p/1P4p1/2p5/Q1B2P2/8/P2q2PP/4R1K1 w - - 1 0",
            "solution": "1. Qa8+ Rd8 2. Rxe7+ Kxe7 3. Qe4+ Kd6 4. Qe6#"
        },
        {
            "fen": "2rkr3/3b1p1R/3R1P2/1p2Q1P1/pPq5/P1N5/1KP5/8 w - - 1 0",
            "solution": "1. Qxe8+ Kc7 2. Qxd7+ Kb8 3. Rb6+ Ka8 4. Qb7#"
        },
        {
            "fen": "3q1r2/pb3pp1/1p6/3pP1Nk/2r2Q2/8/Pn3PP1/3RR1K1 w - - 1 0",
            "solution": "1. g4+ Kg6 2. Qf5+ Kh6 3. Nxf7+ Rxf7 4. Qh5#"
        },
        {
            "fen": "8/8/2N5/8/8/p7/2K5/k7 w - - 1 0",
            "solution": "1. Nd4 Ka2 2. Ne2 Ka1 3. Nc1 a2 4. Nb3#"
        },
        {
            "fen": "r3r1k1/1b6/p1np1ppQ/4n3/4P3/PNB4R/2P1BK1P/1q6 w - - 1 0",
            "solution": "1. Bc4+ d5 2. Bxd5+ Re6 3. Bxe6+ Nf7 4. Qh8#"
        },
        {
            "fen": "1r1qrbk1/3b3p/p2p1pp1/3NnP2/3N4/1Q4BP/PP4P1/1R2R2K w - - 1 0",
            "solution": "1. Nxf6+ Kg7 2. Qg8+ Kxf6 3. Bh4+ g5 4. Bxg5#"
        },
        {
            "fen": "5r1k/1q4bp/3pB1p1/2pPn1B1/1r6/1p5R/1P2PPQP/R5K1 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh3+ Rh4 3. Qxh4+ Bh6 4. Qxh6#"
        },
        {
            "fen": "3r1kr1/8/p2q2p1/1p2R3/1Q6/8/PPP5/1K4R1 w - - 1 0",
            "solution": "1. Rf1+ Kg7 2. Re7+ Qxe7 3. Qxe7+ Kh6 4. Rh1#"
        },
        {
            "fen": "2R1R1nk/1p4rp/p1n5/3N2p1/1P6/2P5/P6P/2K5 w - - 1 0",
            "solution": "1. Nf6 Nce7 2. Rxe7 h5 3. Rxg8+ Rxg8 4. Rh7#"
        },
        {
            "fen": "r1br2k1/4p1b1/pq2pn2/1p4N1/7Q/3B4/PPP3PP/R4R1K w - - 1 0",
            "solution": "1. Bh7+ Kf8 2. Qh5 Qg1+ 3. Kxg1 Bd7 4. Qf7#"
        },
        {
            "fen": "R7/5pkp/3N2p1/2r3Pn/5r2/1P6/P1P5/2KR4 w - - 1 0",
            "solution": "1. Ne8+ Kf8 2. Nf6+ Rc8 3. Rxc8+ Ke7 4. Re8#"
        },
        {
            "fen": "8/1R4pp/k2rQp2/2p2P2/p2q1P2/1n1r2P1/6BP/4R2K w - - 1 0",
            "solution": "1. Qe8 Qg1+ 2. Kxg1 Rb6 3. Ra7+ Kxa7 4. Qa8#"
        },
        {
            "fen": "2b1k2r/3nb1pp/3npp2/B2pN1q1/Q2P4/4P3/PP3PPP/2R2RK1 w k - 0 1",
            "solution": "1. Rxc8+ Nxc8 2. Qxd7+ Kf8 3. Qxc8+ Bd8 4. Qxd8#"
        },
        {
            "fen": "r2b2Q1/1bq5/pp1k2p1/2p1n1B1/P3P3/2N5/1PP3PP/5R1K w - - 1 0",
            "solution": "1. Rd1+ Nd3 2. Rxd3+ Ke5 3. Rd5+ Bxd5 4. Qxd5#"
        },
        {
            "fen": "4Q3/1b5r/1p1kp3/5p1r/3p1nq1/P4NP1/1P3PB1/2R3K1 w - - 1 0",
            "solution": "1. Qf8+ Kd5 2. Qd8+ Rd7 3. Qxd7+ Ke4 4. Qxd4#"
        },
        {
            "fen": "2rr2k1/1b3ppp/nq1p4/pB1P2Q1/PpP5/1N6/1P4PP/4RR1K w - - 1 0",
            "solution": "1. Rxf7 g6 2. Qf6 Qg1+ 3. Kxg1 Bxd5 4. Qg7#"
        },
        {
            "fen": "r3r3/pppq1p1k/1bn2Bp1/3pPb2/1P1P4/P4N2/2BQ1PPP/R3R1K1 w - - 1 0",
            "solution": "1. Qg5 Bg4 2. Qh4+ Bh5 3. Qxh5+ Kg8 4. Qh8#"
        },
        {
            "fen": "R6R/2kr4/1p3pb1/3prN2/6P1/2P2K2/1P6/8 w - - 1 0",
            "solution": "1. Ra7+ Kc6 2. Rc8+ Rc7 3. Rcxc7+ Kb5 4. Nd4#"
        },
        {
            "fen": "7r/p3R3/BpkP4/2b1P1p1/8/1K2n1B1/P5P1/8 w - - 1 0",
            "solution": "1. Bb7+ Kb5 2. a4+ Ka5 3. Be1+ Bb4 4. Bxb4#"
        },
        {
            "fen": "rn3rk1/1p3pB1/p4b2/q4P1p/6Q1/1B6/PPp2P1P/R1K3R1 w - - 1 0",
            "solution": "1. Bxf6+ hxg4 2. Rxg4+ Kh7 3. Rh4+ Kg8 4. Rh8#"
        },
        {
            "fen": "r6r/p1qbB1kp/5p2/3Q2p1/8/P4N2/1P3PPP/4R1K1 w - - 1 0",
            "solution": "1. Bxf6+ Kf8 2. Bg7+ Kxg7 3. Re7+ Kf6 4. Qxg5#"
        },
        {
            "fen": "r2q4/pp1rpQbk/3p2p1/2pPP2p/5P2/2N5/PPP2P2/2KR3R w - - 1 0",
            "solution": "1. Rxh5+ gxh5 2. Rh1 Kh8 3. Rxh5+ Bh6 4. Rxh6#"
        },
        {
            "fen": "4qk2/6p1/p7/1p1Qp3/r1P2b2/1K5P/1P6/4RR2 w - - 1 0",
            "solution": "1. Rxf4+ exf4 2. Qf5+ Qf7 3. Qc8+ Qe8 4. Qxe8#"
        },
        {
            "fen": "r1b2rk1/p1qnbp1p/2p3p1/2pp3Q/4pP2/1P1BP1R1/PBPP2PP/RN4K1 w - - 1 0",
            "solution": "1. Qxh7+ Kxh7 2. Rh3+ Bh4 3. Rxh4+ Kg8 4. Rh8#"
        },
        {
            "fen": "qr3b1r/Q5pp/3p4/1kp5/2Nn1B2/Pp6/1P3PPP/2R1R1K1 w - - 1 0",
            "solution": "1. a4+ Kc6 2. Na5+ Kd5 3. Qf7+ Ne6 4. Rcd1#"
        },
        {
            "fen": "rnb2r1k/pp2q2p/2p2R2/8/2Bp3Q/8/PPP3PP/RN4K1 w - - 1 0",
            "solution": "1. Rxf8+ Qxf8 2. Qxd4+ Qg7 3. Qd8+ Qg8 4. Qxg8#"
        },
        {
            "fen": "8/8/p6p/1p3Kpk/1P2P3/P1b3P1/2N4P/8 w - - 1 0",
            "solution": "1. Ne3 Be1 2. Ng2 Bxg3 3. hxg3 g4 4. Nf4#"
        },
        {
            "fen": "5rk1/3p1p1p/p4Qq1/1p1P2R1/7N/n6P/2r3PK/8 w - - 1 0",
            "solution": "1. Nf5 Rxg2+ 2. Kxg2 Re8 3. Rxg6+ hxg6 4. Qg7#"
        },
        {
            "fen": "2b3k1/r3q2p/4p1pB/p4r2/4N3/P1Q5/1P4PP/2R2R1K w - - 1 0",
            "solution": "1. Qh8+ Kxh8 2. Rxc8+ Qf8 3. Rxf8+ Rxf8 4. Rxf8#"
        },
        {
            "fen": "6rk/6pp/2p2p2/2B2P1q/1P2Pb2/1Q5P/2P2P2/3R3K w - - 1 0",
            "solution": "1. Qxg8+ Kxg8 2. Rd8+ Qe8 3. Rxe8+ Kf7 4. Rf8#"
        },
        {
            "fen": "7r/p3pk2/1p6/1bp3K1/4BnP1/P1PP4/2n5/1R1R4 b - - 0 1",
            "solution": "1... Nh3+ 2. Kf5 Ne3+ 3. Ke5 Nxg4+ 4. Kf5 Bd7#"
        },
        {
            "fen": "3R4/Q4p1k/2q2Pp1/1p5p/1Pr2b2/P3p3/1B5P/6K1 b - - 0 1",
            "solution": "1... Bxh2+ 2. Kxh2 Rh4+ 3. Kg3 Rg4+ 4. Kh2 Qg2#"
        },
        {
            "fen": "2q4k/5pNP/p2p1BpP/4p3/1p2b3/1P6/P1r2R2/1K4Q1 w - - 1 0",
            "solution": "1. Ne6+ Kxh7 2. Ng5+ Kxh6 3. Qh2+ Qh3 4. Qxh3#"
        },
        {
            "fen": "1r6/1p3K1k/p3N3/P6n/6RP/2P5/8/8 w - - 1 0",
            "solution": "1. Rg6 Nf6 2. Ng5+ Kh8 3. Rh6+ Nh7 4. Rxh7#"
        },
        {
            "fen": "3r2k1/3N3p/4p1pQ/3p1p2/3P4/6BP/q4PPK/8 w - - 1 0",
            "solution": "1. Nf6+ Kf7 2. Qxh7+ Kxf6 3. Be5+ Kg5 4. f4#"
        },
        {
            "fen": "r1b2k2/1p4pp/p4N1r/4Pp2/P3pP1q/4P2P/1P2Q2K/3R2R1 w - - 1 0",
            "solution": "1. Rd8+ Kf7 2. Qc4+ Be6 3. Qc7+ Bd7 4. Qxd7#"
        },
        {
            "fen": "8/5p1k/4r1p1/2PP1p2/1Q6/1p3bbP/1B2pqP1/R5RK b - - 0 1",
            "solution": "1... Bxg2+ 2. Rxg2 Qf1+ 3. Rxf1 exf1=Q+ 4. Rg1 Qxh3#"
        },
        {
            "fen": "r4r1k/1bpq1p1n/p1np4/1p1Bb1BQ/P7/6R1/1P3PPP/1N2R1K1 w - - 1 0",
            "solution": "1. Bf6+ Bxf6 2. Be4 Qf5 3. Bxf5 Bxb2 4. Qxh7#"
        },
        {
            "fen": "rn3rk1/2qp2pp/p3P3/1p1b4/3b4/3B4/PPP1Q1PP/R1B2R1K w - - 1 0",
            "solution": "1. Bxh7+ Kxh7 2. Qh5+ Kg8 3. Rxf8+ Kxf8 4. Qf7#"
        },
        {
            "fen": "6k1/6pp/1q6/4pp2/P5n1/1P6/1P3BPr/R4QK1 b - - 0 1",
            "solution": "1... Rh1+ 2. Kxh1 Qh6+ 3. Bh4 Qxh4+ 4. Kg1 Qh2#"
        },
        {
            "fen": "6k1/1p2q2p/p3P1pB/8/1P2p3/2Qr2P1/P4P1P/2R3K1 w - - 1 0",
            "solution": "1. Qg7+ Qxg7 2. Rc8+ Rd8 3. Rxd8+ Qf8 4. Rxf8#"
        },
        {
            "fen": "rk1r4/p3RR2/1p3Q2/3q1p2/2p2P2/7P/2P3P1/7K w - - 1 0",
            "solution": "1. Rb7+ Qxb7 2. Qxd8+ Qc8 3. Qd6+ Qc7 4. Qxc7#"
        },
        {
            "fen": "8/R5p1/1R4p1/6k1/5p2/3r4/P3K3/3r4 b - - 0 1",
            "solution": "1... R3d2+ 2. Kf3 Rf1+ 3. Ke4 Re1+ 4. Kf3 Re3#"
        },
        {
            "fen": "8/4k3/P4RR1/2b1r3/3n2Pp/8/5KP1/8 b - - 0 1",
            "solution": "1... Nc2+ 2. Kf3 Ne1+ 3. Kf4 Nd3+ 4. Kf3 Re3#"
        },
        {
            "fen": "r3n1k1/pb5p/4N1p1/2pr4/q7/3B3P/1P1Q1PP1/2B1R1K1 w - - 1 0",
            "solution": "1. Qh6 Qf4 2. Bxf4 Rf5 3. Bxf5 gxf5 4. Qf8#"
        },
        {
            "fen": "r1bq1r1k/pp1nb1p1/2p1ppB1/3pP3/2PP4/2P5/P1QN1PPP/R1B1K2R w KQ - 0 1",
            "solution": "1. Qd1 Kg8 2. Qh5 Re8 3. Qh7+ Kf8 4. Qh8#"
        },
        {
            "fen": "3r2k1/1p3p1p/p1n2qp1/2B5/1P2Q2P/6P1/B2bRP2/6K1 w - - 1 0",
            "solution": "1. Qe8+ Rxe8 2. Rxe8+ Kg7 3. Bf8+ Kg8 4. Bh6#"
        },
        {
            "fen": "1r3r2/1p5R/p1n2pp1/1n1B1Pk1/8/8/P1P2BPP/2K1R3 w - - 1 0",
            "solution": "1. Bh4+ Kxf5 2. Be6+ Kf4 3. Bg3+ Kg5 4. h4#"
        },
        {
            "fen": "8/pp3r2/5p2/kPR3p1/3Q4/4P3/q5PK/8 w - - 1 0",
            "solution": "1. b6+ Ka6 2. Qd3+ Qc4 3. Qxc4+ Kxb6 4. Qb5#"
        },
        {
            "fen": "8/2B3R1/2p1pkp1/1r2N3/1p6/7P/2r3PK/8 w - - 1 0",
            "solution": "1. Rf7+ Kg5 2. Bd8+ Kh6 3. Ng4+ Kh5 4. Rh7#"
        },
        {
            "fen": "r2r4/1p1bn2p/pn2ppkB/5p2/4PQN1/6P1/PPq2PBP/R2R2K1 w - - 1 0",
            "solution": "1. Ne5+ fxe5 2. Qg5+ Kf7 3. Qg7+ Ke8 4. Qf8#"
        },
        {
            "fen": "6k1/6pp/pp1p3q/3P4/P1Q2b2/1NN1r2b/1PP4P/6RK b - - 0 1",
            "solution": "1... Bg2+ 2. Rxg2 Re1+ 3. Qf1 Rxf1+ 4. Rg1 Qxh2#"
        },
        {
            "fen": "3r1rk1/1q2b1n1/p1b1pRpQ/1p2P3/3BN3/P1PB4/1P4PP/4R2K w - - 1 0",
            "solution": "1. Ng5 Bxg2+ 2. Kg1 Rf7 3. Qh7+ Kf8 4. Qh8#"
        },
        {
            "fen": "r2qr3/pbpnb1kp/1p2Q1p1/3p4/3P4/2P3NP/PPBB2P1/R4RK1 w - - 1 0",
            "solution": "1. Rf7+ Kh8 2. Rxh7+ Kxh7 3. Qxg6+ Kh8 4. Qh7#"
        },
        {
            "fen": "r1b1qr2/pp2n1k1/3pp1pR/2p2pQ1/4PN2/2NP2P1/PP1K1PB1/n7 w - - 1 0",
            "solution": "1. Nh5+ Kg8 2. Rh8+ Kxh8 3. Qh6+ Kg8 4. Qg7#"
        },
        {
            "fen": "r1qb1rk1/3R1pp1/p1nR2p1/1p2p2N/6Q1/2P1B3/PP3PPP/6K1 w - - 1 0",
            "solution": "1. Rxg6 fxg6 2. Rxg7+ Kh8 3. Qxg6 Qf5 4. Rh7#"
        },
        {
            "fen": "r4r1k/pp1b2pn/8/3pR3/5N2/3Q4/Pq3PPP/5RK1 w - - 1 0",
            "solution": "1. Ng6+ Kg8 2. Ne7+ Kh8 3. Qxh7+ Kxh7 4. Rh5#"
        },
        {
            "fen": "1q1r1k2/1b2Rpp1/p1pQ3p/PpPp4/3P1NP1/1P3P1P/6K1/8 w - - 1 0",
            "solution": "1. Rxf7+ Kg8 2. Qg6 Qe5 3. dxe5 Kh8 4. Qxg7#"
        },
        {
            "fen": "8/QrkbR3/3p3p/2pP4/1P3N2/6P1/6pK/2q5 w - - 1 0",
            "solution": "1. Ne6+ Kc8 2. Qa8+ Rb8 3. Qc6+ Bxc6 4. Rc7#"
        },
        {
            "fen": "k2n1q1r/p1pB2p1/P4pP1/1Qp1p3/8/2P1BbN1/P7/2KR4 w - - 1 0",
            "solution": "1. Bc6+ Bxc6 2. Rxd8+ Qxd8 3. Qxc6+ Kb8 4. Qb7#"
        },
        {
            "fen": "3k4/R7/5N2/1p2n3/6p1/P1N2bP1/1r6/5K2 b - - 0 1",
            "solution": "1... Bg2+ 2. Ke1 Nd3+ 3. Kd1 Bf3+ 4. Ne2 Bxe2#"
        },
        {
            "fen": "4rqk1/1bp2r1p/1p1p2pQ/3P1p2/P1P5/2B3RP/2B3P1/6K1 w - - 1 0",
            "solution": "1. Rxg6+ Qg7 2. Rxg7+ Kf8 3. Rxf7+ Kxf7 4. Qg7#"
        },
        {
            "fen": "7k/3qbR1n/r5p1/3Bp1P1/1p1pP1r1/3P2Q1/1P5K/2R5 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qh3+ Rh4 3. Qxh4+ Kg7 4. Qh6#"
        },
        {
            "fen": "8/6pk/2qrQ3/5P1p/5PNK/2n5/7P/4R3 w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Qf7+ Kh8 3. Qf8+ Kh7 4. Re7#"
        },
        {
            "fen": "8/6k1/6p1/4p1K1/pPp1P1PP/3n1P2/6r1/R7 b - - 0 1",
            "solution": "1... Nf4 2. h5 Ne6+ 3. Kh4 g5+ 4. Kh3 Nf4#"
        },
        {
            "fen": "6k1/1p3pp1/p1b1p2p/q3r1b1/P7/1P5P/1NQ1RPP1/1B4K1 b - - 0 1",
            "solution": "1... Qe1+ 2. Rxe1 Rxe1+ 3. Kh2 Bf4+ 4. g3 Rh1#"
        },
        {
            "fen": "2rk2r1/3b3R/n3pRB1/p2pP1P1/3N4/1Pp5/P1K4P/8 w - - 1 0",
            "solution": "1. Rxd7+ Kxd7 2. Rf7+ Ke8 3. Rg7+ Kf8 4. Nxe6#"
        },
        {
            "fen": "8/pp3pk1/2b2b2/8/2Q2P1r/2P1q2B/PP4PK/5R2 b - - 0 1",
            "solution": "1... Rxh3+ 2. gxh3 Qd2+ 3. Qe2 Qxe2+ 4. Kg1 Qg2#"
        },
        {
            "fen": "k2r4/pp3p2/2p5/Q3p2p/4Kp1P/5R2/PP4q1/7R b - - 0 1",
            "solution": "1... Rd4+ 2. Kxe5 Qg7+ 3. Kf5 Qg6+ 4. Ke5 Re4#"
        },
        {
            "fen": "3r2r1/4q1Bp/4k3/nBP2p1Q/P3p2P/4P1R1/8/4K3 w - - 1 0",
            "solution": "1. Rg6+ hxg6 2. Qxg6+ Qf6 3. Qxf6+ Kd5 4. Qxf5#"
        },
        {
            "fen": "3r4/1p6/2p4p/5k2/p1P1n2P/3NK1nN/P1r5/1R2R3 b - - 0 1",
            "solution": "1... Rxd3+ 2. Kxd3 Rc3+ 3. Kd4 c5+ 4. Kd5 Rd3#"
        },
        {
            "fen": "6k1/1p5p/1p2bp2/1Pnp1N2/1r6/3nBB2/1P4PP/R5K1 w - - 1 0",
            "solution": "1. Ra8+ Bc8 2. Bxd5+ Ne6 3. Bxe6+ Kf8 4. Rxc8#"
        },
        {
            "fen": "4r2R/3q1kbR/1p4p1/p1pP1pP1/P1P2P2/K5Q1/1P2p3/8 w - - 1 0",
            "solution": "1. Rxg7+ Kxg7 2. Qc3+ Re5 3. Qxe5+ Kf7 4. Qf6#"
        },
        {
            "fen": "2R2bk1/r4ppp/3pp3/1B2n1P1/3QP2P/5P2/1PK5/7q w - - 1 0",
            "solution": "1. Rxf8+ Kxf8 2. Qxd6+ Re7 3. Qb8+ Re8 4. Qxe8#"
        },
        {
            "fen": "1rbq1rk1/p3npbp/2npp1PB/2p5/1p2P3/2NP2P1/PPPQ1PB1/R3K1NR w KQ - 0 1",
            "solution": "1. gxh7+ Kh8 2. Bxg7+ Kxg7 3. Qh6+ Kh8 4. Qf6#"
        },
        {
            "fen": "6r1/3p2qk/4P3/1R5p/3b1prP/3P2B1/2P1QP2/6RK b - - 0 1",
            "solution": "1... Rxh4+ 2. Kg2 Qxg3+ 3. fxg3 Rxg3+ 4. Kf1 Rxg1#"
        },
        {
            "fen": "5k1r/3b4/3p1p2/p4Pqp/1pB5/1P4r1/P1P5/1K1RR2Q w - - 1 0",
            "solution": "1. Qa8+ Bc8 2. Qxc8+ Kg7 3. Re7+ Kh6 4. Qxh8#"
        },
        {
            "fen": "r3rk2/p3bp2/2p1qB2/1p1nP1RP/3P4/2PQ4/P5P1/5RK1 w - - 1 0",
            "solution": "1. Rg8+ Kxg8 2. Qg3+ Qg4 3. Qxg4+ Kh7 4. Qg7#"
        },
        {
            "fen": "3R4/1p6/p1b1Q2p/6pk/1P6/P6P/1q4PK/8 w - - 1 0",
            "solution": "1. Qf7+ Kh4 2. Rd4+ Be4 3. Rxe4+ g4 4. Rxg4#"
        },
        {
            "fen": "1R3nk1/5pp1/3N2b1/4p1n1/2BqP1Q1/8/8/7K w - - 1 0",
            "solution": "1. Rxf8+ Kxf8 2. Qc8+ Ke7 3. Qc7+ Kf8 4. Qd8#"
        },
        {
            "fen": "2rqnk2/pp2p1b1/3pbpQR/4P1p1/2r3P1/1NN1BP2/PPP5/2K4R w - - 1 0",
            "solution": "1. Rh8+ Bg8 2. Rxg8+ Kxg8 3. e6 Nc7 4. Qf7#"
        },
        {
            "fen": "1k2r3/7p/1p6/2p1r1nP/p1Pp1Np1/3K2P1/PPR2P2/2R5 b - - 0 1",
            "solution": "1... Re3+ 2. fxe3 Rxe3+ 3. Kd2 Nf3+ 4. Kd1 Re1#"
        },
        {
            "fen": "2kr3r/R4Q2/1pq1n3/7p/3R1B1P/2p3P1/2P2P2/6K1 w - - 1 0",
            "solution": "1. Ra8+ Qxa8 2. Rc4+ Qc6 3. Rxc6+ Nc7 4. Qxc7#"
        },
        {
            "fen": "2r2n1k/2q3pp/p2p1b2/2nB1P2/1p1N4/8/PPP4Q/2K3RR w - - 1 0",
            "solution": "1. Qxh7+ Nxh7 2. Rxh7+ Kxh7 3. Rh1+ Bh4 4. Rxh4#"
        },
        {
            "fen": "7r/pp4Q1/1qp2p1r/5k2/2P4P/1PB5/P4PP1/4R1K1 w - - 1 0",
            "solution": "1. Re5+ fxe5 2. Qxe5+ Kg6 3. Qf6+ Kh5 4. Qg5#"
        },
        {
            "fen": "8/2Q1R1bk/3r3p/p2N1p1P/P2P4/1p3Pq1/1P4P1/1K6 w - - 1 0",
            "solution": "1. Nf6+ Rxf6 2. Qxg3 Rf7 3. Rxf7 Kh8 4. Qxg7#"
        },
        {
            "fen": "6k1/6p1/p5p1/3pB3/1p1b4/2r1q1PP/P4R1K/5Q2 w - - 1 0",
            "solution": "1. Rf8+ Kh7 2. Rh8+ Kxh8 3. Qf8+ Kh7 4. Qxg7#"
        },
        {
            "fen": "2rq1rk1/pp4p1/2pb1pN1/n2p3Q/3P4/2N1B3/PPP2PP1/2K4R w - - 1 0",
            "solution": "1. Nh8 Nb3+ 2. Kd1 Bh2 3. Rxh2 Nxd4 4. Qh7#"
        },
        {
            "fen": "4r1k1/3r1p1p/bqp1n3/p2p1NP1/Pn1Q1b2/7P/1PP3B1/R2NR2K w - - 1 0",
            "solution": "1. Rxe6 fxe6 2. Nh6+ Kf8 3. Qf6+ Rf7 4. Qxf7#"
        },
        {
            "fen": "4r3/2RN4/p1r5/1k1p4/5Bp1/p2P4/1P4PK/8 w - - 1 0",
            "solution": "1. Rb7+ Ka4 2. b3+ Ka5 3. Bd2+ Rc3 4. Bxc3#"
        },
        {
            "fen": "4rk1r/p2b1pp1/1q5p/3pR1n1/3N1p2/1P1Q1P2/PBP3PK/4R3 w - - 1 0",
            "solution": "1. Rxe8+ Bxe8 2. Ba3+ Qd6 3. Bxd6+ Kg8 4. Rxe8#"
        },
        {
            "fen": "2b1rqk1/r1p2pp1/pp4n1/3Np1Q1/4P2P/1BP5/PP3P2/2KR2R1 w - - 1 0",
            "solution": "1. Nf6+ gxf6 2. Qxg6+ Kh8 3. Qh5+ Qh6+ 4. Qxh6#"
        },
        {
            "fen": "8/5r2/3R4/3Pp1p1/p2pPk1p/P2PbP2/1P2K2P/4B3 w - - 1 0",
            "solution": "1. Rg6 Bg1 2. Bxh4 Bxh2 3. Rxg5 Bg1 4. Rg4#"
        },
        {
            "fen": "b4rk1/5Npp/p3B3/1p6/8/3R4/PP4nP/6K1 w - - 1 0",
            "solution": "1. Ne5+ Kh8 2. Ng6+ hxg6 3. Rh3+ Nh4 4. Rxh4#"
        },
        {
            "fen": "1r3r1k/2R4p/q4ppP/3PpQ2/2RbP3/pP6/P2B2P1/1K6 w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Qd7+ Rf7 3. Qxf7+ Kh8 4. Qg7#"
        },
        {
            "fen": "2r1k2r/1p2pp1p/1p2b1pQ/4B3/3n4/2qB4/P1P2PPP/2KRR3 b - - 0 1",
            "solution": "1... Qxc2+ 2. Bxc2 Rxc2+ 3. Kb1 Bxa2+ 4. Ka1 Nb3#"
        },
        {
            "fen": "4q3/pb5p/1p2p2k/4N3/PP1QP3/2P2PP1/6K1/8 w - - 1 0",
            "solution": "1. Ng4+ Kh5 2. Qe5+ Kg6 3. Qf6+ Kh5 4. Qh6#"
        },
        {
            "fen": "7k/1p1P1Qpq/p6p/5p1N/6N1/7P/PP1r1PPK/8 w - - 1 0",
            "solution": "1. Ngf6 gxf6 2. Qxf6+ Kg8 3. Qd8+ Kf7 4. Qe8#"
        },
        {
            "fen": "1R6/rbr2p2/5Pkp/2pBP1p1/ppP3P1/5K1P/P1PR4/8 w - - 1 0",
            "solution": "1. Bxb7 Raxb7 2. Rg8+ Kh7 3. Rg7+ Kh8 4. Rd8#"
        },
        {
            "fen": "r3r3/2qb1pkp/p2p2pN/1p1pn3/7Q/P3B3/1PP1B1PP/R6K w - - 1 0",
            "solution": "1. Nf5+ gxf5 2. Bh6+ Kg8 3. Qf6 Qxc2 4. Qg7#"
        },
        {
            "fen": "1k6/5Q2/2Rr2pp/pqP5/1p6/7P/2P3PK/4r3 w - - 1 0",
            "solution": "1. Qc7+ Ka8 2. Qc8+ Qb8 3. Qa6+ Qa7 4. Rc8#"
        },
        {
            "fen": "5r1k/4R3/6pP/r1pQPp2/5P2/2p1PN2/2q5/5K1R w - - 1 0",
            "solution": "1. Rh7+ Kxh7 2. Qd7+ Rf7 3. Qxf7+ Kh8 4. Qg7#"
        },
        {
            "fen": "3n3k/1p3B2/p2p1P2/2rP1br1/5p2/2P5/PP6/2KR2R1 w - - 1 0",
            "solution": "1. Rh1+ Bh7 2. Rxh7+ Kxh7 3. Rh1+ Rh5 4. Rxh5#"
        },
        {
            "fen": "2r1rk2/6b1/1q2ppP1/pp1PpQB1/8/PPP2BP1/6K1/7R w - - 1 0",
            "solution": "1. Qxf6+ Bxf6 2. Bxf6 Qf2+ 3. Kxf2 exd5 4. Rh8#"
        },
        {
            "fen": "8/8/8/k1KB4/5r2/4R3/8/8 w - - 1 0",
            "solution": "1. Be4 Rf5+ 2. Bxf5 Ka6 3. Re7 Ka5 4. Ra7#"
        },
        {
            "fen": "r1b2rk1/5pb1/p1n1p3/4B3/4N2R/8/1PP1p1PP/5RK1 w - - 1 0",
            "solution": "1. Nf6+ Bxf6 2. Bxf6 exf1=Q+ 3. Kxf1 Re8 4. Rh8#"
        },
        {
            "fen": "3r1nQ1/1b4p1/1p3k1p/p1q5/P2N4/5P2/6PP/1B2R2K w - - 1 0",
            "solution": "1. Re6+ Nxe6 2. Qxe6+ Kg5 3. h4+ Kf4 4. Ne2#"
        },
        {
            "fen": "6k1/ppp1q1pp/4p3/P7/1P2P1n1/2P1b2P/5rP1/RN2QB1K b - - 0 1",
            "solution": "1... Qh4 2. Ra2 Qg3 3. hxg4 Rxf1+ 4. Qxf1 Qh4#"
        },
        {
            "fen": "4r1k1/3N1ppp/3r4/8/1n3p1P/5P2/PP3K1P/RN5R b - - 0 1",
            "solution": "1... Nd3+ 2. Kf1 Re1+ 3. Kg2 Rg6+ 4. Kh3 Nf2#"
        },
        {
            "fen": "8/1bn5/ppk4q/1p1pQ2B/5P2/P3R2P/1Pr5/3R3K w - - 1 0",
            "solution": "1. Be8+ Nxe8 2. Qxd5+ Kc7 3. Re7+ Kb8 4. Qxb7#"
        },
        {
            "fen": "1r3k2/5p1p/1qbRp3/2r1Pp2/ppB4Q/1P6/P1P4P/1K1R4 w - - 1 0",
            "solution": "1. Qh6+ Ke7 2. Rxe6+ fxe6 3. Qxe6+ Kf8 4. Qf7#"
        },
        {
            "fen": "5r1k/3q3p/p2B1npb/P2np3/4N3/2N2b2/5PPP/R3QRK1 b - - 0 1",
            "solution": "1... Qh3 2. gxh3 Nf4 3. Ng5 Bxg5 4. Bxf8 Nxh3#"
        },
        {
            "fen": "6k1/8/3PN1p1/3Pp3/6r1/5p2/3q3P/5Q1K b - - 0 1",
            "solution": "1... Qe2 2. Qxe2 fxe2 3. h3 e1=Q+ 4. Kh2 Qg1#"
        },
        {
            "fen": "2r3k1/pb3ppp/8/qP2b3/8/1P6/1P1RQPPP/1K3B1R b - - 0 1",
            "solution": "1... Rc1+ 2. Kxc1 Qa1+ 3. Kc2 Qxb2+ 4. Kd3 Qc3#"
        },
        {
            "fen": "r1b2RB1/pp4p1/q5kp/5p2/3Q1P2/6P1/1PPK3P/8 w - - 1 0",
            "solution": "1. Bf7+ Kh7 2. Rh8+ Kxh8 3. Qd8+ Kh7 4. Qg8#"
        },
        {
            "fen": "r3k3/3b3R/1n1p1b1Q/1p1PpP1N/1P2P1P1/6K1/2B1q3/8 w - - 1 0",
            "solution": "1. Rh8+ Bxh8 2. Qxh8+ Kf7 3. Qf6+ Ke8 4. Ng7#"
        },
        {
            "fen": "5k1r/6p1/1Qq2p1p/2r1p3/2B3P1/1P6/1PP5/2K2R2 w - - 1 0",
            "solution": "1. Qd8+ Qe8 2. Rxf6+ gxf6 3. Qxf6+ Qf7 4. Qxf7#"
        },
        {
            "fen": "r1b2r2/4nn1k/1q2PQ1p/5p2/pp5R/5N2/5PPP/5RK1 w - - 1 0",
            "solution": "1. Ng5+ Kg8 2. exf7+ Rxf7 3. Qxf7+ Kh8 4. Qh7#"
        },
        {
            "fen": "7r/1p3bk1/1Pp2p2/3p2p1/3P1nq1/1QPNR1P1/5P2/5BK1 b - - 0 1",
            "solution": "1... Qh5 2. Bg2 Qh2+ 3. Kf1 Qh1+ 4. Bxh1 Rxh1#"
        },
        {
            "fen": "6r1/pp3p1k/4bQ1p/2p2P1N/2P5/1P5P/1P3P1q/3R1K2 w - - 1 0",
            "solution": "1. Qg7+ Rxg7 2. Nf6+ Kh8 3. Rd8+ Rg8 4. Rxg8#"
        },
        {
            "fen": "r1bq1rk1/pp1nb1pp/5p2/6B1/3pQ3/3BPN2/PP3PPP/R4RK1 w - - 1 0",
            "solution": "1. Qxh7+ Kf7 2. Bc4+ Ke8 3. Qg6+ Rf7 4. Qxf7#"
        },
        {
            "fen": "3k4/1R6/1P2PNp1/7p/2n4P/8/4rPP1/6K1 w - - 1 0",
            "solution": "1. e7+ Kc8 2. Rc7+ Kb8 3. Nd7+ Ka8 4. Ra7#"
        },
        {
            "fen": "2r3k1/pp2Bp1p/6p1/1P2P3/P7/1q2bP1P/3Q2P1/3R3K w - - 1 0",
            "solution": "1. Qd8+ Rxd8 2. Rxd8+ Kg7 3. Bf8+ Kg8 4. Bh6#"
        },
        {
            "fen": "1R1br1k1/pR5p/2p3pB/2p2P2/P1qp2Q1/2n4P/P5P1/6K1 w - - 1 0",
            "solution": "1. Rg7+ Kh8 2. Rxh7+ Kxh7 3. Qxg6+ Kh8 4. Qg7#"
        },
        {
            "fen": "4kb1r/1R6/p2rp3/2Q1p1q1/4p3/3B4/P6P/4KR2 w - - 1 0",
            "solution": "1. Bb5+ axb5 2. Qxb5+ Kd8 3. Rb8+ Kc7 4. Qb7#"
        },
        {
            "fen": "6k1/2R5/4p1pp/8/5PPK/P3Q2P/1q4r1/8 b - - 0 1",
            "solution": "1... Qf6+ 2. g5 hxg5+ 3. fxg5 Qh8+ 4. Rh7 Qxh7#"
        },
        {
            "fen": "3qr1k1/1pp3rn/p2p1Qp1/3P1pP1/2P2P2/2P2BK1/P6R/7R w - - 1 0",
            "solution": "1. Qxg7+ Kxg7 2. Rxh7+ Kf8 3. Rh8+ Ke7 4. R1h7#"
        },
        {
            "fen": "4rnrk/ppqn2p1/4p1Pp/2p5/2PP1P2/3N3R/PP1N2Q1/1K4R1 w - - 1 0",
            "solution": "1. Rxh6+ gxh6 2. g7+ Kh7 3. Qe4+ Ng6 4. Qxg6#"
        },
        {
            "fen": "5rk1/pp2Rppp/nqp5/8/5Q2/6PB/PPP2P1P/6K1 w - - 1 0",
            "solution": "1. Qxf7+ Rxf7 2. Re8+ Rf8 3. Be6+ Kh8 4. Rxf8#"
        },
        {
            "fen": "3rk3/1q4pp/3B1p2/3R4/1pQ5/1Pb5/P4PPP/6K1 w - - 1 0",
            "solution": "1. Re5+ Kd7 2. Qe6+ Kc6 3. Bb8+ Rd6 4. Qxd6#"
        },
        {
            "fen": "8/3n2pp/2qBkp2/ppPpp1P1/1P2P3/1Q6/P4PP1/6K1 w - - 1 0",
            "solution": "1. Qh3+ Kf7 2. Qh5+ Kg8 3. Qe8+ Nf8 4. Qxf8#"
        },
        {
            "fen": "r1b2r1k/p1n3b1/7p/5q2/2BpN1p1/P5P1/1P1Q1NP1/2K1R2R w - - 1 0",
            "solution": "1. Rxh6+ Bxh6 2. Qxh6+ Qh7 3. Qxf8+ Qg8 4. Qxg8#"
        },
        {
            "fen": "r3rb2/2qnk2p/p1bp2pB/n3p1N1/P3P3/2P3N1/Q4PPP/1R2R1K1 w - - 1 0",
            "solution": "1. Qe6+ Kd8 2. Nf7+ Kc8 3. Qxe8+ Qd8 4. Qxd8#"
        },
        {
            "fen": "2q5/p3p2k/3pP1p1/2rN2Pn/1p1Q4/7R/PPr5/1K5R w - - 1 0",
            "solution": "1. Rxh5+ gxh5 2. Rxh5+ Kg6 3. Rh6+ Kxg5 4. Qf4#"
        },
        {
            "fen": "2q3k1/1b1Q2bp/p1n2pp1/1p6/4B3/5N2/1PP2PPP/4R1K1 w - - 1 0",
            "solution": "1. Bd5+ Kh8 2. Re8+ Bf8 3. Qf7 Qxe8 4. Qg8#"
        },
        {
            "fen": "1Q6/1R3pk1/4p2p/p3n3/P3P2P/6PK/r5B1/3q4 b - - 0 1",
            "solution": "1... Qg4+ 2. Kh2 Nf3+ 3. Kh1 Qh3+ 4. Bxh3 Rh2#"
        },
        {
            "fen": "r4r2/2qnbpkp/b3p3/2ppP1N1/p2P1Q2/P1P5/5PPP/nBBR2K1 w - - 1 0",
            "solution": "1. Nxe6+ fxe6 2. Qh6+ Kf7 3. Qh5+ Kg8 4. Qxh7#"
        },
        {
            "fen": "5Q2/1p3p1N/2p3p1/5b1k/2P3n1/P4RP1/3q2rP/5R1K w - - 1 0",
            "solution": "1. Rxf5+ g5 2. Qxf7+ Kh6 3. Rf6+ Nxf6 4. Rxf6#"
        },
        {
            "fen": "rn3rk1/pp3p2/2b1pnp1/4N3/3q4/P1NB3R/1P1Q1PPP/R5K1 w - - 1 0",
            "solution": "1. Qh6 Nh5 2. Rxh5 Qxf2+ 3. Kxf2 gxh5 4. Qh7#"
        },
        {
            "fen": "r4rk1/1q2bp1p/5Rp1/pp1Pp3/4B2Q/P2R4/1PP3PP/7K w - - 1 0",
            "solution": "1. Rh3 h5 2. Qxh5 gxh5 3. Rg3+ Kh8 4. Rh6#"
        },
        {
            "fen": "r1br1b2/4pPk1/1p1q3p/p2PR3/P1P2N2/1P1Q2P1/5PBK/4R3 w - - 1 0",
            "solution": "1. Re6 Qxe6 2. Rxe6 Bxe6 3. Qg6+ Kh8 4. Qg8#"
        },
        {
            "fen": "6r1/1p1qp1rk/p2pR1p1/3P2Qp/7P/5P2/PPP5/1K4R1 w - - 1 0",
            "solution": "1. Rxg6 Rxg6 2. Qxh5+ Kg7 3. Qxg6+ Kf8 4. Qxg8#"
        },
        {
            "fen": "5rk1/pp1qpR2/6Pp/3ppNbQ/2nP4/B1P5/P5PP/6K1 w - - 1 0",
            "solution": "1. Rg7+ Kh8 2. Qxh6+ Bxh6 3. Rh7+ Kg8 4. Nxh6#"
        },
        {
            "fen": "4k3/1p2rn2/pP1p1Q2/3Pp3/4Pp2/5q2/1PR5/1KN3B1 w - - 1 0",
            "solution": "1. Rc8+ Nd8 2. Qg6+ Kf8 3. Rxd8+ Re8 4. Rxe8#"
        },
        {
            "fen": "r1br4/1p2bpk1/p1nppn1p/5P2/4P2B/qNNB3R/P1PQ2PP/7K w - - 1 0",
            "solution": "1. Qxh6+ Kg8 2. Rg3+ Ng4 3. Rxg4+ Bg5 4. Rxg5#"
        },
        {
            "fen": "3Q4/6kp/4q1p1/2pnN2P/1p3P2/1Pn3P1/6BK/8 w - - 1 0",
            "solution": "1. h6+ Kxh6 2. Qf8+ Kh5 3. Bf3+ Qg4 4. Bxg4#"
        },
        {
            "fen": "3r3r/ppk2B2/2n1Q1pp/5p2/3p4/q5P1/5P1P/1RR3K1 w - - 1 0",
            "solution": "1. Rxb7+ Kxb7 2. Qxc6+ Kb8 3. Rb1+ Qb4 4. Rxb4#"
        },
        {
            "fen": "r6r/1q1nbkp1/pn2p2p/1p1pP1P1/3P1N1P/1P1Q1P2/P2B1K2/R6R w - - 1 0",
            "solution": "1. Qg6+ Kg8 2. Qxe6+ Kf8 3. Ng6+ Ke8 4. Qxe7#"
        },
        {
            "fen": "5r1k/r2b1p1p/p4Pp1/1p2R3/3qBQ2/P7/6PP/2R4K w - - 1 0",
            "solution": "1. Qh6 Qd1+ 2. Rxd1 Rg8 3. Rh5 gxh5 4. Qxh7#"
        },
        {
            "fen": "5Q2/1R6/p5p1/3P3k/2p1rP1p/8/4p1PP/q4BK1 w - - 1 0",
            "solution": "1. Rh7+ Kg4 2. Rxh4+ Kxh4 3. Qh6+ Kg4 4. Qg5#"
        },
        {
            "fen": "4r1k1/5q2/p5pQ/3b1pB1/2pP4/2P3P1/1P2R1PK/8 w - - 1 0",
            "solution": "1. Bf6 Qh7 2. Rxe8+ Kf7 3. Qxh7+ Kxe8 4. Qe7#"
        },
        {
            "fen": "5rk1/1R4b1/3p4/1P1P4/4Pp2/3B1Pnb/PqRK1Q2/8 b - - 0 1",
            "solution": "1... Bc3+ 2. Kd1 Qb1+ 3. Rc1 Qxd3+ 4. Qd2 Qxd2#"
        },
        {
            "fen": "2rq1n1Q/p1r2k2/2p1p1p1/1p1pP3/3P2p1/2N4R/PPP2P2/2K4R w - - 1 0",
            "solution": "1. Rh7+ Ke8 2. Qxf8+ Kxf8 3. Rh8+ Ke7 4. R1h7#"
        },
        {
            "fen": "8/pp2k1r1/3Np2p/5p1P/8/2Q3P1/5P1K/1q6 w - - 1 0",
            "solution": "1. Qc7+ Kf6 2. Ne8+ Kg5 3. Qxg7+ Kxh5 4. Nf6#"
        },
        {
            "fen": "2r1rk2/1b2b1p1/p1q2nP1/1p2Q3/4P3/P1N1B3/1PP1B2R/2K4R w - - 1 0",
            "solution": "1. Rf2 Kg8 2. Qh2 Nh5 3. Qxh5 Bh4 4. Qh7#"
        },
        {
            "fen": "4r3/5kp1/1N1p4/2pR1q1p/8/pP3PP1/6K1/3Qr3 b - - 0 1",
            "solution": "1... R8e2+ 2. Qxe2 Rxe2+ 3. Kf1 Qxf3+ 4. Kg1 Qg2#"
        },
        {
            "fen": "2R3nk/3r2b1/p2pr1Q1/4pN2/1P6/P6P/q7/B4RK1 w - - 1 0",
            "solution": "1. Rxg8+ Kxg8 2. Nh6+ Kh8 3. Rf8+ Bxf8 4. Qg8#"
        },
        {
            "fen": "8/6pk/1R2p2p/1P1pPp2/3P1P1K/1r5P/5QP1/2q5 b - - 0 1",
            "solution": "1... g5+ 2. Kh5 Rxh3+ 3. gxh3 Qd1+ 4. Qe2 Qxe2#"
        },
        {
            "fen": "6Q1/1q2N1n1/3p3k/3P3p/2P5/3bp1P1/1P4BP/6K1 w - - 1 0",
            "solution": "1. Qh8+ Bh7 2. Be4 Qxe7 3. Qxh7+ Kg5 4. Qg6#"
        },
        {
            "fen": "2r4k/p4rRp/1p1R3B/5p1q/2Pn4/5p2/PP4QP/1B5K w - - 1 0",
            "solution": "1. Rg8+ Rxg8 2. Qxg8+ Kxg8 3. Rd8+ Rf8 4. Rxf8#"
        },
        {
            "fen": "1r1r4/Rp2np2/3k4/3P3p/2Q2p2/2P4q/1P1N1P1P/6RK w - - 1 0",
            "solution": "1. Ne4+ Kd7 2. Nf6+ Kd6 3. Qxf4+ Kc5 4. Qb4#"
        },
        {
            "fen": "r2B1bk1/1p5p/2p2p2/p1n5/4P1BP/P1Nb4/KPn3PN/3R3R b - - 0 1",
            "solution": "1... Nb4+ 2. axb4 axb4+ 3. Ba5 Rxa5+ 4. Na4 Rxa4#"
        },
        {
            "fen": "6r1/Q4p2/4pq1k/3p2Nb/P4P1K/4P3/7P/2R5 b - - 0 1",
            "solution": "1... Rxg5 2. Qe7 Rg4+ 3. Kh3 Qxe7 4. Rc8 Qh4#"
        },
        {
            "fen": "5rk1/p3br1p/8/2p3p1/N2pPB2/1P1P1qPb/P2Q3P/R3R1K1 b - - 0 1",
            "solution": "1... Rxf4 2. gxf4 Rxf4 3. Rac1 Rg4+ 4. Qg2 Qxg2#"
        },
        {
            "fen": "3Q1b2/5pk1/p3rNpp/1p2P3/4NP2/nP6/P3q1PP/3R3K w - - 1 0",
            "solution": "1. Qxf8+ Kxf8 2. Rd8+ Re8 3. Rxe8+ Kg7 4. Rg8#"
        },
        {
            "fen": "1r1q4/5k2/1p1p2p1/2p4p/pPP1B1N1/P3Q1P1/2r2P1P/6K1 w - - 1 0",
            "solution": "1. Bd5+ Kf8 2. Qf4+ Qf6 3. Qxf6+ Ke8 4. Bc6#"
        },
        {
            "fen": "3R4/7R/1P2k3/3p1pr1/3B4/2P5/r5b1/5BK1 w - - 1 0",
            "solution": "1. Re8+ Kd6 2. Rh6+ Rg6 3. Rxg6+ Kd7 4. Bb5#"
        },
        {
            "fen": "6k1/pp1n2p1/8/5q2/b1pPp2Q/P1Pr4/4RB2/RK6 b - - 0 1",
            "solution": "1... Qb5+ 2. Rb2 Rd1+ 3. Ka2 Bb3+ 4. Rxb3 Qxb3#"
        },
        {
            "fen": "4Nr1k/1bp2p1p/1r4p1/3P4/1p1q1P1Q/4R3/P5PP/4R2K w - - 1 0",
            "solution": "1. Qh6 Kg8 2. Re5 Qxe5 3. Rxe5 Rxe8 4. Rxe8#"
        },
        {
            "fen": "1r2r2k/1q1n1p1p/p1b1pp2/3pP3/1b5R/2N1BBQ1/1PP3PP/3R3K w - - 1 0",
            "solution": "1. Rxh7+ Kxh7 2. Rd4 Bf8 3. Rh4+ Bh6 4. Rxh6#"
        },
    ],
}